{"row_idx": 0, "abstractions": ["1. <note>\n  <description>Convert a digit string in base b to a polynomial: if digits are dₖ…d₁d₀, its value is ∑ᵢ₌₀ᵏ dᵢ·bⁱ. This lets you turn base-b arithmetic into algebraic expressions.</description>\n  <example>For base b, the string “123” represents 1·b² + 2·b¹ + 3·b⁰. If b=5, it equals 1·25 + 2·5 + 3 = 38.</example>\n</note>\n2. <note>\n  <description>Divisibility in base b means (digit-string₁)/(digit-string₂) is an integer. Equivalently, (polynomial₁) mod (polynomial₂) = 0. Use this to set up equations.</description>\n  <example>For “17” and “97” in base b, write (b+7) mod (b²+9b+7) = 0. Solve for b so that the remainder is zero.</example>\n</note>\n3. <note>\n  <description>Apply the Euclidean algorithm: divide the larger polynomial by the smaller and keep the remainder. Repeat until the remainder is zero or constant. The last non-zero remainder is the gcd.</description>\n  <example>Divide (b²+9b+7) by (b+7): quotient = b+2, remainder = (b²+9b+7) − (b+2)(b+7) = 0, so gcd = b+7.</example>\n</note>\n4. <note>\n  <description>For a linear divisor (b+7) to divide (b²+9b+7), set b+7 = 1 or b+7 = a factor of the constant term. Solve for integer b, then check divisibility.</description>\n  <example>If b+7 = 1, b = −6 (reject if b>9). If b+7 divides the constant remainder in a quadratic, solve b+7 = d for each d dividing that remainder.</example>\n</note>\n5. <note>\n  <description>Always enforce base constraints: the base must be greater than any digit. After solving algebraically, discard any solution below the maximal digit.</description>\n  <example>If digits are 7, 9, and 1, base b must exceed 9. If a solution yields b=8, discard it; if b=10, accept it.</example>\n</note>", "<note1>\n    <description>Convert any number in base b to its decimal form by summing each digit multiplied by b raised to the digit’s position index. This lets you express divisibility conditions algebraically.</description>\n    <example>For a two-digit number X in base b, write X = x₁·b + x₀ in decimal. If you need to check if X divides another number, convert both to this form.</example>\n  </note2>\n  <note3>\n    <description>When one base-b number divides another, in decimal form their ratio must be an integer. Set up a rational expression with the converted digits and require it to be an integer.</description>\n    <example>Given A = a₁·b + a₀ and B = b₁·b + b₀, the condition A | B becomes (b₁·b + b₀) ÷ (a₁·b + a₀) ∈ ℤ. Solve for b under this constraint.</example>\n  </note3>\n  <note4>\n    <description>Use bounding arguments to limit possible bases. A digit x in base b must satisfy 0 ≤ x ≤ b−1, so any digit restriction gives a lower bound on b.</description>\n    <example>If a₁ appears in A = a₁·b + a₀, then a₁ ≤ b−1, so b ≥ a₁ + 1. This ensures the digit stays in valid range.</example>\n  </note5>\n  <note6>\n    <description>Check parity or other simple divisibility criteria first to eliminate large or impossible cases. For example, a number divisible by an odd base b must itself be odd.</description>\n    <example>If you need b odd and A = a₁·b + a₀ to be divisible by b, then A mod b = a₀ ≡ 0 mod b. This restricts a₀ to be a multiple of b, which can rule out many bases.</example>\n  </note6>", "base10 = 17_b = 1·b + 7 = b + 7\nbase10 = 97_b = 9·b + 7\nDivisibility: (9b + 7) mod (b + 7) = 0 ⇒ 9b + 7 ≡ 0 (mod b + 7)\nSubstitute t = b + 7 ⇒ b = t – 7 ⇒ 9(t – 7) + 7 ≡ 0 ⇒ 9t – 56 ≡ 0 ⇒ 9t ≡ 56 ⇒ t ≡ 56·9⁻¹ (mod 9)\nFind inverse: 9⁻¹ mod 9 = 1 ⇒ t ≡ 56·1 = 56 ⇒ t ≡ 56 mod 9 ⇒ t ≡ 2\nThus b + 7 ≡ 2 ⇒ b ≡ –5 ≡ 4 mod 9\nSo all solutions are b = 4 + 9k, k ≥ 1 (since b > 9).", "1. <note1>\n  <description>Convert a numeral in base b to a standard integer by summing each digit multiplied by b raised to its position index. This lets you express divisibility or arithmetic in base b in terms of familiar integer relations.</description>\n  <example>Convert a base-b number with digits d₁d₀ to an integer: d₁·b¹ + d₀·b⁰. For instance, a two-digit base-b number d₁d₀ becomes d₁·b + d₀.</example>\n</note1>\n2. <note2>\n  <description>Use divisibility in base b by checking if the base-b digits satisfy a divisibility rule in the integer form. For example, for base-b number d₁d₀ divisible by d₁, require d₁·b + d₀ ≡ 0 mod d₁, which simplifies to b + (d₀/d₁) ≡ 0 mod d₁.</description>\n  <example>Given a base-b number d₁d₀, compute d₁·b + d₀. If d₁|d₁·b + d₀, then d₁d₀ is divisible by d₁. For instance, if d₁=2 and d₀=4, check 2b + 4 ≡ 0 mod 2, so b must be even.</example>\n</note3>\n3. <note3>\n  <description>Translate divisibility constraints into modular equations and solve for the base b. This often yields a congruence b ≡ k mod m, which can be solved by finding the smallest integer b satisfying the condition and then listing all bases in the desired range.</description>\n  <example>From b ≡ r mod m, set b = m·t + r. If r is negative, adjust to non-negative form. For example, b ≡ 3 mod 5 gives b = 5t + 3, so possible bases are 3, 8, 13, …</example>\n</note4>\n4. <description>Check that each candidate base satisfies all digit constraints: each digit must be in {0,…,b−1}, and leading digits must be nonzero. Omit any base that makes a digit invalid.</description>\n  <example>Suppose a base-b number has digit d₁=d₂. If d₂=3, then b must be ≥4, and the leading digit d₁ must not be zero. Thus any b≥4 with d₁≠0 is valid.</example>\n</note5>\n5. <description>When the problem asks for the sum of all valid bases, list them from the congruence and digit checks, then compute their sum. This final step aggregates the solutions found.</description>\n  <example>After determining valid bases are 13, 18, and 23, sum them to get 13 + 18 + 23 = 54.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 1, "abstractions": ["<note1>\n  <description>Reflecting a point across another point on a line: if P and Q lie on a line and R is the reflection of P across Q, then Q is the midpoint of P and R. Hence PR = 2·PQ. This converts reflection distances into simple segment lengths.</description>\n  <example>On line ℓ, let P and Q satisfy PQ = d. Reflect P about Q to get R. Then PR = 2d, and Q is exactly the midpoint of P and R.</example>\n</note1>\n<note2>\n  <description>Triangle area ratios via base and height: for two triangles sharing the same altitude (height), their areas are in the ratio of their bases. Conversely, for two triangles sharing the same base, their areas are in the ratio of their heights.</description>\n  <example>In triangle ABC, let D lie on BC such that BD:DC = m:n. Triangles ABD and ADC share the same altitude from A, so area(ABD)/area(ADC) = BD/DC = m/n.</example>\n</note2>\n<note3>\n  <description>Area decomposition into adjacent triangles: any polygon can be split into triangles by drawing diagonals from a single vertex. Summing the areas of these triangles yields the total area.</description>\n  <example>Given quadrilateral WXYZ, draw diagonal WY. Then area(WXYZ) = area(WXY) + area(WYZ), where each smaller triangle can be computed separately.</example>\n</note3>\n<note4>\n  <description>Mass point geometry for cevian ratios: assign masses to vertices so that the weighted sum balances at each division point. This yields segment ratios on cevians and helps find areas of subtriangles.</description>\n  <example>In triangle ABC, let D on BC satisfy BD:DC = p:q. Assign mass q at B and p at C so that D balances. Then the mass at A is independent, and the ratio of areas of triangles ABD and ADC equals p:q.</example>\n</note4>\n<note5>\n  <description>Area additivity and subtraction: when a region is partitioned into non-overlapping pieces, the total area is the sum of the pieces. To find an area of a complex shape, subtract the areas of excluded regions from a known area.</description>\n  <example>Given a convex quadrilateral DEGF, if points H and K split it into smaller regions whose areas are known, then area(DEGF) = area(DEH) + area(EHK) + area(HKG) + area(GKF), and one can rearrange to find unknown regions.</example>\n</note5>", "<note1>\n  <description>Reflecting a point across a midpoint of a segment creates a parallelogram: if M is the midpoint of segment XY, then reflecting P across M sends P to P′ so that XPYX′ is a parallelogram, and its area equals twice that of triangle XPY.</description>\n  <example>Let M be the midpoint of XY and P a point. Reflect P across M to P′. Then quadrilateral XPYX′ has area 2·area(ΔXPY). If ΔXPY has area T, then XPYX′ has area 2T. This lets you convert triangle areas to parallelogram areas via reflections.</example>\n</note2>\n  <description>When two triangles share the same altitude, their areas are proportional to their corresponding bases. If triangles have bases b₁ and b₂ on the same line and equal height h, then area₁ : area₂ = b₁ : b₂.</description>\n  <example>On line ℓ, take points A, B, C with AB = b₁ and BC = b₂. Draw a point P above ℓ so that PA ⟂ ℓ and PC ⟂ ℓ. Then ΔPAB : ΔPBC = AB : BC = b₁ : b₂. Thus if ΔPAB has area A₁, ΔPBC has area A₁·(b₂/b₁).</example>\n</note3>\n  <description>Areas of polygons with collinear vertices can be decomposed into sums or differences of triangle areas. By choosing a common base or altitude, express each region as a triangle area and combine them to find the total.</description>\n  <example>Given quadrilateral WXYZ on a line, pick a point P not on that line. Then area(WXYZ) = area(ΔWPX) + area(ΔXPY) + area(ΔPYZ) + area(ΔZW). If WPX, XPY, PYZ share the same altitude from P, their areas sum directly to the quadrilateral’s area.</example>\n</note4>\n  <description>Mass point geometry assigns weights to vertices to balance segment ratios, making area ratios or lengths on cevians or transversals straightforward. Assign weights inversely proportional to adjacent segment lengths and use them to compute areas of subtriangles.</description>\n  <example>On line AB, let D divide AB so that AD:DB = m:n. Assign mass m at B and n at A so that D balances. If a point E on AC is also given, assign masses at A, C so that E balances. Then area(ΔADE) : area(ΔBDE) = AE : EC, and similarly for other subtriangles.</example>\n</note5>\n  <description>Parallelogram and triangle area identities: a parallelogram’s area equals twice the area of any triangle with the same base and altitude, and a triangle’s area equals half the area of the parallelogram with the same base and altitude.</description>\n  <example>Given parallelogram PQRS, draw diagonal PR. Then area(PQRS) = 2·area(ΔPQR). Conversely, if ΔABC has area T, then parallelogram with base AC and height from B equals 2T. Use these to switch between triangle and parallelogram areas in area problems.</example>", "<note1>\n  <description>Reflecting a point across another point yields a segment whose midpoint is the reflection center, and the two segments are equal in length. Use this to relate distances in composite figures.</description>\n  <example>Given points P and Q on a line, reflecting P across Q gives R such that Q is midpoint of PR, and PR = 2·PQ. This relation helps compute new segment lengths when one point is reflected.</example>\n</note1>\n<note2>\n  <description>In a triangle, if a segment parallel to one side splits the other sides in the same ratio, the smaller triangle is similar to the original and its area is the square of that ratio times the original area. Use this to relate areas of subtriangles.</description>\n  <example>In triangle ABC, draw DE ∥ BC with D on AB and E on AC so that AD/DB = k. Then triangle ADE is similar to ABC with area ratio k², so area(ADE) = k²·area(ABC).</example>\n</note2>\n<note3>\n  <description>When a quadrilateral is composed of non-overlapping triangles (or other shapes), its area equals the sum of the areas of those triangles. Decompose complex figures into simpler pieces to compute total area.</description>\n  <example>Quadrilateral WXYZ can be split into triangles WXY and WYZ. If area(WXY) = A₁ and area(WYZ) = A₂, then area(WXYZ) = A₁ + A₂.</example>\n</note3>\n<note4>\n  <description>If two triangles share the same altitude, their areas are proportional to the lengths of their bases; similarly, if they share the same base, areas are proportional to their altitudes. Use this to compare or compute unknown areas.</description>\n  <example>Triangles PQR and PSR share altitude from P to line QR. Then area(PQR)/area(PSR) = QR/RS, allowing one to find an unknown base or area ratio.</example>\n</note4>\n<note5>\n  <description>Decompose a complex polygon into a known polygon and subtract or add the areas of removed or added triangles. This method is useful for heptagons or other polygons with cutouts or extensions.</description>\n  <example>A heptagon can be formed by attaching triangle T to a pentagon P. Then area(heptagon) = area(P) + area(T). Conversely, if T is removed, area(heptagon) = area(P) − area(T).</example>\n</note5>", "<note1>\n  <description>Reflecting a point over a midpoint yields a parallelogram: the line segment joining the original point and its reflection is bisected by the midpoint, and the quadrilateral formed by the two points and the midpoint is a parallelogram with equal and parallel opposite sides.</description>\n  <example>Given a segment XY and midpoint M, reflect X to X′. Then MX = MX′ and XY ∥ X′Y, so quadrilateral X′MXY is a parallelogram.</example>\n</note1>\n<note2>\n  <description>Area of a triangle with base b and height h is (1/2)·b·h. This is fundamental for decomposing complex regions into triangles.</description>\n  <example>For a triangle with base length 10 and altitude 6, its area is (1/2)·10·6 = 30.</example>\n</note3>\n<note3>\n  <description>Area addition: the total area of a composite figure equals the sum of the areas of its non-overlapping parts. Use this to break a complex shape into simpler pieces whose areas are known or easily computed.</description>\n  <example>A polygon can be split into two triangles by drawing a diagonal; if one triangle has area 12 and the other has area 18, the polygon’s area is 30.</example>\n</note4>\n<note4>\n  <description>Mass points: assign weights (masses) to vertices so that segment ratios become balance conditions. This technique converts ratio data into linear equations that determine unknown segment lengths or areas.</description>\n  <example>On segment AB with point D dividing it in ratio 2:3, assign mass 3 at A and 2 at B. Then D balances the two masses, and any line through D parallel to AB gives proportional segments.</example>\n</note5>\n<note5>\n  <description>Similar triangles: if two triangles are similar with ratio of corresponding sides r, then their areas are in ratio r². Use this to relate areas of triangles sharing the same height or base.</description>\n  <example>Triangles ABC and DEF are similar with AB/DE = 4/5. If the area of ABC is 20, then the area of DEF is 20·(5/4)² = 20·25/16 = 31.25.</example>\n</note6>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 2, "abstractions": ["<note1>\n  <description>\nUse stars-and-bars with lower bounds (or inclusion–exclusion) to count integer solutions to x₁ + x₂ + … + xₖ = N with xᵢ ≥ Lᵢ. For fixed lower bounds, the count is the coefficient of t^N in (t^L₁ + t^{L₁+1} + …)^k. Alternatively, subtract counts where one or more variables fall below their bound via inclusion–exclusion.\n</description>\n  <example>\nTo count nonnegative solutions of x + y + z = 5 with x ≥ 1 and y ≥ 2, set x′ = x–1, y′ = y–2. Then x′+y′+z = 2 and the number of solutions is C(2+3–1,3–1)=C(4,2)=6.\n</example>\n</note1>\n<note2>\n  <description>\nWhen variables are ordered (e.g. x₁ &gt; x₂ &gt; … &gt; xₖ), enforce strict inequalities by substituting xᵢ = yᵢ + (k–i). This converts the problem into counting nonnegative solutions of y₁ + y₂ + … + yₖ = N – C(k(k+1)/2), which can be done via stars-and-bars.\n</description>\n  <example>\nCount (a,b,c) with a&gt;b&gt;c≥0 and a+b+c=7. Set a′=a–2, b′=b–1, c′=c. Then a′+b′+c′=2, giving C(2+3–1,2)=C(4,2)=6 ordered triples.\n</example>\n</note2>\n<note3>\n  <description>\nUse generating functions: for nonnegative variables, each variable has factor (1 + t + t² + …). For positive variables, use (t + t² + …). For ordered variables, replace t→t^{k–i}. The coefficient of t^N in the product gives the total number of solutions.\n</description>\n  <example>\nCount (x,y,z) with x&gt;y≥0 and x+y+z=4. The generating function is t·(t^2 + t^3 + t^4)·(1 + t + t^2 + t^3), whose coefficient of t^4 is 2, matching the solutions (3,1,0) and (2,1,1).\n</example>\n</note3>\n<note4>\n  <description>\nWhen variables must sum to N with each at least 1 and with a strict ordering, the number of solutions equals the number of ways to choose k distinct values from {1,…,N–C(k(k+1)/2)} and then permute them. Equivalently, it is the number of partitions of N into k distinct parts.\n</description>\n  <example>\nFor (x,y,z) with x&gt;y&gt;z≥1 and x+y+z=9, the distinct partitions of 9 into 3 parts are {7,1,1}, {6,2,1}, {5,3,1}, {5,2,2} (but 2,2 is invalid), {4,3,2}. Only the first four have distinct parts, so there are 4 solutions.\n</example>\n</note4>\n<note5>\n  <description>\nWhen counting assignments with multiple constraints (such as positivity, ordering, and sums), partition the problem by the smallest or largest value. For each case, count solutions under the remaining constraints and sum the results.\n</description>\n  <example>\nCount (a,b,c) with a&gt;b&gt;c≥1 and a+b+c=7. Case 1: c=1 → a+b=6 with a&gt;b&gt;1; solutions: a=5,b=1 (invalid), a=4,b=2 → valid. Case 2: c=2 → a+b=5 with a&gt;b&gt;2; solutions: a=4,b=1 (invalid), a=3,b=2 (invalid). Case 3: c=3 → a+b=4 with a&gt;b&gt;3; none. Total = 1.\n</example>\n</note5>", "<note1>\n  <description>Partition the total into three positive parts with a strict ordering by placing two dividers among the n–1 gaps. This counts all integer solutions to x₁ + x₂ + x₃ = n with x₁ &gt; x₂ &gt; x₃ &gt; 0. The number of ways is C(n–1, 2).</description>\n  <example>For n = 7, place two dividers among six gaps, giving C(6,2)=15 integer triples (x₁,x₂,x₃) summing to 7 with x₁ &gt; x₂ &gt; x₃.</example>\n</note1>\n<note2>\n  <description>Apply the stars-and-bars theorem for nonnegative solutions to x₁ + x₂ + x₃ = n: the count is C(n+2,2). Use this to count all distributions before enforcing any ordering.</description>\n  <example>For n = 7, the number of nonnegative solutions is C(9,2)=36, including those with x₁ ≤ x₂ or x₂ ≤ x₃.</example>\n</note3>\n<note3>\n  <description>Count solutions with x₁ &gt; x₂ &gt; x₃ by summing over the minimal value of x₃: for each k=1…⌊n/3⌋, there are C(n–2k,1) ways to distribute the remaining n–3k among x₁,x₂. The total is ∑_{k=1}^{⌊n/3⌋} (n–2k).</description>\n  <example>With n = 7, k runs 1…2. For k=1 there are 7–2=5 ways; for k=2 there are 7–4=3 ways; total 8 = C(6,2).</example>\n</note4>\n<note4>\n  <description>Use generating functions: the series for x₁ &gt; x₂ &gt; x₃ &gt; 0 is ∑_{n≥3} [x^n/(1−x)^3]·[x^{n-3}/(1−x)^2]·x^2. Extracting the coefficient of x^n gives C(n–1,2).</description>\n  <example>For n=7, the coefficient of x^7 in x^5/(1−x)^3 · x^2/(1−x)^2 is C(6,2)=15.</example>\n</note5>\n<note5>\n  <description>When the final count is large, compute it modulo m by using modular arithmetic properties on binomial coefficients: C(n,k) mod m can be computed via Lucas’ theorem or by reducing intermediate factors mod m.</description>\n  <example>If C(100,2)=4950, then 4950 mod 1000 = 950, so one reports 950 in any final remainder question.</example>\n</note6>", "<note1>\n  <description>Use stars-and-bars to count the number of ways to distribute N identical items into k distinct boxes, allowing zero in each. The formula is C(N + k – 1, k – 1). This counts all nonnegative solutions to x₁ + x₂ + … + x_k = N.</description>\n  <example>To distribute 7 identical tokens into 3 boxes, compute C(7 + 3 – 1, 3 – 1) = C(9, 2) = 36 ways.</example>\n</note1>\n<note2>\n  <description>Apply inclusion–exclusion to enforce lower bounds on nonnegative variables. Count all distributions ignoring bounds, subtract those where at least one box has fewer than the bound, add back overlaps, etc.</description>\n  <example>To count nonnegative solutions to x₁ + x₂ + x₃ = 5 with x₁ ≥ 1, start with C(5+3–1,2)=C(7,2)=21, then subtract solutions with x₁=0 (i.e. x₂+x₃=5, count C(5+2–1,1)=C(6,1)=6), giving 21–6=15 valid.</example>\n</note2>\n<note3>\n  <description>Use generating functions: for k boxes each receiving ≥0 items, the generating function is (1 + x + x² + …)ᵏ = (1/(1–x))ᵏ. The coefficient of x^N in its expansion equals the number of distributions.</description>\n  <example>For N=4 and k=3, expand (1–x)⁻³: [x⁴] = C(4+3–1, 3–1) = C(6,2)=15.</example>\n</note3>\n<note4>\n  <description>When variables must satisfy strict inequalities, first “shift” them to remove the inequality. Set x₁′=x₁–(some bound), x₂′=x₂–(bound), etc., so the inequalities become ≥0, then apply stars-and-bars or inclusion–exclusion.</description>\n  <example>To count solutions x₁&gt;x₂&gt;x₃≥0 with x₁+x₂+x₃=10, let y₁=x₁–x₂, y₂=x₂–x₃≥0, and z=x₃≥0. Then y₁+y₂+z=10 with y₁≥y₂≥z≥0 and y₁&gt;0. Substitute y₁=y₁′+1 to enforce y₁′≥1, then solve y₁′+y₂+z=9 with y₁′≥1, y₂≥0, z≥0 by inclusion–exclusion.</example>\n</note4>\n<note5>\n  <description>After counting distributions, apply any additional constraints (e.g., parity, divisibility) by summing over cases or using modular arithmetic. If a final answer is required mod m, reduce intermediate counts mod m at each step to keep numbers small.</description>\n  <example>If you find 123 valid distributions and need the result mod 1000, compute 123 mod 1000 = 123 directly, or reduce intermediate sums mod 1000 before adding.</example>\n</note5>", "<note1>\n  <description>Convert “at least one of each” into a fixed count by setting a base allocation for each category. This reduces the problem to distributing the remaining items freely, simplifying the counting process.</description>\n  <example>Suppose there are N total items and you must allocate at least one to each of k categories. First assign one item to each, leaving N–k items. The rest can be distributed freely among the k categories.</example>\n</note2>\n<note3>\n  <description>Use stars-and-bars to count nonnegative integer solutions to x₁+…+xₖ = M. The number of ways is C(M+k–1, k–1), which applies when you distribute M identical items into k distinct bins with no further restrictions.</description>\n  <example>To distribute M identical candies to k children with no limits, the count is C(M+k–1, k–1). For instance, if M=5 and k=3, the number of distributions is C(5+3–1, 3–1)=C(7,2)=21.</example>\n</note3>\n<note4>\n  <description>Enforce a strict ordering x₁&gt;x₂&gt;…&gt;xₖ by introducing nonnegative differences dᵢ = xᵢ – xᵢ₊₁. Then x₁ = D + d₁ + d₂ + … + dₖ, with each dᵢ ≥ 0, and the remaining items M–D are shared among the dᵢ.</description>\n  <example>For k=3 and D=1, x₁&gt;x₂&gt;x₃ requires (x₁–x₂)≥1 and (x₂–x₃)≥1. Set d₁=x₁–x₂–1, d₂=x₂–x₃–1, then x₁=D+d₁+d₂. Distribute the remaining M–D items among d₁ and d₂ using stars-and-bars.</example>\n</note5>\n<note6>\n  <description>Compute the total number of assignments by summing over all possible base allocations D that satisfy 1 ≤ D ≤ M–k+1. For each D, count the distributions of M–D items among k categories via the stars-and-bars formula and sum the results.</description>\n  <example>Let M=8 and k=3. Sum over D from 1 to 5: for each D, count C((M–D)+k–1, k–1) = C(8–D+2,2). Then add these counts for D=1…5 to get the total number of valid assignments.</example>\n</note6>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 3, "abstractions": ["1. <note>\n   <description>Factor the quadratic form by grouping to reveal linear factors when the determinant is a perfect square. For a general form ax² + bxy + cy², compute Δ = b² − 4ac; if Δ is a perfect square, write it as (m·x − n·y)(p·x + q·y).</description>\n   <example>Given 2x² + 5xy + 2y², Δ = 5² − 4·2·2 = 9 = 3². Factor as (2x + y)(x + 2y) = 0, yielding the two linear equations.</example>\n   </note>\n2. <note>\n   <description>Set each linear factor equal to zero to obtain two linear Diophantine equations of the form u·x + v·y = 0. Solve each by expressing one variable in terms of the other, e.g. x = (−v/u)·y.</description>\n   <example>From (3x − y) = 0, get x = (1/3)y. From (x + 2y) = 0, get x = −2y. These substitutions reduce the problem to one variable.</example>\n</note>\n3. <note>\n   <description>Count integer solutions on each line by choosing one variable freely within the domain and deriving the other. If x = k·y, then y must be an integer divisor of the bound when substituted back into the domain constraints.</description>\n   <example>For x = (1/3)y in [−D, D], y must be a multiple of 3. Count y = −3m, 0, 3m with −D ≤ 3m ≤ D, giving ⌊D/3⌋ + 1 choices.</example>\n</note>\n4. <note>\n   <description>Exclude overlapping solutions at the origin if both factors simultaneously vanish. Verify where both linear expressions are zero and subtract that count from the total.</description>\n   <example>If both lines x = 0 and y = 0 satisfy the original equation, then the origin is counted twice. Subtract one extra instance before final enumeration.</example>\n</note>\n5. <note>\n   <description>Use symmetry or parity arguments to avoid redundant enumeration. If one variable can be chosen from an even or odd set of values, exploit the sign change symmetry of the equation to halve the work.</description>\n   <example>When x = k·y and k is an integer, if y is even, then x is even; if y is odd, then x is odd. Count each parity case separately and combine.</example>\n</note>", "1. <note1>\n  <description>When an equation in two variables is homogeneous (all terms are of the same total degree), you can divide by one variable to reduce it to a single-variable equation. This is valid whenever the variable you divide by is nonzero in the domain.</description>\n  <example>Given 3u² – 2uv + v² = 0 and v ≠ 0, divide both sides by v² to get 3(u/v)² – 2(u/v) + 1 = 0, a quadratic in t = u/v.</example>\n</note1>\n2. <note2>\n  <description>Use the discriminant of a quadratic to determine its roots. For at² + bt + c = 0, the discriminant D = b² – 4ac. If D is a perfect square, rational roots exist; otherwise, they are irrational or complex.</description>\n  <example>In t² – 5t + 6 = 0, D = 25 – 24 = 1 (a perfect square), so t = (5 ± 1)/2 gives t = 3 or t = 2.</example>\n</note3>\n3. <note3>\n  <description>Factor or complete the square to rewrite a quadratic expression as a perfect square, i.e. (t – p)² = q. This reveals when t equals p ± √q and simplifies solving.</description>\n  <example>For t² – 4t + 4, write it as (t – 2)². Hence (t – 2)² = 0 implies t = 2.</example>\n</note4>\n4. <note4>\n  <description>After finding a rational ratio u/v = r, substitute back to get u = r·v. Then count all integer pairs (u,v) by checking the divisibility of v by the denominator of r, or by enumerating v in the allowed range.</description>\n  <example>If r = 3/2, then u = (3/2)v. For v integer in [–5,5], valid v must be even, giving four choices for v, each yielding u = (3/2)v.</example>\n</note5>\n5. <note5>\n  <description>Exploit symmetry: if the original equation is symmetric in x and y, solutions often come in symmetric pairs (x,y) and (y,x). Count one case and multiply by the number of distinct symmetric pair types, then adjust for overcounting if identical.</description>\n  <example>If (1,2) is a solution, then (2,1) is also a solution. If both are distinct, count them separately; if they coincide, count only once.</example>", "1. <note1>\n  <description>Complete the quadratic in one variable by grouping terms to form a perfect square trinomial. This isolates one variable in a simple binomial squared form, ready for further factorization.</description>\n  <example>For an equation like ax² + bxy + cy² = 0, group as a(x² + (b/a)xy) + cy² = 0, then add and subtract (b/(2a))² inside the bracket to form a perfect square.</example>\n</note1>\n2. <note2>\n  <description>Factor the resulting expression into two linear factors by matching coefficients. Once in the form (Ax + By)(Cx + Dy) = 0, identify A, B, C, D by comparing terms.</description>\n  <example>From (px + qy)² = 0, rewrite as (px + qy)(px + qy) = 0, then read off the linear factors directly.</example>\n</note3>\n3. <note3>\n  <description>Use the zero-product property to obtain two linear Diophantine equations. Each factor set to zero yields a linear relation between the variables.</description>\n  <example>From (p x + q y)(r x + s y) = 0, derive p x + q y = 0 and r x + s y = 0 separately, then solve each for integer solutions.</example>\n</note4>\n4. <note4>\n  <description>Apply the linear Diophantine solution formula: for A x + B y = 0, write x = B t, y = –A t for integer t. This parameterization covers all integer solutions.</description>\n  <example>Given 2x + 3y = 0, set x = 3t, y = –2t, so every integer t gives one solution pair (3t, –2t).</example>\n</note5>\n5. <note5>\n  <description>Count parameter values within given bounds by solving inequalities and using the floor/ceiling function. For x = B t in [L, U], find L/B ≤ t ≤ U/B and count integer t.</description>\n  <example>If x = 5t and x must be between -10 and 10, solve –10 ≤ 5t ≤ 10 ⇒ –2 ≤ t ≤ 2, so t = –2, –1, 0, 1, 2 gives 5 solutions.</example>", "Factor the quadratic form into linear factors over the integers.\n  Solve each resulting linear equation for integer solutions using divisibility or parameterization.\n  Count the number of integer solutions per factor and multiply or add as appropriate."], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 4, "abstractions": ["Divisibility by 22 = Divisible by 2 AND Divisible by 11. ²\nDivisible by 2: The last digit must be one of the even digits (2,4,6,8). ²\nDivisible by 11: The alternating sum of digits must be a multiple of 11. ²\nCounting: Use permutations of the remaining 7 digits, multiply by the number of valid last digits, then divide by 2 to correct for overcounting if order matters. ²\nGeneral Check: Always verify both divisibility rules independently before combining counts. ²", "Divisibility by 22: A number is divisible by 22 exactly when it is divisible by both 2 and 11.\n<Integer Divisibility by 2>:\n• A positive integer is even (divisible by 2) if and only if its last digit is even.\n<Integer Divisibility by 11>:\n• Compute the alternating sum of its digits: subtract the sum of digits in odd positions from the sum in even positions. The result must be a multiple of 11 (including zero).\n<Pairing Digits for 11>:\n• When only certain digits are allowed, group them into pairs whose sum is constant modulo 11 to simplify the alternating-sum check.\n<Counting Valid Permutations>:\n• Fix the last digit as one of the even options, then count permutations of the remaining digits under the 11-divisibility condition.\n<Final Adjustment>:\n• Subtract the known constant 2025 from the computed count to obtain the required difference.", "Divisibility by 22 = 2·11. For a number to be divisible by 22, it must be even and its alternating sum must be a multiple of 11.\nIn any permutation of the digits 1…8, exactly half are even, so exactly half are divisible by 2.\nTo check divisibility by 11, compute (sum of positions with odd index) − (sum of positions with even index). This difference must be congruent to 0 mod 11.\nWhen selecting which positions are occupied by the even digits, the parity of the alternating sum depends only on the number of even digits in odd positions minus the number in even positions.\nThe total count of permutations is 8!. Dividing by 2 gives 40320 permutations divisible by 2. Among those, a quarter satisfy the 11-divisibility check, yielding 10080. The difference from 2025 is 8055.", "2025, 40320, 22, 11, 2."], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 5, "abstractions": ["<note1>\n  <description>In any quadrilateral that admits an inscribed circle (tangential quadrilateral), the sums of the lengths of opposite sides are equal: a + c = b + d. This holds because the tangents from each vertex to the circle are equal in length.</description>\n  <example>Suppose a quadrilateral has side lengths a = 5, b = 7, c = 6, d = 8. By tangentiality, 5 + 6 = 7 + 8, which indeed gives 11 = 15, so it fails, indicating no inscribed circle. For a valid case, choose a = 4, b = 6, c = 5, d = 5: 4 + 5 = 6 + 5 = 9, confirming tangentiality.</example>\n</note1>\n  <note2>\n  <description>The area of any tangential quadrilateral equals the product of its inradius r and its semiperimeter s: Area = r·s. This follows from decomposing the quadrilateral into four right triangles formed by the inradius.</description>\n  <example>Consider a tangential quadrilateral with inradius r = 3 and semiperimeter s = 10. Its area is 3 × 10 = 30. Conversely, if you know the area is 30 and r = 3, you immediately get s = 30/3 = 10.</example>\n</note2>\n  <note3>\n  <description>In an isosceles trapezoid, the legs are equal, and dropping perpendiculars from the endpoints of one base to the other yields right triangles. The height h of the trapezoid can be found via the Pythagorean theorem: h² = leg² – (difference of bases)/2².</description>\n  <example>Let the parallel sides be r = 8 and s = 4, and the leg length be 5. The horizontal projection of each leg is (8 – 4)/2 = 2, so the height is h = √(5² – 2²) = √21.</example>\n</note3>\n  <note4>\n  <description>For any trapezoid (isosceles or not), the area can be expressed as (sum of bases)/2 × height: Area = (r + s)/2 × h. Combining this with the tangential quadrilateral area formula lets you relate r, s, and h without computing the leg length explicitly.</description>\n  <example>Given r = 8, s = 4, and h = 6, the area is (8 + 4)/2 × 6 = 6 × 6 = 36. Equating this to r·s when r = 3 and s = 5 gives 36 = 3 × 5 × h, so h = 36/15 = 2.4.</example>\n</note4>\n  <note5>\n  <description>When asked for a symmetric expression like r² + s², express r + s and r – s in terms of known quantities (e.g., area and inradius) and then use the identity r² + s² = (r + s)² – 2(r – s)². This avoids solving for r and s individually.</description>\n  <example>Suppose r + s = 12 and r – s = 4. Then r² + s² = 12² – 2×4² = 144 – 32 = 112. You never need to find r or s explicitly.</example>\n</note5>", "<note1>\n  <description>For a tangential quadrilateral (one with an inscribed circle), the sum of the lengths of opposite sides are equal: a + c = b + d. This follows because each side is split into two tangent segments of equal length. </description>\n  <example>Given a quadrilateral with side lengths a, b, c, d, if it has an inscribed circle, then a + c = b + d. For instance, if a = 5 and c = 7, then b + d must also equal 12.</example>\n</note1>\n<note2>\n  <description>In any tangential trapezoid, the legs are equal. This is a direct consequence of equal tangent segments from each vertex to the circle’s points of tangency. </description>\n  <example>Consider a trapezoid with bases b₁ and b₂ and legs ℓ. If it has an inscribed circle, then both legs satisfy ℓ = ℓ, so the trapezoid is isosceles.</example>\n</note3>\n<note3>\n  <description>The area A of a tangential trapezoid can be expressed as A = r·s, where r is the inradius and s is the semiperimeter. This formula arises from summing the areas of four right triangles formed by radii to the tangency points. </description>\n  <example>For a trapezoid with inradius r = 4 and semiperimeter s = 15, the area is A = 4 · 15 = 60.</example>\n</note4>\n<note4>\n  <description>The height h of a tangential trapezoid is given by h = 2r, since the inradius touches each side at a right angle. This relationship follows from the fact that the inradius is the perpendicular distance from the center to any side. </description>\n  <example>If a trapezoid has an inradius r = 3, then its height is h = 2·3 = 6.</example>\n</note5>\n<note5>\n  <description>Using the Pythagorean theorem in the right triangle formed by dropping a height from a top base to the bottom base, one can relate the leg ℓ, the horizontal offset (half the difference of bases) δ, and the height h: ℓ² = h² + δ². This helps express ℓ in terms of h and the base difference. </description>\n  <example>With h = 6 and δ = 2, the leg length is ℓ = √(6² + 2²) = √(36 + 4) = √40.</example>", "<note1>\n  <description>For a quadrilateral to have an incircle, its sum of opposite sides must equal: a + c = b + d. This is both a necessary and sufficient condition for tangential quadrilaterals.</description>\n  <example>In a quadrilateral with side lengths p, q, r, s, if p + r equals q + s, then an incircle exists and is tangent to all four sides.</example>\n</note1>\n<note2>\n  <description>The area A of a tangential quadrilateral equals its inradius r times its semiperimeter s: A = r·s. This follows because the quadrilateral can be decomposed into four triangles with heights equal to r.</description>\n  <example>For a quadrilateral with inradius r and semiperimeter s, the area is A = r·s. For instance, if r = 2 and s = 10, then A = 20.</example>\n</note2>\n<note3>\n  <description>In an isosceles trapezoid, the height h can be expressed in terms of the inradius r as h = 2r. This comes from dropping perpendiculars from the non-parallel sides to the longer base and using the tangency property on the legs.</description>\n  <example>Given an isosceles trapezoid with inradius r, dropping perpendiculars from the legs to the longer base yields two right triangles whose heights sum to 2r, hence the trapezoid’s height is 2r.</example>\n</note3>\n<note4>\n  <description>The area of a trapezoid with parallel sides a and b and height h is A = (a + b)·h/2. This formula applies to any trapezoid, regardless of whether it is tangential.</description>\n  <example>For a trapezoid with bases a and b and height h, the area is A = (a + b)·h/2. For example, if a + b = 12 and h = 5, then A = 30.</example>\n</note4>\n<note5>\n  <description>Combine the tangential quadrilateral area formula and the trapezoid area formula to derive (a + b) = 2A/r. Substituting h = 2r into the trapezoid area gives (a + b) = 2A/r.</description>\n  <example>Given A = 40 and r = 4, one finds (a + b) = 2·40/4 = 20. This lets you solve for the sum of the parallel sides directly from the given area and inradius.</example>\n</note5>", "<note1>\n  <description>In any quadrilateral with an inscribed circle, the sums of lengths of opposite sides are equal: a + c = b + d. This property holds regardless of the shape.</description>\n  <example>For a convex quadrilateral with side lengths a, b, c, d in that order, if there is an inscribed circle, then a + c must equal b + d. If a = 5 and b = 7, then c + d must also be 12.</example>\n</note1>\n<note2>\n  <description>For an isosceles trapezoid, the legs and the two parallel sides satisfy leg² = (sum of bases)²/4 – (difference of bases)²/4. This follows from dropping perpendiculars to form right triangles.</description>\n  <example>Let the parallel sides be p and q, and the legs be ℓ. Then ℓ² = [(p+q)²/4] – [(p–q)²/4]. For p = 6 and q = 2, ℓ² = [8²/4] – [4²/4] = 16 – 4 = 12, so ℓ = √12.</example>\n</note3>\n<note3>\n  <description>The area of a trapezoid with parallel sides of lengths a and b and height h is Area = (a + b)/2 · h. This is the standard formula for any trapezoid.</description>\n  <example>If a trapezoid has parallel sides of lengths 5 and 7 and height 4, its area is (5 + 7)/2 · 4 = 6 · 4 = 24.</example>\n</note4>\n<note4>\n  <description>In any trapezoid with an inscribed circle of radius r, the height equals twice the radius (h = 2r). This comes from the fact that the circle is tangent to both bases and the legs.</description>\n  <example>For a trapezoid with an inscribed circle of radius 3, the perpendicular distance between the parallel sides is h = 2·3 = 6.</example>\n</note5>\n<note5>\n  <description>The sum of the squares of two numbers x and y can be expressed in terms of their sum S = x + y and difference D = x – y by x² + y² = (S² + D²)/2. This avoids solving for x and y individually.</description>\n  <example>If two numbers sum to 10 and differ by 4, then x² + y² = (10² + 4²)/2 = (100 + 16)/2 = 58.</example>\n</note6>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 6, "abstractions": ["<note1>\n  <description>When n items are paired randomly, there are (2n)!/2^n·n! distinct pairings. This counts all ways to group n items into n unordered pairs without regard to order within pairs.</description>\n  <example>For 4 items A,B,C,D, the total number of unordered pairings is (8)!/(2^2·4!) = 105. Each grouping consists of two pairs, for example {AB,CD} or {AC,BD}.</example>\n</note1>\n<note2>\n  <description>To count pairings where a specific element X sits in a particular pair, fix X with one other element Y. Then the remaining 2(n−1) items form (2n−2)!/2^(n−1)·(n−1)! pairings. Dividing by the total gives P(X in a given pair)=1/n.</description>\n  <example>With 5 items and target X, fix X with one of the 4 others. The remaining 4 items yield (8)!/(2^2·2!) = 105 pairings. Total pairings for 5 items is (10)!/(2^5·5!) = 945, so P(X in a given pair)=105/945=1/9, matching 1/5 if recounting correctly.</example>\n</note2>\n<note3>\n  <description>If you need the probability that in a random pairing a certain pair contains a designated element X and a designated element Y, fix both X and Y together. The remaining 2(n−1) items then form (2n−2)!/2^(n−1)·(n−1)! pairings. The desired probability is [1/((2n−2)!!)]·[(2n−2)!/2^(n−1)·(n−1)!]/[(2n)!/2^n·n!] = 1/(n·(2n−1)).</description>\n  <example>For 6 items and two specific items X and Y, fixing X with Y leaves 8 items forming (8)!/(2^4·4!) = 105 pairings. Total pairings for 6 items is (12)!/(2^6·6!) = 945, so the probability that X and Y end up together is 105/945 = 1/9, matching 1/(6·11) if recalculated.</example>\n</note4>\n<note5>\n  <description>When arranging pairings in a sequence and asking about the last pair’s composition, condition on the total number of pairings. The probability that a particular element lies in the last pair equals the probability that it is in any one of the n pairs, i.e., 1/n.</description>\n  <example>With 7 items forming 3 pairs, each item is equally likely to be in any one of the 3 pairs. Thus the chance that a given item is in the last pair is 1/3.</example>\n</note6>\n<note7>\n  <description>Check for symmetry: in a random pairing of n elements, each element is equally likely to be in any one of the n pairs. This symmetry often simplifies probability calculations.</description>\n  <example>With 8 items, each item has a 1/4 chance of being in a specific pair. You can verify this by listing all possible pairings or by noting that rotating labels does not change probabilities.</example>\n</note7>", "<note1>\n  <description>When pairing n distinct items, the total number of ways to form unordered pairs is (n–1)!! (double factorial), or equivalently n!/(2^((n/2))(n/2)!). This counts each pairing exactly once without regard to order.</description>\n  <example>For 6 items labeled {1,2,3,4,5,6}, the number of ways to pair them is (6–1)!! = 5!! = 15, which matches 6!/(2^3·3!) = 720/(8·6) = 15.</example>\n</note1>\n<note2>\n  <description>To count pairings where a specific item X must be paired with one of a subset S of k items, first choose X’s partner from S (k ways), then count the pairings of the remaining n–2 items: (n–2–1)!! = (n–3)!!. The total is k·(n–3)!!.</description>\n  <example>With 4 items {A,B,C,D} and subset S={B,C}, the number of pairings where A is with B or C is 2·(4–3)!! = 2·1 = 2, corresponding to AB|CD and AC|BD.</example>\n</note2>\n<note3>\n  <description>When ordering pairs lexicographically, a pair (p,q) appears before (p′,q′) if p < p′ or (p = p′ and q &lt; q′). Thus, to find how many pairings place a specific pair last, first count those where the pair is among the first n–2 pairs, then adjust for the remaining pairings.</description>\n  <example>For 4 items {A,B,C,D}, to count pairings where (C,D) is last, first choose which of the first 2 pairs is (C,D) (2 ways), then pair the remaining 2 items in 1 way, giving 2·1 = 2.</example>\n</note3>\n<note4>\n  <description>Use complementary counting to find the probability that a desired pair appears in the last position: compute the total pairings and the number where the desired pair is not last, then subtract. This often simplifies counting when “not last” cases are easier to count.</description>\n  <example>For 4 items {A,B,C,D}, total pairings = 3!! = 3. Number where (C,D) is not last = 3–1 = 2 (since it is last in exactly 1 pairing). Thus P = 1/3.</example>\n</note4>\n<note5>\n  <description>After finding a probability as a fraction m/n, reduce by dividing numerator and denominator by their greatest common divisor (GCD). This yields the simplest form m′/n′ with m′ and n′ coprime.</description>\n  <example>If you find a probability of 4/6, compute GCD(4,6)=2 and divide both by 2 to get 2/3, the reduced form.</example>\n</note5>", "<note1>\n  <description>When pairing n objects at random, the probability that a specific pair appears is 2/n. This follows from selecting one object from the n and then selecting its partner from the remaining n−1, giving 2·(1/n)·(1/(n−1))=2/n.</description>\n  <example>For n=5, the chance that a given pair appears is 2/5. If you randomly form 2.5 pairs, the probability that a particular pair emerges is 2/5.</example>\n</note1>\n<note2>\n  <description>When ordering all possible pairings of n objects, the number of total orderings is (n−1)!! × n!. The double factorial (n−1)!! counts the ways to form the pairs, and n! arranges the resulting pairs.</description>\n  <example>With n=4, there are 3!!×4!=1×24=24 ways to arrange all possible pairings when listing them in a single sequence.</example>\n</note3>\n<note3>\n  <description>To count favorable outcomes where a specific object is in a particular pair, fix that object’s partner and then count pairings of the remaining n−2 objects. The count is (n−3)!! × (n−2)! for the remaining pairs.</description>\n  <example>For n=6, fixing one object’s partner leaves 4 objects. The number of ways to pair them is 3!!×4!=2×24=48 favorable pairings.</example>\n</note4>\n<note4>\n  <description>When dealing with a random permutation of pairings, the probability that a specific event occurs in the last position is the ratio of favorable count to total count, i.e. (favorable)!/(total!) for the remaining items.</description>\n  <example>With n=6 and desired event in the last slot, the probability is 48/240=1/5, since favorable pairings count is 48 and total is 240.</example>\n</note5>\n<note5>\n  <description>Always simplify the obtained fraction by dividing numerator and denominator by their greatest common divisor to express the probability in lowest terms.</description>\n  <example>If you compute a probability as 12/36, divide both by 12 to get 1/3 in simplest form.</example>\n</note6>", "<note1>\n  <description>When forming unordered pairs from a set of size N by random matching, the total number of ways is (N–1)!! = 1·3·5·…·(N–1). Use this to compute the sample size for probability calculations.</description>\n  <example>For N=8 letters, total pairings = 7!! = 1·3·5·7 = 105. Thus, any probability question about random pairings uses denominator 105.</example>\n</note2>\n  <description>When one element must be paired with exactly one specific partner (e.g., a fixed pair), treat that fixed pair as a single “block,” reducing the effective set size to N–2. The number of ways to match the remaining N–2 items is (N–2–1)!!.</description>\n  <example>With N=10 and a required pair (X,Y), consider {X,Y} as one block plus the other 8 items. The remaining 8 items yield 7!! = 105 ways to form the other pairs.</example>\n</note3>\n  <description>To count favorable outcomes where a particular pair appears in a specific position (e.g., last pair), fix that pair in the chosen slot and then count pairings of the remaining elements. The probability is (#favorable)/(#total).</description>\n  <example>For N=12, to find P(last pair contains a given element), fix that element’s partner in the final slot (1 way), then pair the remaining 10 items in 9!! ways. Probability = 9!! / 11!!.</example>\n</note4>\n  <description>When two events are independent in the matching process (e.g., a fixed pair vs. a fixed element in the last slot), multiply their counts. This helps in computing probabilities of joint conditions.</description>\n  <example>Let A be “given pair is formed,” with count (N–2)!!, and B be “given element in last slot,” with count (N–1)!!, then P(A and B) = [(N–2)!!]·[(N–1)!!] / [12!!]² when both are independent in a 12-item setup.</example>\n</note5>\n  <description>After computing a probability in the form of a fraction, simplify by dividing numerator and denominator by their greatest common divisor to ensure the result is in lowest terms.</description>\n  <example>If you obtain 105/1320, compute gcd(105,1320)=15, then divide both by 15 to get 7/88.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 7, "abstractions": ["1. <note>\n  <description>Complex modulus |z–a|=R represents the set of points at distance R from a. For multiple moduli, intersections are found by solving geometric distance equations.</description>\n  <example>Given |z–u|=r₁ and |z–v|=r₂, the solution set is the intersection of two circles centered at u and v with radii r₁ and r₂.</example>\n</note>\n2. <note>\n  <description>Equal moduli |z–a|=|z–b| define the perpendicular bisector of segment [a,b]. Points equidistant from two fixed points lie on this line.</description>\n  <example>For |z–A|=|z–B|, the locus is the line through midpoint of A and B perpendicular to AB.</example>\n</note>\n3. <note>\n  <translation>Parametrize a circle by z=a+R·e^{iθ}. Substituting this into another equation reduces two-variable intersection to solving for θ and R.</translation>\n  <example>On |z–c|=R, set z=c+R·e^{iθ}. Plugging into |z–d|=S yields an equation in θ and R, which can be solved to find intersection points.</example>\n</note>\n4. <note>\n  <description>A single intersection of a circle and a line occurs when the line is tangent to the circle. Use the distance from the circle’s center to the line equaling the radius.</description>\n  <example>For circle |z–P|=R and line L, the solution is unique iff distance(P,L)=R. Otherwise, two intersections occur.</example>\n</note>\n5. <note>\n  <description>Condition for tangency: distance from center a to line Ax+By+C=0 must equal radius R. Equivalently, |A·Re(a)+B·Im(a)+C|/√(A²+B²)=R.</description>\n  <example>To ensure |z–a|=R meets line ℓ tangently, compute d=|A·x₀+B·y₀+C|/√(A²+B²) and set d=R.</example>", "1. <note>\n  <description>Geometrically, |z – A| = r describes a circle centered at A with radius r. To solve |z – A| = |z – B|, note this is the perpendicular bisector of segment AB in the complex plane. Intersecting a circle with a line yields at most two solutions.</description>\n  <example>For |z – (1 + 2i)| = 3 and |z – (3 + i)| = |z – (2 + 4i)|, the second is the line through (3 + i) and (2 + 4i), and the intersection of that line with the circle |z – (1 + 2i)| = 3 gives the solution(s).</example>\n</note>\n2. <note>\n  <description>Intersections of a circle and a line occur when the distance from the circle’s center to the line equals the circle’s radius. Compute the distance d = |C – P₀|/√(1 + m²) if line: y = mx + b (in complex form), where P₀ is any known point on the line, then set d = r for tangency (one solution).</description>\n  <example>Circle: |z – (2 – 3i)| = 5. Line: Re(z) = 4. Distance from center (2 – 3i) to line x = 4 is |4 – 2| = 2. Tangency requires 2 = 5, so no intersection. For d = r, adjust line or circle parameters to make d = r.</example>\n</note>\n3. <note>\n  <description>When the line parameter k appears linearly (e.g. |z – A| = |z – B – k·C|), substitute the line equation into the circle equation to get a quadratic in k. The condition “exactly one solution” means the discriminant of that quadratic equals zero, giving a single k-value.</description>\n  <example>Circle |z – (1 + i)| = 2, line z = (3 + i) + k·(1 + 2i). Substitute to get a quadratic Ak² + Bk + C = 0. Set B² – 4AC = 0 to solve for k, yielding the unique k for tangency.</example>\n</note>\n4. <note>\n  <description>Use the perpendicular bisector of two points P and Q: its equation is Re((P – Q)·conj(z)) = Re((P + Q)/2). This avoids messy slopes and intercepts and directly gives the locus |z – P| = |z – Q|.</description>\n  <example>For P = 2 + 3i and Q = 1 – i, the bisector is Re((2+3i – (1–i))·conj(z)) = Re((2+3i + 1–i)/2) ⇒ Re((1+4i)·conj(z)) = Re(1.5 + i) = 1.5. This line is the perpendicular bisector.</example>\n</note>\n5. <note>\n  <description>When multiple k-values satisfy the tangency condition, sum them using Vieta’s formula: for Ak² + Bk + C = 0, the sum of roots is –B/A. This quickly yields the total of all possible k without solving each separately.</description>\n  <example>From Ak² + Bk + C = 0 with B = 6, A = 2, the sum of k-values is –6/2 = –3. Thus any two k-values summing to –3 ensure exactly one intersection.</example>", "5\n<note1>\n  <description>Interpret each complex equation |z–a|=r as a circle in the plane with center a and radius r. A system of two such circles can be solved by finding their intersection points, which may be zero, one, or two points.</description>\n  <example>For |z–1|=2 and |z–3|=2, the two circles with centers 1 and 3 each of radius 2 intersect at exactly one point when their centers coincide, giving z=2.</example>\n</note1>\n<note2>\n  <description>Two circles intersect at exactly one point only when they are tangent—either internally or externally. This happens when the distance between their centers equals the sum or the absolute difference of their radii.</description>\n  <example>Given circles |z–a|=r1 and |z–b|=r2, check |a–b|=|r1±r2|; if true, the circles touch at a single common point.</example>\n</note1>\n<note3>\n  <description>When a parameter appears in the second circle’s radius, solve |a–b|=|r1±r(r2)| for that parameter. This yields the values of the parameter that make the circles tangent.</description>\n  <example>For |z–a|=r1 and |z–b|=r2(k), set |a–b|=|r1±r2(k)| and solve the resulting equation in k to find all possible tangent cases.</example>\n</note1>\n<note4>\n  <description>After finding candidate parameter values, verify each yields exactly one solution by checking that neither circle is degenerate (radius zero) and that the parameter indeed makes the circles tangent.</description>\n  <example>If solving gives k=k1, k2, substitute back to confirm |a–b|=|r1±r2(k)| holds and both radii are positive.</example>\n</note1>\n<note5>\n  <description>Sum the valid parameter values and simplify to the form m/n in lowest terms. Then compute m+n as required.</description>\n  <example>Suppose the valid k values are k1 and k2; compute k1+k2, reduce to m/n, and report m+n.</example>\n</note1>", "1. <note>\n  <description>Interpret |A – z| = r as a circle of radius r centered at A in the complex plane. This converts distance constraints into geometric circles.</description>\n  <example>For |2 – z| = 5, all z lie on the circle centered at 2 with radius 5. Similarly, |z – (3 + i)| = 4 describes the circle centered at 3 + i with radius 4.</example>\n</note>\n2. <note>\n  <description>Two circles intersect if the distance between their centers d satisfies |r₁ – r₂| ≤ d ≤ r₁ + r₂. If d = r₁ + r₂ or d = |r₁ – r₂|, they meet tangentially (one solution).</description>\n  <example>Circles centered at A and B with radii r₁ and r₂ intersect in one point exactly when the distance AB equals r₁ + r₂ (external tangency) or |r₁ – r₂| (internal tangency).</example>\n</note>\n3. <note>\n  <description>The locus |z – P| = |z – Q| is the perpendicular bisector of segment PQ. It consists of all points equidistant from P and Q.</description>\n  <example>For P = 1 + 2i and Q = 4 – i, the set {z: |z – P| = |z – Q|} is the line perpendicular to PQ and passing through its midpoint.</example>\n</note>\n4. <note>\n  <description>To find intersections of a circle and a line, substitute the line’s equation into the circle’s equation to obtain a quadratic in one coordinate. A single intersection occurs when the discriminant of this quadratic is zero.</description>\n  <example>Circle: (x – h)² + (y – k)² = r²; Line: y = mx + b. Substitution yields a quadratic in x; setting its discriminant to zero gives the condition for tangency.</example>\n</note>\n5. <note>\n  <description>When a locus condition yields a quadratic in a parameter (e.g., k), require the discriminant to be zero for a unique solution. Solve the resulting equation to find all valid parameter values.</description>\n  <example>If the condition leads to ak² + bk + c = 0, then exactly one solution occurs when b² – 4ac = 0. Solving b² – 4ac = 0 gives the parameter values that produce a single solution.</example>\n</note>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 8, "abstractions": ["1. <note>\n  <description>Use rotation formulas to map any point (X,Y) to (X′,Y′) under an angle θ: X′=X cosθ−Y sinθ, Y′=X sinθ+Y cosθ. This transforms curves by rotating their axes by θ.</description>\n  <example>Rotate point (2,1) by 45°: X′=2·cos45°−1·sin45°=(2−1)/√2=1/√2, Y′=2·sin45°+1·cos45°=(2+1)/√2=3/√2.</example>\n</note>\n2. <note>\n  <description>Substitute the rotated coordinates into the original curve’s equation to derive a relation between the original variables. This yields a new equation valid in the rotated frame.</description>\n  <example>Original parabola y=x²−4. After rotation by θ, replace x with Xcosθ−Ysinθ and y with Xsinθ+Ycosθ, then simplify to get an equation in X and Y.</example>\n</note>\n3. <note>\n  <description>Intersect two curves by equating their expressions for a common variable (e.g. Y in terms of X) or by forming a system of equations. Solve for the intersection points algebraically.</description>\n  <example>Given y=2x−1 and y=x², set 2x−1=x² ⇒ x²−2x+1=0 ⇒ (x−1)²=0 ⇒ x=1, then y=1.</example>\n</note>\n4. <note>\n  <description>Apply the quadratic formula x=[−B±√(B²−4AC)]/(2A) to solve for x when you obtain a quadratic Ax²+Bx+C=0. Check the discriminant to ensure real solutions.</description>\n  <example>Solve 3x²−5x+2=0: x=[5±√(25−24)]/(6)=[5±1]/6, so x=1 or 2/3.</example>\n</note>\n5. <note>\n  <description>Enforce quadrant or sign constraints to select the unique valid solution. After solving, discard roots that place the point outside the desired region (e.g. fourth quadrant).</description>\n  <example>For x²−4x+3=0, roots x=1 or x=3. If the problem requires x&gt;0 and y=2x−3 to be negative, pick x=1 (y=−1) over x=3 (y=3).</example>", "1. <note>\n  <description>Rotation in the plane by an angle θ maps any point (u,v) to (u cos θ – v sin θ, u sin θ + v cos θ). Use this to express a rotated curve in terms of the original coordinates.</description>\n  <example>Given a circle x² + y² = R², rotating it by 30° yields new equations (x cos 30° – y sin 30°)² + (x sin 30° + y cos 30°)² = R², which expands to a rotated circle equation.</example>\n</note>\n2. <note>\n  <description>To find intersections of two curves, substitute one curve’s equation into the other, yielding a single-variable polynomial. This reduces the problem to solving that polynomial.</description>\n  <example>For y = x² + 1 and y = 2x – 1, set x² + 1 = 2x – 1, giving x² – 2x + 2 = 0. Solve for x to find the intersection points.</example>\n</note>\n3. <note>\n  <description>When solving a quadratic Ax² + Bx + C = 0, use the quadratic formula x = [–B ± √(B² – 4AC)]/(2A). Check the discriminant to ensure real solutions and determine the number of intersection points.</description>\n  <example>From 2x² – 3x + 1 = 0, compute discriminant Δ = (–3)² – 4·2·1 = 1. Then x = [3 ± √1]/4, yielding two distinct real roots.</example>\n</note>\n4. <note>\n  <description>After finding candidate x-values, substitute back to find y, then apply any region or quadrant constraints (e.g., y &gt; 0, x &lt; 0) to select the valid solution.</description>\n  <example>From x = 1 ± √2 for a parabola intersection, compute y = x² – 4. If only the fourth quadrant solution is needed, choose the sign of x and y that places the point there.</example>\n</note>\n5. <note>\n  <description>For expressions of the form (A – √B)/C, ensure A and C are coprime and B is squarefree. This standard form is often required in contest answers.</description>\n  <example>Given x = (5 – √7)/3, note that 5 and 3 share no common factors, and 7 is not divisible by a perfect square, so the expression is already in simplest form.</example>\n</note>", "1. <note>\n  <description>Rotation by angle φ in the plane transforms a point (x,y) to (x′,y′) via x′=x cosφ − y sinφ and y′=x sinφ + y cosφ. Use these formulas to map any curve under rotation.</description>\n  <example>To rotate a point (x,y) by 30°, compute x′=x·√3/2 − y·1/2 and y′=x·1/2 + y·√3/2. This gives the new coordinates after a 30° counterclockwise rotation.</example>\n</note>\n2. <note>\n  <description>Parametrize a rotated conic by substituting the rotation formulas into its original equation, then solve for one variable in terms of the other. This reduces the problem to solving a single-variable equation.</description>\n  <example>Given y = x² on the original axis, substitute x′=x cosφ − y sinφ and y′=x sinφ + y cosφ to get an equation in x′ and y′. Solve for x′ in terms of y′ or vice versa, then substitute back to find the intersection.</example>\n</note>\n3. <note>\n  <description>Use Vieta’s formulas on the resulting quadratic in one variable to relate the sum and product of its roots. This helps determine symmetric combinations of the intersection points.</description>\n  <example>After substituting and clearing denominators, you obtain a quadratic A·t² + B·t + C = 0. Then the sum of its roots t₁ + t₂ = −B/A and the product t₁·t₂ = C/A, which can be used to check or find specific roots.</example>\n</note>\n4. <note>\n  <description>When solving quadratics, check the discriminant Δ to ensure real solutions and look for symmetries in the coefficients. If Δ = 0, the quadratic has a repeated root; if Δ is a perfect square, roots are rational.</description>\n  <example>For t² + p·t + q = 0, compute Δ = p² − 4q. If Δ = 0, t = −p/2 is a double root. If Δ = k², the roots are (−p ± k)/2, which can simplify further analysis.</example>\n</note>\n5. <note>\n  <description>Validate that the computed intersection point lies in the desired region by checking its signs and using the original curve’s monotonicity. This ensures the solution meets geometric constraints.</description>\n  <example>After finding a candidate (x′,y′), verify x′ &gt; 0 and y′ &lt; 0 for the fourth quadrant. Also, note that y = x² is increasing for x ≥ 0, so the intersection must occur at a positive x.</example>", "1. <note1>\n  <description>Rotation of a point (x,y) by angle θ around the origin is given by the transformation:  \nx' = x cos θ – y sin θ,  \ny' = x sin θ + y cos θ.  \nUse this to find any rotated coordinate from its original.</description>\n  <example>Rotate the point (2,1) by 45°.  \nCompute x' = 2·(√2/2) – 1·(√2/2) = (√2)/2,  \ny' = 2·(√2/2) + 1·(√2/2) = (3√2)/2.</example>\n</note1>\n2. <note2>\n  <description>To find the intersection of two curves, substitute one equation into the other to reduce to a single-variable polynomial.  \nSolve that polynomial for the variable of interest.</description>\n  <example>Intersect the line y = 2x + 1 with the curve y = x² – 4 by setting 2x + 1 = x² – 4.  \nThis yields x² – 2x – 5 = 0, whose solutions are x = 1 ± √6.</example>\n</note2>\n3. <note3>\n  <description>When solving a quadratic a x² + b x + c = 0, use the quadratic formula x = [–b ± √(b² – 4ac)]/(2a).  \nFor radical expressions, simplify under the square root and factor out perfect squares.</description>\n  <example>Solve x² – 4x + 1 = 0:  \nx = [4 ± √(16 – 4)]/2 = [4 ± √12]/2 = 2 ± √3.</example>\n</note4>\n4. <note4>\n  <description>To identify the correct root when multiple solutions exist, apply any given constraints (e.g., quadrant, sign, inequality).  \nThis ensures you select the unique solution matching all conditions.</description>\n  <example>For x² – 9 = 0, roots are ±3.  \nIf x must lie in the fourth quadrant (x&gt;0, y=0), choose x = 3.</example>\n</note5>\n5. <note5>\n  <description>When a solution appears in the form (a ± √b)/c, verify that a and c are coprime and that the expression is in simplest radical form.  \nThis ensures the final answer is properly reduced and standardized.</description>\n  <example>Given x = (5 ± √18)/4, simplify √18 = 3√2, so x = (5 ± 3√2)/4.  \nSince 5 and 4 are coprime, the expression is fully simplified.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 9, "abstractions": ["<note1>\n  <description>Count permutations of n distinct items in a row by n!, since each position can be filled by any remaining item. This gives the total ways to fill a row with all distinct elements.</description>\n  <example>For a row of length 4 with distinct symbols A,B,C,D, there are 4!=24 ways to arrange them.</example>\n</note1>\n<note2>\n  <description>When filling a block with r rows and c columns, multiply the number of ways to fill each row given the previous ones: total = (c!)^r. Each row independently has c! permutations.</description>\n  <example>In a 2×3 block with distinct symbols, the first row has 3! ways, the second row then has 2! ways given the first, so total = (3!)^2 = 36.</example>\n</note3>\n<note3>\n  <description>Use the “product rule” for independent choices: if you have k disjoint sets of choices, the total number of combined choices is the product of their sizes. This applies when filling non-overlapping regions.</description>\n  <example>Filling two separate 3×3 blocks with distinct symbols yields 9! ways for each block, so together there are (9!)^2 total arrangements.</example>\n</note4>\n<note4>\n  <description>Exploit symmetry by grouping identical configurations under relabelings or rotations/reflections. Divide the total count by the size of the symmetry group to account for overcounting.</description>\n  <example>For a 3×3 Latin square, there are 12 rotational/reflection symmetries, so one divides the raw count by 12 to get the distinct squares.</example>\n</note5>\n<note5>\n  <description>When the final count factors as p^a·q^b·r^c·s^d, compute the weighted sum p·a + q·b + r·c + s·d. This often appears in contest problems asking for a specific combination of primes and exponents.</description>\n  <example>Given 2^3·3^2·5^4·7^1, the weighted sum is 2·3 + 3·2 + 5·4 + 7·1 = 6 + 6 + 20 + 7 = 39.</example>\n</note6>", "<note1>\n  <description>Count permutations of n distinct items using factorial: n! = n·(n–1)·…·1. This applies when all n positions must be filled by n unique values.</description>\n  <example>For a row of length 4 with distinct symbols, the count is 4! = 24.</example>\n</note1>\n<note2>\n  <description>When certain positions must be fixed, remove them from the pool and count permutations of the remaining slots: (n – k)! if k positions are predetermined.</description>\n  <example>In a 5-slot row where one slot is already filled, there are 4! = 24 ways to fill the remaining 4 slots.</example>\n</note3>\n<note3>\n  <description>Use the product rule: if a filling process can be split into independent stages with counts m₁, m₂, …, mₖ, the total count is m₁·m₂·…·mₖ.</description>\n  <example>Filling a 3-row block where each row has 3! arrangements gives 3!·3!·3! = 6·6·6 = 216.</example>\n</note4>\n<note4>\n  <description>When a grid is partitioned into non-overlapping rectangular blocks that cover all cells, the total number of fillings is the product of the ways to fill each block, assuming no interaction across blocks.</description>\n  <example>A 2×2 grid divided into two 2×1 rows yields 2!·2! = 2·2 = 4 fillings.</example>\n</note5>", "<note1>\n  <description>Use the Fundamental Counting Principle: for a sequence of independent choices, multiply the number of options at each step. This applies when filling rows, columns, or blocks independently once partial placements fix constraints.</description>\n  <example>To fill a 3×3 grid row by row with distinct symbols in each row, first choose any permutation for row 1 (3! ways), then for each subsequent row choose any permutation not already used in that column (3! ways each), giving 3!·(3!)^2 total fillings.</example>\n</note1>\n<note2>\n  <description>Exploit the Latin Square Property: in an n×n grid where each row and each column must contain distinct symbols, the first n−1 rows fix the positions of n−1 symbols in each column. This reduces the problem to counting completions of the last row that avoids conflicts in columns.</description>\n  <example>In a 4×4 Latin square, once the first three rows are filled, there are exactly 2 ways to fill the fourth row so that no symbol repeats in any column.</example>\n</note2>\n<note3>\n  <description>Apply Block Decomposition: partition the grid into disjoint blocks (e.g., 3×3 subgrids in Sudoku) and count fillings by iterating over one block at a time, updating constraints for the next. This reduces a global problem to a series of local permutations.</description>\n  <example>For a 3×3×3 grid, fix the first layer arbitrarily (3! ways), then count fillings of the second layer avoiding conflicts with the first (2! ways each cell), and finally the third layer (1! ways each cell), giving 3!·(2!)^9 total.</example>\n</note4>\n<note5>\n  <description>Use Burnside’s Lemma for Symmetries: count distinct fillings under a group of operations (rotations, reflections) by averaging the number of fillings fixed by each symmetry. This accounts for equivalent configurations under symmetry.</description>\n  <example>To count distinct 2-colorings of a 3×3 grid up to rotations, compute for each of the 4 rotations the number of colorings unchanged by that rotation, sum them, and divide by 4.</example>\n</note5>\n<note6>\n  <description>Factor and Simplify the Final Count: express the total number of fillings as a product of prime powers, then group like factors to match the desired exponent form. This clarifies which primes and exponents appear.</description>\n  <example>If your count is 2^6·3^4·5^2, group it as 2^2·3^1·5^1·(2^2·3^2·5^1) to match a pattern like p^a·q^b·r^c·s^d, then identify p,q,r,s and their exponents.</example>\n</note6>", "<note1>\n  <description>Use the multiplication (product) rule to count independent assignments: if a row can be filled in X ways and each subsequent independent row in Y ways, the total for all rows is X^Y. This applies whenever choices in one row do not affect the count of choices in another.  \n</description>\n  <example>Suppose each row of a 4×4 grid can be filled in 12 ways independently. Since there are 4 rows, the total number of fillings is 12^4.</example>\n</note1>\n<note2>\n  <description>Partition the grid into disjoint regions (blocks, rows, columns) that impose constraints internally but not across regions. Count fillings for one region at a time, multiplying the counts, and then combine.  \n</description>\n  <example>Divide a 6×6 grid into 9 non-overlapping 2×2 blocks. If each block can be filled in 50 ways independently, total fillings = 50^9.</example>\n</note3>\n<note3>\n  <description>Apply the inclusion-exclusion principle to enforce global constraints: count all assignments without constraints, subtract those violating at least one constraint, add back those violating two, etc. This handles pairwise conflicts systematically.  \n</description>\n  <example>To count 3-letter strings over {A,B,C} without “AA”, start with 3^3=27, subtract strings with “AA” in positions 1–2 or 2–3, then add back those with “AA” in both positions to correct over-subtraction.</example>\n</note4>\n<note4>\n  <description>Use Burnside’s Lemma (orbit-counting) to count distinct arrangements under symmetry: total fixed arrangements under each symmetry operation divided by the number of operations.  \n</description>\n  <example>For tilings of a 2×3 rectangle under rotation by 180°, list tilings fixed by 0° and 180°, sum them, then divide by 2 to get the number of distinct tilings.</example>\n</note5>\n<note5>\n  <description>When the final count factors into a product of primes raised to powers, compute the weighted sum of each prime times its exponent to generate a unique numeric result.  \n</description>\n  <example>Given a count = 2^4·3^2·5^1, compute 2·4 + 3·2 + 5·1 = 8 + 6 + 5 = 19.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 10, "abstractions": ["<note1>\n  <description>When a function is periodic with period P, any solution x satisfies x = x₀ + kP for integer k. This reduces the search to one period and then extends by adding multiples of P.</description>\n  <example>For f(x) periodic with period P, to find intersections of f(x)=g(x), solve f(x₀)=g(x₀) in one period and then list x = x₀ + kP for all integer k.</example>\n</note1>\n<note2>\n  <description>For a piecewise linear function defined on intervals [aᵢ,aᵢ+L), each linear segment y=mᵢx+bᵢ can intersect a parabola x=34y² by solving mᵢy+bᵢ = 34y², yielding a quadratic in y. Each valid root corresponds to one intersection on that segment.</description>\n  <example>On segment [a₁,a₁+L) with y=m₁x+b₁, set m₁y+b₁=34y² ⇒ 34y²–m₁y–b₁=0. Solve this quadratic for y, then check each root lies in [a₁,a₁+L).</example>\n</note3>\n<note3>\n  <description>To locate intersections within a given interval [A,B], use the quadratic’s discriminant Δ=b²–4ac. A positive Δ indicates real roots, and the sum of roots is –b/a and the product is c/a. This helps determine if roots lie inside [A,B].</description>\n  <example>For 34y²–m₁y–b₁=0, compute Δ=(m₁)²+4·34·b₁. If Δ&gt;0, then the two roots sum to m₁/34 and multiply to –b₁/34. Use these relations to check which roots fall in the target interval.</example>\n</note4>\n<note4>\n  <description>When summing roots from multiple quadratics, use Vieta’s formulas: for each quadratic y² + Py + Q=0, the sum of its roots is –P. If there are n such quadratics, the total sum is –(P₁+P₂+…+Pₙ). This avoids computing each root individually.</description>\n  <example>Suppose three quadratics yield coefficients P₁, P₂, P₃. Then the sum of all intersection y-coordinates is –(P₁+P₂+P₃), directly giving the total without solving each quadratic.</example>\n</note5>\n<note5>\n  <description>After obtaining roots in the form (–b±√Δ)/(2a), simplify by factoring out common factors from numerator and denominator, and rationalize denominators. Ensure the resulting fraction is in lowest terms and the radicand is square-free.</description>\n  <example>Given y = (–b ± √Δ)/(2a), factor gcd of numerator and denominator, then multiply numerator and denominator by the conjugate to remove radicals, and finally reduce to simplest form.</example>", "<note>\n  <description>When a periodic function f has period T, any intersection of f with a curve F(x,y)=0 satisfies F(x+T,y)=0, so solutions repeat every T in the x-direction. This allows you to reduce the search to one fundamental interval [x₀, x₀+T).</description>\n  <example>Suppose f(x+4)=f(x) and you want to solve y=f(x) together with some curve F(x,y)=0. Instead of checking all real x, you only check x in [x₀, x₀+4), and then the full set of solutions is obtained by adding multiples of 4 to each x₀-solution.</example>\n</note>\n  <description>For a sawtooth-like piecewise linear f on intervals [a, b), [b, c), …, substitute each piece’s formula into the equation F(x,y)=0. This transforms the problem into analyzing finitely many subproblems on each subinterval.</description>\n  <example>Let f(x)=x on [0,1) and f(x)=2−x on [1,2). To solve x=f(y), substitute x=y on [0,1) and x=2−y on [1,2). You then solve y=y and 2−y=y separately, obtaining y=0 in the first case and y=1 in the second.</example>\n</note>\n  <description>When solving a quadratic in y, use the quadratic formula y=[–B±√(B²–4AC)]/(2A). To express the sum of the roots without radicals, compute S=–B/A and P=C/A, then check if S and P are rational. If they are, the sum of the roots is S.</description>\n  <example>Given 3y²–5y+2=0, A=3, B=–5, C=2. The sum of the roots is S=–B/A=5/3. Even though the individual roots involve √1, their sum is rational 5/3, so you can report S directly.</example>\n</note>\n  <description>For a general quadratic y²=dy+e, rewrite as y²–dy–e=0. Then the sum of its roots is d and the product is –e. This lets you extract sums and products of intersections without computing individual roots.</description>\n  <example>To find intersection points of y²=2y+3, write y²–2y–3=0. The sum of the roots is 2, and the product is –3. If you need the sum, you immediately get 2 without solving for each root.</example>\n</note>\n  <description>After obtaining a candidate sum in the form (a+b√c)/d, simplify by dividing numerator and denominator by their greatest common divisor. Ensure c is square-free and that the numerator is in lowest terms.</description>\n  <example>Suppose you have (6+12√5)/8. Divide numerator and denominator by 2 to get (3+6√5)/4. Then check that c=5 is not divisible by any square of a prime and that 3, 6, and 4 have no further common divisor.</example>", "<note1>\n  <description>  \nTo find intersections between a function f and a curve g(x,y)=0, substitute y or x into f and solve the resulting equation. This reduces the problem to solving a single-variable equation.  \n</description>\n  <example>  \nGiven f(x)=x for x∈[0,1) and the parabola x=ky², substitute y into f to get y=ky². Then solve y(ky−1)=0 to find y=0 and y=1/k.  \n</example>\n</note1>\n<note2>\n  <description>  \nPeriodic functions repeat every T. To find all intersections over a large interval [0,N], solve within one period [0,T) and then repeat the solutions by adding integer multiples of T.  \n</description>\n  <example>  \nFor f(x)=x with period 4, solve y=ky² in [0,4). You get y=0 and y=1/k. Then all solutions are y=0 and y=1/k + 4m for integers m.  \n</example>\n</note2>\n<note3>\n  <description>  \nWhen solving a quadratic in y, use the quadratic formula y=[−B±√(B²−4AC)]/(2A). Check the discriminant Δ=B²−4AC&gt;0 for real roots. This handles cases where the parabola intersects the piecewise linear function.  \n</description>\n  <example>  \nFor y=ky²−1=0, A=k, B=0, C=−1, so y=±√(0+4k)/(2k)=±2√k/(2k)=±√(k)/(k).  \n</example>\n</note4>\n<note5>\n  <description>  \nSum of roots of Ay²+By+C=0 is −B/A. Even if only one root is valid in the domain, use this formula to get a quick expression for the sum. This is useful for summing all y-values from multiple periods.  \n</description>\n  <example>  \nFrom y=ky²−1=0, the sum of roots is 0/(k)=0. If you have two roots y₁ and y₂, then y₁+y₂=0.  \n</example>\n</note5>\n<note6>\n  <description>  \nAfter obtaining a radical expression in simplest form, rationalize denominators and simplify fractions so that the numerator and denominator share no common factor and the radicand is square-free. This ensures the final form meets standard requirements.  \n</description>\n  <example>  \nGiven y=(2+√3)/3, multiply numerator and denominator by the conjugate if needed, then simplify. Here it is already simplest, but one might check gcd(2+√3,3)=1 and ensure 3 is square-free.  \n</example>", "<note1>\n  <description>\n    To find intersections between a parabola x = g(y) and a periodic piecewise function f(x), solve f(x) = g(y) for each relevant branch of f. The periodicity of f ensures that solutions repeat with period equal to the period T. This reduces the problem to solving a finite set of equations in one variable.\n  </description>\n  <example>\n    Let f(x)=x on [0,1] and f(x+2)=f(x), and let g(y)=y². Solve y² = x on [0,1] to get y = ±√x. The solutions repeat every period T=2, so one checks x∈[0,1] and x+2∈[0,1], i.e. x∈[0,1] only, yielding y=±√x for x∈[0,1].\n  </example>\n</note1>\n<note2>\n  <description>\n    For each branch of the piecewise function, set f(x) = g(y) and solve for y in terms of x. Use the domain of that branch to restrict the solutions. This step yields a candidate list of y-values, each expressed by a function of x.\n  </description>\n  <example>\n    If f(x)=2−x on [1,3] and g(y)=y², solve y² = 2−x for x in [1,3]. The solutions are y = ±√(2−x), but only those satisfying 1 ≤ x ≤ 3 are valid. Thus y = √(2−x) or −√(2−x) for x∈[1,3].\n  </example>\n</note2>\n<note3>\n  <description>\n    Substitute the expression for y back into the parabola’s equation x = g(y) to express x solely in terms of the branch parameter. This yields a single-variable equation that can be solved over the branch’s domain. Each solution corresponds to a point on the graph.\n  </description>\n  <example>\n    With y = √(2−x) from the previous step, substitute into x = y² to get x = (2−x), i.e. 2x = 2, so x = 1. This corresponds to one intersection point with x∈[1,3].\n  </example>\n</note3>\n<note4>\n  <description>\n    After finding all intersection points, sum the y-coordinates by grouping like solutions (e.g., ±√k). If the sum involves radicals, combine them by rationalizing denominators. The final sum should be in simplest radical form.\n  </description>\n  <example>\n    If the solutions are y = √2 and y = −√2, their sum is 0. If solutions are y = √3 and y = −√3, their sum is also 0. More generally, √a + (−√a) = 0, so any pair of opposites cancels out.\n  </example>\n</note4>\n<note5>\n  <description>\n    When the sum of y-coordinates yields a rational expression with radicals, clear denominators by multiplying numerator and denominator by the conjugate. Then simplify to the form (A + B√C)/D, ensuring A, B, C, D are integers with gcd(A,B,D)=1 and C squarefree.\n  </description>\n  <example>\n    To simplify (√5 − 1)/2, multiply numerator and denominator by (−√5 −1). After simplification, one obtains (−3 − √5)/2, which is in the desired form with gcd(−3,−1,2)=1 and 5 squarefree.\n  </example>\n</note5>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 11, "abstractions": ["1. <note>\n  <description>When bounding one product by another (e.g. P₁·P₂ ≤ Q₁·Q₂), rewrite as a difference of sums and factor into linear factors: (X−Y)(X−Z) ≥ 0. Then each factor’s sign determines the region in the plane.</description>\n  <example>Given X·Y ≤ Y·Z, rewrite as X−Z ≤ X−Y. Factoring gives (X−Y)(X−Z) ≥ 0, so all points lie on one side of the lines X=Y and X=Z.</example>\n</note>\n2. <note>\n  <description>Intersecting a linear plane (e.g. X+Y+Z=C) with a region defined by (X−Y)(X−Z) ≥ 0 yields a convex polygon. This polygon is a triangle or trapezoid whose vertices lie on the intersection of the lines X=Y, X=Z, and the plane.</description>\n  <example>For X+Y+Z=75 and (X−Y)(X−Z) ≥ 0, the intersection is a triangle with vertices at (75,0,0), (0,75,0), and (0,0,75), each lying on one of the symmetry lines.</example>\n</note>\n3. <note>\n  <description>When a region is bounded by linear inequalities in two variables (e.g. X+Y=C, X≥Y, X≥Z), compute its area by integrating one variable over the interval determined by the other. The result often simplifies to a constant times a square root.</description>\n  <example>For X+Y=100 and X≥Y, the area under the line Y=100−X from X=0 to X=50 is ∫₀⁵⁰ (100−X) dX = 50·100−(50)²/2 = 2500.</example>\n</note>\n4. <note>\n  <description>Use symmetry to reduce the number of distinct regions. If the plane and inequalities are symmetric under swapping variables, compute one region and multiply by the number of symmetric copies, adjusting for overlaps or intersections as needed.</description>\n  <example>For X+Y+Z=C with (X−Y)(X−Z) ≥ 0, there are three symmetric regions. Compute the area of one triangle and multiply by three, then subtract the overlapping area along the plane.</example>\n</note>\n5. <note>\n  <description>After obtaining an area in the form a·√b, ensure b is square-free and compute a+b. This final step normalizes the radical and answers questions about the sum of coefficients.</description>\n  <example>If the computed area is 20·√3, then a=20 and b=3, so a+b=23.</example>\n</note>", "1. <note>\n  <description>When three expressions E₁, E₂, E₃ are cyclically ordered (E₁ &gt; E₂ &gt; E₃), each must lie between the two extreme ones. Concretize by writing E₁ &gt; E₂, E₂ &gt; E₃, and E₃ &gt; E₁, then solve each pair of inequalities separately.</description>\n  <example>Suppose x–yz &gt; y–zx &gt; z–xy. First solve x–yz &gt; y–zx, then y–zx &gt; z–xy, and finally z–xy &gt; x–yz. Each gives a half-space, and their intersection yields the allowed region.</example>\n</note>\n2. <note>\n  <description>Project the 3D region onto one of the coordinate planes (e.g. x–y plane) by fixing the third coordinate. This reduces a 3D inequality to a 2D one, making it easier to visualize and compute area.</description>\n  <example>Fix z = c and consider x–yz &gt; y–zx. Substituting z = c gives x–cy &gt; y–cx, which is a linear inequality in x and y. Its graph is a half-plane in the x–y plane.</example>\n</note>\n3. <note>\n  <description>For cyclic inequalities of the form x–yz &gt; y–zx &gt; z–xy, the solutions often form triangle-shaped regions in each face of the plane x+y+z = S. Identify one such triangle by solving two of the three inequalities and then use its area formula.</description>\n  <example>On the plane x+y+z = S, solve x–yz &gt; y–zx and y–zx &gt; z–xy to get a triangle with vertices at points where the equalities hold. Compute its area via (base·height)/2.</example>\n</note>\n4. <note>\n  <description>Compute area of a triangle in the plane using the determinant formula: area = ½|det([v₁, v₂])|, where v₁ and v₂ are vectors from one vertex to the other two. This works for any triangle once you have its vertices.</description>\n  <example>Given triangle vertices A, B, C, set v₁ = B–A and v₂ = C–A. Then area = ½|det([v₁, v₂])| = ½|v₁_x·v₂_y – v₁_y·v₂_x|.</example>\n</note>\n5. <note>\n  <description>When a region is symmetric under cyclic permutations, its total area is often a multiple of a single triangle’s area. Count how many congruent triangles compose the region and multiply by the single triangle’s area.</description>\n  <example>If the plane x+y+z = S splits into three congruent triangles, each of area T, then the finite region’s area is 3·T. If only one triangle is finite, the answer is just T.</example>", "1. <note1><description>Use cyclic inequalities like x−yz &gt; y−zx &gt; z−xy to derive linear relations. By subtracting consecutive terms, you obtain linear inequalities in pairs of variables, which can be rearranged into standard forms such as x−y &gt; constant. This clarifies the region’s shape.</description><example>Given x−yz &gt; y−zx, subtract to get x−y &gt; z(y−x). If y−x is positive, divide by it to get x−y &gt; a constant times (y−x), yielding a linear inequality in x,y.</example></note1>\n2. <note2><description>Intersect the region with planes x+y+z = constant to reduce to 2D. Setting one coordinate to a parameter t transforms the 3D inequality region into a family of 2D regions for each t. This allows 2D area or boundary computations.</description><example>With x+y+z = 75 and x−y &gt; 0, let z = 75−x−y. The inequality x &gt; y becomes x &gt; y in the plane x+y+z = 75, producing a 2D region that is easier to analyze.</example></note1>\n3. <note3><description>Recognize the region as a convex polygon or polyhedron by plotting boundary lines. Solve each linear inequality to get its boundary, then find intersections to obtain vertices. A convex hull of these vertices defines the region’s shape.</description><example>From x−y &gt; 0 and x+y+z = 75, plot x = y and x+y = 75−z. Their intersection gives a vertex. Repeating for other inequalities yields the full convex polygon in the plane.</example></note1>\n4. <note4><description>Compute area using the shoelace formula or decomposition into triangles. Once vertices are known, list them in order, apply the shoelace formula to get the area directly. Alternatively, decompose into triangles and sum their areas.</description><example>For a polygon with vertices (x₁,y₁),…,(xₙ,yₙ), compute ½|Σ(xᵢyᵢ₊₁−xᵢ₊₁yᵢ)|. If it splits into two triangles, compute each area ½|xᵢyⱼ−xⱼyᵢ| and add.</example></note1>\n5. <note5><description>Check for finite region by verifying bounds and convexity. Ensure each inequality defines a bounded region (no unbounded “infinite” parts). Convexity guarantees no holes or non-convex shapes, simplifying area computation.</description><example>After finding intersections, check that each vertex lies within all original inequalities. If all vertices satisfy x−y &gt; 0, x+y+z = 75, and any other constraints, the region is bounded and convex.</example></note1>", "1.  \n  <note1>\n    <description>  \nWhen three expressions A, B, C form a cyclic inequality A &lt; B &lt; C, one can view them as points on a line. The finite region satisfying all three simultaneously is the open interval between the two outer points. This reduces a system of three inequalities to a single interval.  \n</description>\n    <example>  \nSuppose A = x, B = x + 1, and C = x + 2. The inequalities A &lt; B &lt; C hold exactly for x &gt; 0 and x &lt; 2, giving the finite interval (0, 2).  \n</example>\n  </note1>\n2.  \n  <note2>\n    <description>  \nAny linear equation of the form x + y + z = K in three variables defines a plane in three-dimensional space. Solving for z gives z = K – x – y, which parametrizes the plane by the (x, y)-plane.  \n</description>\n    <example>  \nFor K = 10, the plane is z = 10 – x – y. Every point (x, y, z) on this plane satisfies the equation, and all such points form a slanted plane parallel to the (x, y)-plane.  \n</example>\n  </note2>\n3.  \n  <note3>\n    <description>  \nProjecting the finite region defined by the plane and the cyclic inequality onto the (x, y)-plane yields a polygonal region. Compute its vertices by solving the corresponding boundary inequalities in the plane, then use the polygon’s area formula (e.g. shoelace) to find the projection’s area.  \n</description>\n    <example>  \nIf the projection of a finite region onto the (x, y)-plane is a triangle with vertices at (0, 0), (1, 0), and (0, 1), its area is ½·1·1 = ½.  \n</example>\n  </note3>\n4.  \n  <note4>\n    <description>  \nThe area of the original finite region in 3D is the area of its projection multiplied by the absolute value of the plane’s normal vector’s z-component divided by the projection’s area. Since the plane is level (normal (1,1,1)), this factor is √3/3.  \n</description>\n    <example>  \nIf the projection area is ½, then the 3D region’s area is ½ · (√3/3) = √3/6.  \n</example>\n  </note4>\n5.  \n  <note5>\n    <description>  \nWhen the final answer is an expression of the form a√b for integers a, b, ensure b is square-free by factoring out perfect squares. Then a + b is the final numeric form required.  \n</description>\n    <example>  \nGiven the area √12/6, factor √12 = 2√3, giving (2√3)/6 = √3/3. Thus a = 1, b = 3, and a + b = 4.  \n</example>\n  </note5>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 12, "abstractions": ["1.  \n  <note>\n    <description>Use linearity of expectation: the expected number of regions is the sum of the probability that each region is formed by the random lines. Compute P(region occurs) for each potential region and sum over all.</description>\n    <example>For a disk divided by a single chord, there are 2 regions. The probability each region appears equals the chance the chord lies in that region, so E(regions)=P(region A)+P(region B)=1. Summing over all regions gives the expected total.</example>\n  </note>", "1. <note1>\n  <description>Two lines intersect in a plane unless they are parallel or coincident. In a disk with generic random endpoints, any two chords drawn will meet at exactly one interior point. This holds for any number of lines in general position.</description>\n  <example>In a circle, draw two chords that do not share an endpoint. Since they are not parallel and not the same line, they intersect at a single point inside the circle.</example>\n</note1>\n2. <note2>\n  <description>Each crossing point increases the region count by 2: an intersection splits existing regions into two. Thus, if C is the number of crossings and R₀ is the initial region count (e.g., R₀=1 for a disk), then R = R₀ + 2C.</description>\n  <example>Start with one region (R₀=1). If you draw a second chord that intersects the first, you gain 2 new regions, so R = 1 + 2·1 = 3.</example>\n</note2>\n3. <note3>\n  <description>Count crossings by choosing pairs of chords: if there are L chords, the total number of intersection points is C(L,2). This counts all potential intersections, assuming generic positions.</description>\n  <example>For 4 chords, the number of expected crossings is C(4,2)=6, regardless of how the chords are drawn in general position.</example>\n</note3>\n4. <note4>\n  <description>When endpoints are chosen independently and uniformly over the circle, the probability that two randomly chosen chords intersect is 1/3. This gives an expected crossing count of L·(L–1)/3 for L chords.</description>\n  <example>With 5 chords, the expected number of intersections is 5·4/3 = 20/3 ≈6.67.</example>\n</note4>\n5. <note5>\n  <description>For random chords in a circle, the expected total region count is R = 1 + (2/3)·L, where L is the number of chords. This combines the initial region plus twice the expected crossing count.</description>\n  <example>If you draw 6 random chords, then R = 1 + (2/3)·6 = 1 + 4 = 5 regions on average.</example>\n</note1>", "1. <note1>\n  <description>Any two chords intersecting in a circle in general position create one intersection point. In a circle with N chords, if no three chords are concurrent and no chord is tangent, the total number of intersection points is C(N, 2).</description>\n  <example>With 6 chords, there are C(6, 2) = 15 distinct intersection points. Each pair of chords crosses exactly once, provided they are not parallel or coincide.</example>\n</note1>\n2. <note2>\n  <description>Adding a new chord to a circle with existing chords increases the number of regions by (number of existing chords + 1). This holds when the chord intersects all previous chords in distinct points.</description>\n  <example>If a circle has 4 chords and the next chord intersects each of those 4 chords once, it adds 5 new regions: 4 existing intersections + 1 additional region beyond intersections.</example>\n</note1>\n3. <note3>\n  <description>The maximum number of regions R(N) formed by N chords in a circle is given by the recurrence R(N) = R(N–1) + (N–1), with base R(0)=1. Equivalently, R(N) = 1 + N + C(N, 2).</description>\n  <example>Starting from R(0)=1, R(1)=2, R(2)=4, R(3)=7, and so on. For N=5, R(5)=1+5+C(5,2)=1+5+10=16 regions.</example>\n</note1>\n4. <note4>\n  <description>When lines (or chords) are drawn randomly in a circle, the expected number of regions can be computed by linearity of expectation: E[R(N)] = 1 + N + E[C(N, 2)], where E[C(N, 2)] is the expected number of chord intersections.</description>\n  <example>For N=8 random chords, the expected intersections is E[C(8, 2)] = C(8, 2)·p, where p is the probability two chords intersect. Thus E[R(8)] = 1 + 8 + 8·p.</example>\n</note1>\n5. <note5>\n  <description>For uniformly random chords in a circle, the probability that two chords intersect is 1/3. This arises because each pair of chords is equally likely to cross or not cross.</description>\n  <example>With 10 random chords, the expected number of intersections is C(10,2)·(1/3) = 15·(1/3) = 5, so the expected regions are 1 + 10 + 5 = 16.</example>\n</note1>", "1. <note1>\n  <description>For a circle, each new chord through the interior of a partitioned region divides the region into two parts, increasing the region count by exactly one. This holds because any chord inside a region intersects its boundary exactly twice and thus crosses existing segments in a way that splits the region.</description>\n  <example>In a disk divided into 5 regions, drawing one chord through the disk that does not coincide with any existing chord splits exactly one region into two, yielding 6 total regions.</example>\n</note1>\n2. <note2>\n  <description>The total number of regions R(n) created by n nonintersecting chords in a disk satisfies the recurrence R(n)=R(n−1)+n, with R(0)=1. This arises because each new chord adds exactly one new region to the existing configuration.</description>\n  <example>Starting with R(0)=1, the first chord gives R(1)=2, the second gives R(2)=3, and so on, so R(n)=1+Σ_{k=1}^n k = 1 + n(n+1)/2.</example>\n</note1>\n3. <note3>\n  <description>To count regions formed by n intersecting chords, first compute the maximum possible regions when no two chords are parallel and no three chords are concurrent. The formula is R(n)=1 + n + Σ_{k=2}^n (k−1)(k−2)/2.</description>\n  <example>For n=4, the maximum regions are 1 + 4 + Σ_{k=2}^4 (k−1)(k−2)/2 = 1 + 4 + (1+3+6) = 15.</example>\n</note1>\n4. <note4>\n  <description>When chords are drawn at random, the expected number of regions is the average over all possible intersection patterns. Compute this by summing the region counts for each pattern weighted by its probability, or use linearity of expectation if each chord contributes independently.</description>\n  <example>If there are M possible ways to draw n chords with k intersections, and each way yields R_k regions, then E[R]=Σ_k R_k·P(k intersections), where P(k) is the probability of exactly k intersections.</example>\n</note1>\n5. <note5>\n  <description>Use symmetry or partitioning to simplify random-chord problems: divide the disk into sectors or regions, count expected contributions in each symmetric piece, and sum them. This reduces complex random draws into manageable pieces.</description>\n  <example>Divide a disk into 4 equal quadrants. If each quadrant independently contributes an expected number r of regions, then the total expected regions is 4·r, assuming symmetry.</example>\n</note1>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 13, "abstractions": ["<note1>\n  <description>Convex pentagon perimeter minimization: For a convex pentagon with known side lengths, the point that minimizes the sum of distances to its vertices is the intersection of the diagonals connecting every second vertex (the “Fermat-Torricelli” point). At this point, each angle between adjacent segments equals 120°, ensuring minimal total distance.</description>\n  <example>Given a convex pentagon with vertices A, B, C, D, E in order, draw diagonals AC and BE. Their intersection X satisfies ∠AXB=∠BXC=∠CXD=∠DXE=120°, and X minimizes AX+BX+CX+DX+EX.</example>\n</note1>\n<note2>\n  <description>Breaking into triangles via diagonals: To compute or approximate the minimal sum f(X), draw diagonals from a chosen point to split the pentagon into triangles. Then apply the triangle inequality and known distance formulas to express f(X) in terms of simpler segments.</description>\n  <example>From point X in a convex pentagon, draw diagonals to vertices B and D, dividing the pentagon into triangles XAB, XBC, XCD, XDE, and XEA. Sum the lengths of XA, XB, XC, XD, and XE by adding corresponding sides of these triangles.</example>\n</note3>\n<note3>\n  <description>Law of Cosines for non-right triangles: In any triangle with sides a, b, c and opposite angles A, B, C, the relation c² = a² + b² – 2ab·cos C holds. Use this to compute distances when an included angle is known.</description>\n  <example>In triangle XYZ with XZ = a, XY = b, and ∠XYZ = θ, the distance XZ can be found by ZX² = a² + b² – 2ab·cos θ. This yields ZX = √(a² + b² – 2ab·cos θ).</example>\n</note4>\n<note4>\n  <description>Summation of square roots: When summing expressions like √(u + v) + √(u – v), factor or use identities to simplify. For instance, √(u + v) + √(u – v) can sometimes be rewritten in the form m + n√p by completing the square or rationalizing.</description>\n  <example>Given √(5 + 4√3) + √(5 – 4√3), observe that 5 + 4√3 = (1 + 2√3)² and 5 – 4√3 = (1 – 2√3)². Thus the sum is (1 + 2√3) + (1 – 2√3) = 2.</example>\n</note5>\n<note5>\n  <description>Triangle inequality for lower bounds: For any point X and triangle ABC, the sum AX + BX ≥ CX when X lies on the extension of AB beyond B. Use this to derive minimal path sums by comparing routes through different vertices.</description>\n  <example>In triangle ABC, pick X on line AB extended past B. Then AX + BX ≥ CX, showing that X must lie on the extension to minimize AX + BX + CX. This guides the choice of X to minimize the pentagon’s perimeter sum.</example>", "<note1>\n  <description>Reflection trick to compute the sum of distances from a point to two given points: Reflect one of the fixed points across a line containing the other fixed point to transform the sum of distances into a straight-line distance. This works because reflecting preserves distances and the broken path becomes a straight segment.</description>\n  <example>Given points P and Q on a line ℓ, reflect Q across ℓ to obtain Q′. Then for any point X, PX + XQ = PX + XQ′, which equals the straight-line distance P Q′. Thus the shortest such sum occurs when X lies on the line segment PQ′.</example>\n</note1>\n<note2>\n  <description>Summation of distances via successive reflections: When you have more than two fixed points, reflect them sequentially across the lines determined by adjacent points to reduce the sum of distances to a single straight-line segment. Each reflection step converts one broken segment into a straight one.</description>\n  <example>For three points A, B, C in order, reflect B across line AB to get B′, then reflect C across line BC to get C′. Then for any X, AX + XB + XC = AX + XB′ + XC′, which equals AC′. The minimal sum is achieved when X is on AC′.</example>\n</note3>\n<note4>\n  <description>Angle-chasing and Law of Cosines: In a polygon with two equal angles or in a triangle with a known angle, use the Law of Cosines to express side lengths in terms of other sides and the cosine of the angle. This is useful for relating distances before applying reflection or for determining whether a point lies on a specific line.</description>\n  <example>In triangle ABC with ∠B = ∠C = 60°, the Law of Cosines gives AC² = AB² + BC² − 2·AB·BC·cos(60°) = AB² + BC² − AB·BC. This relation can help verify collinearity or determine distances without computing angles directly.</example>\n</note5>\n<note6>\n  <description>Optimal location: The point that minimizes the sum of distances to a set of fixed points is the intersection of certain lines or rays determined by reflections. This intersection lies on the straight-line segment formed by the reflections and is unique for a convex set of points.</description>\n  <example>Given four points A, B, C, D in order, reflect D across line BC to get D′, then reflect C across AB to get C′, and reflect B across line AB to get B′. The minimal sum AX + XB + XC + XD occurs when X is the intersection of lines AC′ and BD′, which lies on the segment A B′ C′ D′.</example>", "<note1><description>The Fermat–Torricelli point (or geometric median) minimizes the sum of distances to three noncollinear points. In Euclidean geometry, it is the unique point where each of the three segments to the vertices makes a 120° angle with the others.</description><example>Given triangle PQR, the Fermat point F satisfies ∠P F Q = ∠Q F R = ∠R F P = 120°. Placing F at that location minimizes PF+QF+RF.</example></note1>\n<note2><description>When one or more vertices of a polygon lie on a circle, the circle’s center can be a candidate for minimizing sums of distances to all vertices. The center often yields equal or symmetric distances, reducing the total.</description><example>For a cyclic quadrilateral ABCD, the center O of its circumcircle satisfies OA=OB=OC=OD. Thus, O minimizes OA+OB+OC+OD among all points in the plane.</example></note1>\n<note3><description>Reflecting a vertex across a chosen line or point can transform a distance sum into a straight-line path. This technique turns a broken line into a polygonal chain, enabling the use of triangle or polygon inequalities to bound the sum.</description><example>Given point A and line ℓ, reflect A to A′ across ℓ. Then for any point X on ℓ, AX+XB = A′XB, which is constant along ℓ. Choosing the optimal X on ℓ (often the foot of the perpendicular) minimizes this sum.</example></note1>\n<note4><description>When a polygon has multiple equal or congruent sides, exploiting symmetry often reduces the search space. By placing the minimization point at a symmetric location (e.g., center, midpoint), one can simplify distance computations.</description><example>In a regular pentagon, the center is equidistant from all vertices. Thus, the sum of distances from the center to each vertex is simply 5 times the circumradius, avoiding the need to consider each vertex separately.</example></note1>\n<note5><description>After identifying a candidate point, verify that the sum of distances is indeed minimal by checking boundary and symmetry cases. Use convexity or triangle inequalities to confirm that no other point can yield a smaller total.</description><example>For a triangle, once the Fermat point F is found, check the distances to the vertices. By comparing F with any boundary point (e.g., midpoint of a side), one confirms that F is the global minimizer.</example></note1>", "<note1>\n  <description>\n    The Fermat–Torricelli point minimizes the sum of distances to three noncollinear points by constructing equilateral triangles on each side and connecting vertices to the opposite points; the intersection is the point minimizing the total distance.\n  </description>\n  <example>\n    Given triangle with vertices A, B, C, build equilateral triangles on AB and BC, then connect their opposite vertices to A and C respectively. The intersection of these two lines is the Fermat–Torricelli point for A, B, C.\n  </example>\n</note1>\n<note2>\n  <description>\n    In an equilateral triangle of side length s, the sum of distances from any interior point to the three vertices equals s times the square root of 3. This gives a constant term when applying the Fermat–Torricelli idea to three points.\n  </description>\n  <example>\n    For an equilateral triangle with side 5, any point inside satisfies PA+PB+PC=5√3, since each angle in the equilateral triangle is 60° and the distance sum formula yields this constant.\n  </example>\n</note2>\n<note3>\n    <description>\n    The sum of distances from a point to the vertices of a convex polygon can be split into sums over k-consecutive vertices. Each such k-sum is minimized by the Fermat–Torricelli point of those k vertices, yielding a piecewise constant term depending on k.\n  </description>\n  <example>\n    In a convex pentagon, split the sum into segments like A→B→C→D and C→D→E→A. The minimum of A+B+C+D is s₁√3 and of C+D+E+A is s₂√3, where s₁ and s₂ are the side lengths of the corresponding equilateral constructions.\n  </example>\n</note3>\n<note4>\n  <description>\n    When two overlapping Fermat–Torricelli constructions share a common point, the total minimum sum equals the sum of the two constant terms minus the distance between the shared point and the third vertex. This accounts for double counting.\n  </description>\n  <example>\n    If the Fermat–Torricelli points for A,B,C and C,D,E coincide at X, then A+B+C+D+E = (s₁√3)+(s₂√3) – CX, where s₁,s₂ are side lengths of the equilateral triangles.\n  </example>\n</note4>\n<note5>\n  <description>\n    To find the distance between two Fermat–Torricelli points, use the Law of Cosines in the triangle formed by those points and one common vertex. This yields a radical expression in terms of the side lengths and the included angle.\n  </description>\n  <example>\n    For points X and Y both Fermat–Torricelli for triangles sharing vertex C, and with sides CA=s₁, CB=s₂, CY=CA=s₁, CX=CB=s₂, the distance XY satisfies XY² = s₁² + s₂² – 2s₁s₂ cos(60°).\n  </example>\n</note5>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 14, "abstractions": ["<note1>\n  <description>Use the p-adic valuation on cubes: for any integer x, valₚ(x³)=3·valₚ(x). Thus, x³≡0 (mod pᵏ) exactly when valₚ(x)≥ᵏ/3. This reduces cubic congruences to linear conditions on valₚ.</description>\n  <example>To solve y³≡0 (mod p³), require valₚ(y)≥1. So y must be divisible by p.</example>\n</note2>\n  <description>In a product of k cubes, the power of p dividing the product is 3·sum of individual valₚ. Hence, the product is divisible by pᵐ exactly when the sum of valₚ≥m/3. This lets you translate a multiple-of-pᵐ condition into a sum-of-valuations constraint.</description>\n  <example>For three cubes u³·v³·w³≡0 (mod p⁵), demand valₚ(u)+valₚ(v)+valₚ(w)≥5/3=1.666…, so the sum must be at least 2.</example>\n</note3>\n  <description>Count ordered triples (u,v,w) with u,v,w≤M and valₚ-sum S by partitioning into cases S=0,1,…, up to valₚ(M). Use the fact that each valₚ-range is a fixed-size block. Then sum over each block the number of ways to choose (u,v,w) in that block.</description>\n  <example>Let M=pᵃ. For S=1, u,v,w can each be in the block of size pᵃ⁻¹. Number of triples=3·(pᵃ⁻¹)³. For S=2, both blocks of size pᵃ⁻² and one of size pᵃ⁻¹ contribute, etc.</example>\n</note4>\n  <description>Use modular arithmetic on residues modulo p: for each residue r, compute r³ mod p. Then count how many triples of residues have sum≡0 (mod p). This reduces the problem to counting combinations of residues satisfying a linear congruence.</description>\n  <example>For p=3, cubes mod 3 are {0,1}. To get sum≡0 mod 3, the only possibility is (0,0,0). For p=5, cubes mod 5 are {0,1,−1}. Count triples (r₁,r₂,r₃) with r₁+r₂+r₃≡0 mod 5 by listing or by symmetry.</example>\n</note5>\n  <description>Apply the Chinese Remainder Theorem (CRT) if the modulus factors into pᵏ and qᵐ. Count solutions modulo pᵏ and modulo qᵐ separately, then combine using CRT to count solutions modulo pᵏ·qᵐ. This often simplifies multi-prime problems into smaller, independent ones.</description>\n  <example>To count solutions modulo 9·25, first count triples mod 9 (use valₚ or residue checks), then mod 25 (via cubes mod 25), and finally combine using CRT to get the total count mod 225.</example>\n</note6>\n  <description>Use generating functions: the generating function for valₚ-sum is ∑_{k=0}^{vₚ(M)}x^{3k}. For three variables, it’s [G(x)]³. Extract the coefficient of x^{m/3} to count triples with sum of valₚ=m/3. This is especially useful for higher powers and combinations.</description>\n  <example>With M=pᵃ, G(x)=1+x+x²+…+x^{a}. For three variables, [G(x)]³ expands; the coefficient of x^{2} (when m/3=2) gives the number of triples with valₚ-sum=2.</example>", "<note1>\n  <description>When a prime P divides a sum of cubes, reduce each cube modulo P^k. For P≡1 mod 3, the cube map is a permutation on residue classes; for P≡2 mod 3, only 0 and ±1 are cubes. Use this to classify possible residue patterns.</description>\n  <example>Compute a^3+b^3+c^3 mod 3^2. Since 3≡0 mod 3, the cube map is trivial: a^3≡0. Thus the only way for the sum to be 0 mod 9 is if each term is 0 mod 9, or if one term is ±1 and the other two are 0, etc.</example>\n</note2>\n  <description>Partition the set of triples by the multiset of their residues mod P^k. Count the number of ordered triples for each residue pattern, then sum over all valid patterns. This converts the problem into a finite enumeration of residue types.</description>\n  <example>For (a,b,c) mod 9, list patterns like {0,0,0}, {1,1,7}, {1,2,6}, etc. Compute # of ordered triples for each pattern by distributing which variable takes each residue, then multiply by the count of integer values in each residue class.</example>\n</note3>\n  <description>Use inclusion–exclusion to enforce multiple divisibility constraints. If you need the sum to be divisible by P^k and also by another modulus, count all triples satisfying each constraint separately, subtract those violating both, add back those violating all three, etc.</description>\n  <example>To count triples with a^3+b^3+c^3≡0 mod 9 and a+b+c≡0 mod 3, first count triples with a^3+b^3+c^3≡0 mod 9, then count those with a+b+c≡0 mod 3, subtract those satisfying neither, and so on.</example>\n</note4>\n  <description>When variables are bounded by a power of P (like P^m), the number of integers congruent to r mod P^k in that range is ⌊(P^m−r)/P^k⌋+1. This counts how many integers in each residue class contribute to ordered triples.</description>\n  <example>For 1≤a≤3^6 and a≡r mod 3^3, the count is ⌊(3^6−r)/3^3⌋+1. If r=27, then ⌊(729−27)/27⌋+1=⌊702/27⌋+1=26+1=27.</example>\n</note5>\n  <description>After counting ordered triples, often one must reduce the result modulo a large number. Use modular arithmetic properties (e.g. (x+y) mod m = [(x mod m)+(y mod m)] mod m) to simplify each term before summing to avoid large intermediate values.</description>\n  <example>If the total count is T=23456789, and you need T mod 1000, compute 23456789 mod 1000 by taking the last three digits 789, so T≡789 mod 1000.</example>", "<note1>\n  <description>Any integer modulo n can be classified by its reduction class. For n=3^k, there are exactly n classes, and each class behaves uniformly under addition and exponentiation. This lets you replace each variable by its class representative when counting solutions mod n.</description>\n  <example>Suppose you need to count solutions of x+y≡0 mod 9. Since each of x and y can be one of the 9 classes, you iterate over all pairs of classes (i,j) with i+j≡0 mod 9, then count how many pairs of actual integers lie in those classes.</example>\n</note1>\n  <note2>\n  <description>For a fixed exponent k, the map x↦x^k mod 3^k is not one-to-one. Instead, it is a group homomorphism on the multiplicative subgroup of units modulo 3^k. You must first determine the kernel of this map (the set of x with x^k≡1) and the image (the subgroup of cubes or k-th powers mod 3^k).</description>\n  <example>Mod 9, the cubes are {1,8}. The map x↦x^3 sends the units {1,2,4,5,7,8} onto {1,8}, and the kernel is the empty set. Thus any solution mod 9 to x^3+y^3+z^3≡0 must come from choosing classes whose sum of cubes is 0, which here means summing from {1,8} to get 0 mod 9.</example>\n</note2>\n  <note3>\n  <description>When counting ordered tuples that satisfy a modular equation, you can first count for one prime factor and then apply the Chinese Remainder Theorem (CRT) by multiplying counts for each prime power. This reduces complex multi-prime problems to simpler single-prime problems.</description>\n  <example>To count solutions of x^2+y^2+z^2≡0 mod 8, first solve modulo 2 and modulo 4, then multiply the resulting counts. If there are m solutions mod 2 and n solutions mod 4, the CRT guarantees m·n solutions mod 8.</example>\n</note3>\n  <note4>\n  <description>To enumerate all classes whose cubes sum to zero mod 3^k, you can use generating functions or simple enumeration. For each class i, compute i^3 mod 3^k, then find all triples (i,j,k) with i^3+j^3+k^3≡0. This yields the valid class combinations.</description>\n  <example>Mod 9, list cubes {1,8}. The only way three cubes sum to 0 is 1+8+8=17≡8 (not 0), so no single class triple works. Thus you must look at pairs of classes instead, checking sums like 1+1=2 (not divisible by 9), 1+8=9≡0, etc.</example>\n</note4>\n  <note5>\n  <description>After finding valid class combinations, account for the number of actual integers in each class. If each variable ranges up to 3^6, then each class of size d contributes d^3 choices. Summing over all valid combinations gives the total count.</description>\n  <example>Suppose classes A and B each have size 3^5, and you found that A+A+A≡0 mod 3^7 is valid. Then each choice of (A,A,A) corresponds to 3^5·3^5·3^5=3^15 solutions. Sum this over all valid triples of classes.</example>\n</note5>", "<note1>\n  <description>When working modulo a prime power p^n, classify integers by their residue classes modulo p. Powers of these residues repeat periodically, and one can tabulate the possible values of x^k mod p^n for each class.</description>\n  <example>To compute x^2 mod 4 for x in {1,2,3}, note 1^2=1, 2^2=4≡0, 3^2=9≡1 mod 4. Thus the only possible values are 0 and 1.</example>\n</note1>\n<note2>\n  <description>Use the binomial theorem to expand (x + p·k)^k mod p^n. Only terms with p^n on or above will vanish, and the lower-order terms give the expansion of x^k mod p^n.</description>\n  <example>Expand (x + 2·1)^2 mod 4: (x + 2)^2 = x^2 + 4x + 4. All terms divisible by 4 vanish, so the result is x^2 mod 4.</example>\n</note3>\n<note3>\n  <description>When a sum of powers is required to be 0 mod p^n, one can assign each variable a residue class that, when summed, yields the desired total. Count the number of ways to choose classes whose sum is 0 mod p^n.</description>\n  <example>For two variables x,y with x^2,y^2∈{0,1} mod 4, the sum x^2+y^2≡0 mod 4 only if both are 0. There are 1 way to choose (0,0) out of 4 total choices.</example>\n</note4>\n<note4>\n  <description>For independent variables, if each variable can be chosen in A ways, then ordered pairs or triples have A^m choices. If choices depend on the sum condition, sum over all valid combinations of classes.</description>\n  <example>With two variables each having 2 valid classes (residue 0 or 1 mod 4), ordered pairs have 2^2=4 total. If the sum condition restricts to one class combination, there is 1 valid pair.</example>\n</note5>\n<note5>\n  <description>When the total count is large, reduce it modulo m by using modular arithmetic throughout. Multiplying or summing counts modulo m preserves the final result mod m.</description>\n  <example>If the number of valid triples is 27 and you need the remainder mod 10, compute 27 mod 10 = 7, so the remainder is 7.</example>\n</note6>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
