{"row_idx": 0, "abstractions": ["1. <note1>\n  <description>When a number is given in base b, convert it to decimal by summing its digits times powers of b: Nₖₙₐₜₐₗ = ∑_{i=0}^k a_i·b^i. This lets you compare or test divisibility in a familiar number system.</description>\n  <example>For a two-digit number in base b, say digits (d₁,d₂), its decimal form is d₁·b + d₂. If d₁=2 and d₂=3, then the number is 2b + 3 in decimal.</example>\n</note1>\n2. <note2>\n  <description>Divisibility in base b is equivalent to divisibility in decimal: to check if A_{b} divides B_{b}, convert both to decimal and compute B_{b}/A_{b}. If the result is an integer, the division holds.</description>\n  <example>Suppose you want to know if X = 1a_{b} and Y = a1_{b} are divisible. Convert: X = a·b + 1 and Y = 1·b + a, then compute (a·b + a)/(a·b + 1). If you get an integer, X divides Y.</example>\n</note1>\n3. <note3>\n  <description>Factor the resulting polynomial in b to find conditions on b. After converting and dividing, you get a rational expression; set the numerator equal to k·denominator and solve for b.</description>\n  <example>From (b + 2)/(b + 1) = k, multiply: b + 2 = k(b + 1). Rearranged gives (k – 1)b = k – 2. Solving yields b = (k – 2)/(k – 1), which you then check for integer solutions.</example>\n</note1>\n4. <note4>\n  <description>Apply the base inequalities (digits ≤ b–1 and base ≥ 2) to the candidate solutions. Always ensure the converted decimal values respect these bounds before accepting a base.</description>\n  <example>After finding b = 5, check if all digits in the original numbers are ≤ 5. If any digit exceeds 5, b is invalid. If every digit ≤ 5 and b ≥ 2, then b is a valid base.</example>\n</note1>\n5. <note5>\n  <description>Verify divisibility by plugging each valid base back into the original expression. Direct substitution ensures the computed decimal quotient is indeed an integer.</description>\n  <example>For b = 5, compute 17₅ = 1·5 + 7 = 12 and 97₅ = 9·5 + 7 = 52. Check 52/12. If it’s an integer, then 17₅ divides 97₅ in base 5.</example>\n</note1>", "<note1>\n    <description>Convert any base-b number to decimal by expressing it as a sum of its digits times powers of b. Use this to translate divisibility or arithmetic conditions into algebraic equations in b.</description>\n    <example>For instance, the base-b number “XY” equals X·b + Y in decimal. If you need to check whether “XY” is divisible by Z in base b, first rewrite it as X·b + Y and then apply the divisibility test to this expression.</example>\n  </note2>\n  <note3>\n    <description>Translate a divisibility condition “A_{b} divides B_{b}” into an integer divisibility condition in b by equating B = k·A in decimal form. This yields an algebraic equation in k and b that you can solve for integer solutions.</description>\n    <example>Suppose you want A_{b} to divide B_{b}. Write B = M·b + N and A = P·b + Q, then set M·b + N = k·(P·b + Q). Rearrange to (M – kP)·b = kQ – N and solve for integer b and k.</example>\n  </note3>\n  <note4>\n    <description>When you obtain a linear Diophantine equation in b, isolate b and impose integrality and positivity constraints. This often reduces to checking that a parameter (like k) lies in a finite set of allowable integer values.</description>\n    <example>From (M – kP)·b = kQ – N, if M – kP ≠ 0, then b = (kQ – N)/(M – kP). Ensure kQ – N is divisible by M – kP and that b &gt; 0 to find all valid integer bases.</example>\n  </note5>\n  <note6>\n    <description>After finding all candidate bases, verify each by re-converting the numbers to base 10 and confirming the divisibility holds. This step catches any algebraic oversights or invalid parameter choices.</description>\n    <example>Suppose you find b = 10 and b = 20 as solutions. Convert 17_{b} and 97_{b} to decimal for each b, compute the ratio, and confirm it is an integer. Discard any b that fails this check.</example>\n  </note7>", "base_conversion  \nConvert a number with digits {d_k,…,d_0} in base b to decimal:  \nDecimal = Σ_{i=0}^k d_i·b^i.  \nExample: 17_b = 1·b + 7; 97_b = 9·b + 7.", "1. <note1>\n  <description>Convert a number written in base b to its decimal form by expanding it as a sum of its digits times powers of b. This lets you apply standard divisibility and arithmetic tests in base 10.</description>\n  <example>For a two-digit number (d₁ d₂) in base b, compute N = d₁·b + d₂. For instance, (d₁ d₂)_b = d₁·b + d₂ in decimal. You then use decimal methods to check divisibility.</example>\n</note1>\n2. <note2>\n  <description>Use the divisibility criterion for a fixed divisor k: a number is divisible by k if and only if its decimal form N is divisible by k. This holds for any base conversion.</description>\n  <example>If you need (d₁ d₂)_b to be divisible by k, compute N = d₁·b + d₂ and check N mod k = 0. For example, to test (d₁ d₂)_b divisible by k, compute (d₁·b + d₂) mod k.</example>\n</note3>\n3. <note3>\n  <description>Translate the divisibility condition into an inequality of the form (d₁·b + d₂)/k = integer. Rearranged, this gives a linear inequality in b that you solve to find all valid bases.</description>\n  <example>From N/k = d₁·b/k + d₂/k being integer, derive b ≥ (d₂·k)/d₁. Solve this inequality for integer b to get the range of valid bases.</example>\n</note4>\n4. <note4>\n  <description>When bases must exceed a certain threshold, enforce the inequality b &gt; threshold. Combine this with the divisibility inequality to pinpoint the minimal valid base.</description>\n  <example>If the divisibility yields b ≥ M and the problem requires b &gt; T, then b must satisfy max(M, T+1) ≤ b ≤ upper bound. Check integer solutions in this interval.</example>\n</note5>\n5. <note5>\n  <description>After finding all candidate bases, verify each by direct substitution into the original divisibility expression to ensure no edge cases or rounding errors are missed.</description>\n  <example>For each candidate b in the interval, compute N = d₁·b + d₂ and check N mod k = 0. Discard any that fail this test.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 1, "abstractions": ["1. <note id=\"reflection-lengths\">Reflection across a point on a segment: Reflecting a point on one segment through a point on an adjacent segment doubles the distance to the segment’s endpoint. This transforms segment lengths via simple algebraic relations.</note>\n2. <note id=\"area-scaling\">Area scales as the square of a linear scale factor. If a figure is enlarged or reduced by a factor k, its area becomes k² times the original.</note>\n3. <note id=\"triangle-area-from-base-height\">A triangle’s area equals ½×(base)×(height). Use any side as base and compute the perpendicular height to that base to find the area.</note>\n4. <note id=\"composite-area-subtraction\">Complex polygons can be decomposed into triangles and quadrilaterals. Compute each part’s area and subtract overlapping regions or subtract from a larger enclosing shape to find the unknown area.</note>\n5. <note id=\"mass-points-and-area-ratios\">Assign masses at vertices to find segment division ratios. These ratios translate directly into area ratios of triangles sharing a common height or base. Use mass-point techniques to compute unknown areas from known ones.</note>", "<note1>\n  <description>Reflecting a point across a midpoint on a segment yields two points symmetric about that midpoint, so the segment is bisected and the reflected point lies at the same distance on the opposite side.</description>\n  <example>On segment XY, let M be its midpoint. Reflect P on XY across M to get P'. Then XP = MP and YP' = MP, and X, M, Y are collinear with M between X and Y.</example>\n</note1>\n  <note2>\n  <description>Reflecting a point across another point (not a midpoint) doubles the distance to the other point. For any point R and its reflection S across Q, QR = QS, and R, Q, S are collinear with Q between R and S.</description>\n  <example>Given Q and P, their reflection P' across Q satisfies PQ = QP' and P, Q, P' are collinear. Thus if PQ = 7, then QQ' = 7 and PP' = 14.</example>\n</note1>\n  <note3>\n  <description>Area ratios of triangles sharing the same altitude are equal to the ratios of their bases, and area ratios of triangles sharing the same base are equal to the ratios of their altitudes.</description>\n  <example>Triangles ABD and ABC share altitude from A to line BC. If BD:DC = 2:3, then area(ABD):area(ABC) = 2:5.</example>\n</note1>\n  <note4>\n  <description>When a point divides a side in a ratio r:s, the areas of triangles sharing that side are in the ratio r:s. This follows from equal altitude heights.</description>\n  <example>On side XY, let Z divide XY so that XZ:ZY = 3:4. For any point W, area(XWZ):area(WZY) = 3:4 because both triangles have the same altitude from W to XY.</example>\n</note1>\n  <note5>\n  <description>Decompose a complex polygon into triangles and quadrilaterals whose areas can be computed by base-height or by subtracting known areas. Sum or subtract these areas to find the target region.</description>\n  <example>To find the area of a pentagon, draw diagonals from one vertex to split it into three triangles. Compute each triangle’s area and sum them for the pentagon’s area.</example>\n</note1>", "1. <note1>\n  <description>Reflecting a point across a segment preserves distances: the image is the same distance from the reflection point on the opposite side of the segment. This creates congruent triangles and parallel lines.</description>\n  <example>Given segment PQ and point R, reflecting R across PQ yields R′ such that R′ lies on the line through R perpendicular to PQ, at the same distance from P and Q as R.</example>\n</note1>\n2. <note2>\n  <description>When two triangles share the same base and have equal altitudes, their areas are equal. This holds whenever their vertices lie on parallel lines or are symmetric across a line.</description>\n  <example>Triangles ABD and ACD share base AD and have their third vertices B and C on a line parallel to AD, so area(ABD)=area(ACD).</example>\n</note1>\n3. <note3>\n  <description>Reflecting across a point swaps distances equally: if X→X′ is a reflection across point O, then O is the midpoint of XX′. This midpoint property often yields equal segment lengths.</description>\n  <example>Reflecting point P across O gives P′ so that O=(P+P′)/2. Thus OP=OP′ and any segment through O splits equally.</example>\n</note1>\n4. <note4>\n  <description>Decompose a complex polygon into triangles and quadrilaterals whose areas are known or easily computed. Summing these parts yields the total area without direct formula.</description>\n  <example>To find the area of a heptagon, draw diagonals from one vertex to split it into triangles and a quadrilateral, compute each area, then add them.</example>\n</note1>\n5. <note5>\n  <description>The ratio of areas of two triangles with equal altitudes equals the ratio of their bases. Conversely, if bases are equal, area ratio equals altitude ratio.</description>\n  <example>Triangles with bases b₁ and b₂ on the same line and equal height h have areas b₁·h/2 and b₂·h/2, so area ratio = b₁/b₂.</example>\n</note1>", "1. <note>\n   <description>Reflecting a point across a midpoint on a segment produces congruent segments and parallelism. When P is reflected across midpoint M of segment XY, PM = MY and XY∥PN. Use this to create parallel lines or equal lengths in composite figures.</description>\n   <example>In quadrilateral ABCD, let M be midpoint of AB. Reflect D across M to get D'. Then AD' = MB and AD'∥AB. This can help prove AD'∥BC or identify equal angles when combined with other lines.</example>\n</note>\n2. <description>Area ratios in triangles with a common altitude are proportional to their bases. For triangles sharing the same height from a vertex to a line, the ratio of their areas equals the ratio of their base lengths.</description>\n   <example>Triangle PQR has base QR. Draw any point S on QR. Then triangles PSR and PQS share altitude from P and have areas in ratio SR:SQ.</example>\n3. <description>Area decomposition via triangles and parallelograms: any polygon can be split into triangles whose areas sum to the total. When a quadrilateral is inscribed in a larger triangle, subtracting known areas of triangles yields the quadrilateral’s area.</description>\n   <example>In triangle ABC, quadrilateral DEFG is inscribed. Compute area(ABC) and subtract areas of triangles ADE, BDF, etc. The sum of the remaining triangles equals area(DEFG).</example>\n4. <note>\n   <description>Mass point geometry assigns weights to vertices so that weighted sums balance at points dividing segments. It helps find ratios of segments and corresponding areas in complex figures.</description>\n   <example>On segment AB, point D divides it in ratio AD:DB = p:q. Assign mass q at A and p at B. Then the mass at D is p+q. This mass assignment can then be propagated to other points to find lengths and areas.</example>\n</note>\n5. <description>Area addition and subtraction: when a polygon is partitioned by non-intersecting diagonals or lines, the total area is the sum of the areas of the resulting parts. Conversely, known subareas can be used to find unknown parts.</description>\n   <example>Quadrilateral WXYZ is split by diagonal WY into triangles WXY and WYZ. Then area(WXYZ) = area(WXY) + area(WYZ). If one triangle’s area is known, subtract it from the total to find the other.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 2, "abstractions": ["1. <note>\n  <description>Use the stars-and-bars method to count nonnegative integer solutions to x₁ + x₂ + … + x_k = N. The number of solutions is C(N + k – 1, k – 1). This counts all assignments without any ordering or inequality constraints.</description>\n  <example>For x₁ + x₂ + x₃ = 5, the total number of solutions is C(5 + 3 – 1, 3 – 1) = C(7, 2) = 21.</example>\n</note>\n2. <note>\n  <description>Enforce a strict ordering x₁ &gt; x₂ &gt; … &gt; x_k by setting y₁ = x₁, y₂ = x₂ – 1, y₃ = x₃ – 2, …, y_k = x_k – (k – 1). Then y₁ + y₂ + … + y_k = N – C_k = N – k(k – 1)/2. Count nonnegative solutions to this reduced sum.</description>\n  <example>For x₁ + x₂ + x₃ = 7 with x₁ &gt; x₂ &gt; x₃, set y₁ = x₁, y₂ = x₂ – 1, y₃ = x₃ – 2 so y₁ + y₂ + y₃ = 7 – 3 = 4. The number of solutions is C(4 + 3 – 1, 3 – 1) = C(6, 2) = 15.</example>\n</note>\n3. <note>\n  <description>Handle additional constraints like “at least one of each” by first assigning one unit to each variable: xᵢ' = xᵢ – 1. Then solve x₁' + x₂' + … + x_k' = N – k. Use stars-and-bars on the reduced sum.</description>\n  <example>For x₁ + x₂ + x₃ = 8 with xᵢ ≥ 1, set xᵢ' = xᵢ – 1 so x₁' + x₂' + x₃' = 5. The number of solutions is C(5 + 3 – 1, 3 – 1) = C(7, 2) = 21.</example>\n</note>\n4. <note>\n  <description>When multiple variables are bounded (e.g. 0 ≤ xᵢ ≤ M), use inclusion–exclusion. Subtract assignments where one variable exceeds its bound, add back overlaps, etc. This handles upper or lower limits on variables.</description>\n  <example>To count nonnegative x₁ + x₂ + x₃ = 6 with x₁ ≤ 3, 0 ≤ x₂, x₃ ≤ 5: start with C(6 + 3 – 1, 3 – 1) = 28, subtract cases where x₁ ≥ 4 (set x₁' = x₁ – 4) giving C(2 + 3 – 1, 2) = 6, so total = 28 – 6 = 22.</example>\n</note>\n5. <note>\n  <description>Use generating functions to encode constraints: for each variable xᵢ with bounds, use a polynomial (1 + t + … + t^M) for upper bounds or 1/(1 – t) for nonnegative. The coefficient of t^N in the product gives the count of valid assignments.</description>\n  <example>For x₁ + x₂ + x₃ = 6 with 0 ≤ xᵢ ≤ 3, the generating function is (1 + t + t² + t³)³. Expand and find the coefficient of t⁶, which is 15, matching the count from inclusion–exclusion.</example>\n</note>", "1. <note>\n  <description>Use stars-and-bars with distinct counts: if you need exactly k₁ of type A, k₂ of type B, k₃ of type C among n items, and you know k₁&gt;k₂&gt;k₃&gt;0, enforce these inequalities via a single-variable substitution t=k₁−k₂−k₃. Then count nonnegative solutions by standard stars-and-bars: choose 2 separators among n−1 slots.</description>\n  <example>For 9 people choosing 3 flavors with counts a&gt;b&gt;c&gt;0, set t=a−b−c. Then a=b+t, c=b−t, so enforce 0≤t≤b−1. The total number of ways is ∑_{t=0..b−1} C(n−1,2) = b·C(n−1,2).</example>\n</note>\n2. <note>\n  <description>Enforce a &gt; b &gt; c by shifting variables: let a′=a−(b+1), b′=b−1, c′=c so that a′,b′,c′ are nonnegative and sum to n−3. Then count nonnegative solutions to a′+b′+c′=n−3 via C((n−3)+2,2)=C(n−1,2).</description>\n  <example>With 9 players, we have a′+b′+c′=6. The number of nonnegative solutions is C(6+2,2)=C(8,2)=28. Each solution yields a unique ordered triple (a′,b′,c′) and thus (a,b,c).</example>\n</note>\n3. <note>\n  <description>Use generating functions for ordered distinct counts: the generating function is (x+x²+…)^3 = x³(1−x)^−3. We need the coefficient of x^9 in this expansion, which is [x^6](1−x)^−3 = C(6+2,2)=C(8,2)=28. This directly counts all ordered triples (a,b,c) with a+b+c=9 and a&gt;b&gt;c&gt;0.</description>\n  <example>For n=9, GF(x)=x³(1−x)^−3. The coefficient of x^6 in (1−x)^−3 is C(6+2,2)=28, giving the total number of valid assignments.</example>\n</note>\n4. <note>\n  <description>Apply inclusion-exclusion to enforce a &gt; b &gt; c when summing to n: total ordered triples (a,b,c) with a+b+c=n is C(n−1,2). Subtract those where equality holds (e.g. a=b, b=c, or a=b=c) by summing and subtracting overlaps, then divide by the number of permutations of equalities to correct overcounting.</description>\n  <example>For n=9, total C(8,2)=28. Subtract cases where two are equal: for each pair, count solutions (e.g. a=b): solve 2a+c=9 ⇒ c=9−2a, enforce c&gt;0 ⇒ a ranges 1..4 ⇒ 4 cases. There are 3 pairs, so subtract 3·4=12. But this double-subtracts those with all three equal, which is impossible here, so no further correction. Thus valid triples =28−12=16. Then divide by permutations of equalities if needed.</example>\n</note>\n5. <note>\n  <description>Check boundary and feasibility: when shifting variables or using inequalities, ensure that the resulting nonnegative integers remain within the sum constraint. For example, if a′=a−(b+1)≥0, then a≥b+1, so the minimal b is 1 and a≥2. Verify all derived variables satisfy these bounds to avoid invalid solutions.</description>\n  <example>In the 9-player case, a′=a−(b+1)≥0 ⇒ a≥b+1. Since b≥1, a≥2. Also c=b−t≥0 ⇒ b≥t. Combining with a′+b′+c′=6 ensures 0≤t≤b−1 and b≤6, so b ranges 1..6, and each b yields t from 0 to b−1.</example>\n</note>", "1. <note>\n  <description>When assigning distinct flavors to players under strict inequalities, first assign the smallest size to the least-preferred flavor, then the next smallest to the middle, and so on. This ensures the inequalities hold without overcounting.</description>\n  <example>For 7 players and flavors A&gt;B&gt;C, set x_C =1, x_B =2, x_A =4. Then x_A&gt;x_B&gt;x_C and the total is 7. Other invalid splits, such as x_C=2, would violate the strict inequalities.</example>\n</note>\n2. <note>\n  <description>Use stars-and-bars to count nonnegative distributions of a fixed total N among k flavors: the number of solutions is C(N+k–1, k–1). For nonnegative integer solutions, this formula applies directly.</description>\n  <example>To distribute 10 units among 3 flavors with no restrictions, compute C(10+3–1, 3–1) = C(12,2) =66 possible assignments.</example>\n</note>\n3. <note>\n  <description>Adjust stars-and-bars for a lower-bound requirement: if each flavor must have at least one unit, subtract the required minimum from the total and apply the formula. This enforces the “at least one” constraint.</description>\n  <example>With 7 players and at least one of each of 3 flavors, set N₀=7–3=4 and apply C(4+3–1,3–1)=C(6,2)=15 distributions where each flavor gets ≥1.</example>\n</note>\n4. <note>\n  <description>Apply inclusion–exclusion to enforce that all flavors appear at least once. Subtract assignments missing one flavor, add back those missing two, etc., to get the count where none are empty.</description>\n  <example>For 7 players and 3 flavors, total assignments are 3⁷=2187. Subtract those missing A (2⁷=128), B (128), C (128), add back those missing two (1⁷=1 three times), yielding 2187–3·128+3·1 =1647.</example>\n</note>\n5. <note>\n  <description>When the distribution is constrained to a small set of integer tuples (e.g. (4,2,1) for 7 players), sum the number of permutations of each tuple. For a tuple with multiplicities, use N!/(n₁!n₂!…).</description>\n  <example>For tuple (4,2,1) among 7 players, the number of distinct assignments is 7!/(4!2!1!) =210. Similarly, add for other valid tuples to get the total.</example>\n</note>", "1. <note id=\"partition_with_bounds\">\n  <description>Partition a total of N identical items into k positive parts with each part ≥1 and a given strict order. The number of solutions is the number of integer triples (a,b,c) satisfying a+b+c=N, a&gt;b&gt;c&gt;0, which equals the number of partitions of N–3 into k=3 positive parts minus invalid cases.</description>\n  <example>For N=7, the valid triples (a,b,c) with a&gt;b&gt;c&gt;0 are (5,1,1) (invalid), (4,2,1) only. Thus 1 solution.</example>\n</note>\n2. <note id=\"counting_with_strict_inequalities\">\n  <description>To count integer solutions to x₁&gt;x₂&gt;…&gt;xₖ&gt;0 summing to S, let yᵢ=xᵢ–(k–i). Then yᵢ≥1 and ∑yᵢ=S–½k(k–1). The number of solutions is C((S–½k(k–1))–1, k–1).</description>\n  <example>For (x₁,x₂,x₃) with x₁&gt;x₂&gt;x₃&gt;0 summing to 10: S–½·3·2=8, so C(7,2)=21 valid triples.</example>\n</note>\n3. <note id=\"complementary_counting\">\n  <description>When direct counting of strict inequalities is hard, count all nonnegative solutions to x₁+x₂+…+x_k=S and subtract those with any equality or invalid part. Use the inclusion-exclusion principle over the constraints.</description>\n  <example>To count (a,b,c) positive with a+b+c=7 and a&gt;b&gt;c, start from C(6,2)=15 total positive triples, subtract those where a=b, b=c, or a=b=c (handled by inclusion-exclusion), yielding 2 valid.</example>\n</note>\n4. <note id=\"dynamic_programming_counting\">\n  <description>Model the partition count as a DP table dp[i][j] where i is the remaining sum and j is the number of parts. Initialize dp[0][0]=1 and fill dp[i][j] by summing dp[i–x][j–1] for all x&gt;0, enforcing the order constraint via transitions.</description>\n  <example>For N=7, k=3: dp[7][3] is computed by summing dp[6–x][2] for x=1..6, then selecting only those x where the resulting partitions satisfy the strict order.</example>\n</note>\n5. <note id=\"modular_arithmetic_optimization\">\n  <description>When the final count N is large, compute it modulo M by reducing intermediate sums and binomial coefficients modulo M. Use modular inverses for division in C(n,k) computations to keep numbers small.</description>\n  <example>To find C(100,5) mod 1000, compute factorials mod 1000, divide by 5! mod 1000 using inverses, and reduce at each step to avoid overflow.</example>\n</note>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 3, "abstractions": ["1) <note id=\"quadratic_in_one_variable\">\n  <description>When a Diophantine equation involves a quadratic in one variable, solve it as if it were a standard quadratic and factor or complete the square. This yields linear factors in the other variable.</description>\n  <example>For 3u² + 4uv − v² = 0, treat as 3u² + 4uv = v², then factor to (u + v)(3u − v) = 0, giving two linear relations u = −v or u = v/3.</example>\n</note>\n2) <note id=\"linear_relation_in_integers\">\n  <description>Once factored into linear factors, enforce integrality by requiring that each factor be an integer multiple of the coefficient. For an equation αx + βy = 0, the general integer solution is x = k(−β/α), y = k(α/β).</description>\n  <example>From 2m − 3n = 0, we get m = (3/2)n, so integer solutions are m = 3k, n = 2k for any integer k.</example>\n</note>\n3) <note id=\"bounds_and_parameter_range\">\n  <description>After expressing variables in terms of a parameter k, impose the original domain constraints to find the valid k-values. This often reduces to finding integer k in a closed interval.</description>\n  <example>If x = 2k and y = 3k must lie between −M and M, solve −M ≤ 2k ≤ M to get k in [−⌊M/2⌋, ⌊M/2⌋], then count those integer k.</example>\n</note>\n4) <note id=\"symmetry_and_sign_cases\">\n  <description>When the equation is symmetric in variables (or its factors), count each solution sign separately. If one factor yields two sign choices, multiply by the number of sign cases.</description>\n  <example>For x = −y, each solution (k, −k) has a sign choice for k, giving twice as many solutions as the count of integer k in the interval.</example>\n</note>\n5) <note id=\"counting_integer_solutions\">\n  <description>Use the formula for counting integers in an interval: if k runs from a to b inclusive, the count is b − a + 1. For multiple independent factors, multiply the counts.</description>\n  <example>With k ranging from −5 to 5, there are 5 − (−5) + 1 = 11 integer values, and if there are two independent factors both contributing k, total solutions = 11 × 11.</example>\n</note>", "1.  \n<note1>\n  <description>Quadratic Diophantine equations in two variables can be rewritten as a quadratic form ax² + bxy + cy² = 0, which factors by treating it as a quadratic in one variable. This yields expressions of the form (mx + ny)(px + qy) = 0, exposing linear factors.</description>\n  <example>Given 3x² + 5xy + 2y² = 0, treat it as 3x² + (5y)x + 2y² = 0. The discriminant (5y)² – 4·3·2y² = 25y² – 24y² = y² factors to (y)². Hence x = [–5y ± y]/6 = –y or –2y/3. Since we need integer solutions, impose 3 | y, so y = 3k, x = –k or –2k, giving the factorization (3x + y)(x + 2y) = 0.</example>\n</note1>\n2.  \n<note2>\n  <description>Always divide both sides by any common nonzero factor (e.g. y ≠ 0) before factoring to simplify the equation. This prevents missing trivial or degenerate solutions.</description>\n  <example>For 4x² + 4xy + y² = 0, factor y² to get (2x + y)² = 0. Dividing by y² (assuming y ≠ 0) would be invalid, but recognizing the perfect square directly gives the unique solution 2x + y = 0.</example>\n</note3>\n3.  \n<note3>\n  <description>When a quadratic form factors into a product of two linear forms, set each factor to zero. Solve each linear equation separately to find all integer solutions.</description>\n  <example>From (2x + 5y)(3x – y) = 0, we get 2x + 5y = 0 or 3x – y = 0. Solving 2x + 5y = 0 yields x = –(5/2)y, so for integer x, y must be even. Solving 3x – y = 0 gives x = y/3, so for integer x, y must be a multiple of 3.</example>\n</note4>\n4.  \n<note4>\n  <description>Count integer solutions under bounds by expressing one variable in terms of the other. Use modular arithmetic to enforce divisibility conditions, then bound the resulting integer range.</description>\n  <example>From x = (–c)y/d, with y ∈ [L, U], require d | c·y, so y ≡ 0 mod (c/d). If c/d = k, then y = k·m for integer m. Then x = –c·m. Count m in [L/d, U/d] to get the number of solutions.</example>\n</note5>\n5.  \n<note5>\n  <description>Use the number of integer multiples of a divisor d in an interval [L, U], given by ⌊U/d⌋ – ⌈L/d⌉ + 1. This quickly counts solutions where one variable is a multiple of d.</description>\n  <example>To count integer y in [–100, 100] such that y = 7m, compute ⌊100/7⌋ – ⌈–100/7⌉ + 1 = 14 – (–14) + 1 = 29.</example>\n</note6>", "12x² – xy – 6y² = 0  \n<description>  \nRewrite the quadratic form as a determinant of a 2×2 matrix. The equation det([[12, –½],[–½, –6]]) = 0 is satisfied exactly when the quadratic form is degenerate.  \n</description>  \n<example>  \nGiven 2a² + ab – 3b² = 0, form the matrix [[2, ½],[½, –3]]. Its determinant is 2·(–3) – (½)² = –6 – ¼ = –6.25 ≠ 0, so no nontrivial integer solutions.  \n</example>  \n\nBilinear Form  \n<description>  \nThe equation can be seen as B(x,y) = xᵀ·M·y = 0, where M is symmetric. Integer solutions correspond to vectors in the null space of this bilinear form.  \n</description>  \n<example>  \nFor M = [[2, 1],[1, –1]], solving B(x,y) = 2x² + xy – y² = 0 yields integer pairs (x,y) in the null space of M.  \n</example>  \n\nInteger Factorization  \n<description>  \nFactor the quadratic as (px + qy)(rx + sy) = 0. Solve each linear factor separately, then combine integer solutions.  \n</description>  \n<example>  \nGiven 6m² – 5mn + n² = 0, factor as (3m – n)(2m – n) = 0. Solutions are m = n/3 or m = n/2, with integer m, n accordingly.  \n</example>  \n\nParameterization  \n<description>  \nOnce one factor is set to a nonzero integer k, solve the resulting linear Diophantine equation. Then vary k over all nonzero integers to enumerate solutions.  \n</description>  \n<example>  \nFrom (3m – n) = k, we get n = 3m – k. For each k ≠ 0, choose integer m to generate pairs (m, n).  \n</example>  \n\nCounting on a Finite Grid  \n<description>  \nWhen x,y are bounded, list all integer k values in the allowed range, solve n = (px + qy)/r for each, then count valid (x,y) pairs within bounds.  \n</description>  \n<example>  \nIf x,y ∈ [–5,5], and k must divide a constant, enumerate k in [–5,5], solve n = (px + qy)/r, and count all integer (x,y) satisfying both bounds.  \n</example>", "1. <note1>\n  <description>Factor the quadratic form by grouping variables to write it as a product of two linear forms in (x,y). This reveals integer solutions when each linear factor equals zero.</description>\n  <example>Given 3x² + 2xy – y² = 0, group to (3x – y)(x + y) = 0. Solutions are the union of x = y/3 and x = –y.</example>\n</note1>\n2. <note2>\n  <description>Use the discriminant test: for a general form ax² + bxy + cy² = 0, check D = b² – 4ac. If D is a perfect square, integer solutions exist; otherwise, only (0,0) may be integer.</description>\n  <example>For 4x² + 4xy + y² = 0, D = 16 – 16 = 0 is a perfect square, so integer solutions exist, e.g. x = –y/2.</example>\n</note3>\n3. <note3>\n  <description>Solve each linear factor equation separately to find all lines in the plane. Then enumerate integer points on each line within the given bounds.</description>\n  <example>From (x – 2y)(3x + y) = 0, solve x = 2y and 3x = –y. For x = 2y, list all integer y in the range and compute x = 2y; do the same for 3x = –y.</example>\n</note4>\n4. <note4>\n  <description>Count integer solutions on a line x = k·y or y = m·x within interval [L,U] by noting y must be a multiple of the denominator or x must be a multiple of the denominator. Use floor and ceiling functions to count valid multiples.</description>\n  <example>On x = 3y with y ∈ [–10,10], y must be a multiple of 3. Count multiples: floor(10/3) – ceil(–10/3) = 3 – (–3) = 6 valid y, each giving one x.</example>\n</note5>\n5. <note5>\n  <description>Apply inclusion-exclusion when multiple linear solutions overlap at (0,0). Count each line’s solutions, subtract the overlap count once to avoid double-counting.</description>\n  <example>Two lines x = k·y and y = m·x share only (0,0). If each has 10 solutions, total = 10 + 10 – 1 = 19.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 4, "abstractions": ["Divisibility by 22 = Divisible by 2 AND Divisible by 11. Use the even-digit check and the alternating-sum rule for 11. Pair constraints in the permutation to ensure alternating sums differ by a multiple of 11. Apply inclusion–exclusion to count sequences satisfying both divisibility rules. Extract the final result by subtracting 2025.", "40320", "divisibility by 22: an integer is divisible by 22 if and only if it is divisible by 2 and by 11. For evenness, the last digit must be even; for 11, the alternating sum of digits must be a multiple of 11.", "22 = 2·11, so divisibility by 22 requires divisibility by both 2 and 11. <note1>\n**Divisibility by 2**: A number is divisible by 2 if and only if its last digit is even (2, 4, 6, 8).  \n  <example>For a 4-digit arrangement of {1,2,3,4}, to count those divisible by 2, fix the last digit as one of {2,4}, then permute the remaining 3 digits.</example>\n</note1>\n<note2>\n**Divisibility by 11**: A number is divisible by 11 if and only if the alternating sum of its digits satisfies S_even – S_odd ≡ 0 mod 11.  \n  <example>For digits {1,2,3,4,5,6}, an arrangement with positions 1,3,5 even and 2,4,6 odd must have S_even – S_odd ≡ 0 mod 11. Compute all possible even/odd sums and check this condition before counting permutations.</example>\n</note3>\n<note4>\n**Alternating-sum check with fixed last digit**: When the last digit is fixed (by a 2-divisibility requirement), reduce the remaining 7 positions to 3 even and 4 odd (or vice versa) and enforce S_even – S_odd ≡ 0 mod 11.  \n  <example>With last digit 4 fixed, choose 3 of the remaining 7 for even positions and 4 for odd. Compute the sum of those chosen even and odd positions and verify their difference is 0 mod 11.</example>\n</note5>\n<note6>\n**Counting via selection and permutation**: After selecting which digits go where (even/odd), count the number of ways to assign those positions, then multiply by the number of valid selections satisfying the alternating-sum condition.  \n  <example>Suppose you select a 3-digit even-set and 4-digit odd-set that pass the mod-11 check; there are P(3,3)·P(4,4) ways to arrange them. Sum over all valid selections for the total count.</example>\n</note7>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 5, "abstractions": ["1. <note>Circle in a Tangential Quadrilateral</note>\n  <description>In any quadrilateral that has an inscribed circle (tangential), the sums of the lengths of its opposite sides are equal. This lets you relate side lengths when a circle is tangent to all four sides.</description>\n  <example>For a tangential quadrilateral with sides a, b, c, d, the condition is a + c = b + d. If you know a and c, you immediately know b + d.</example>\n  <pitfall>Ensure the quadrilateral actually has an incircle; otherwise this condition does not hold.</pitfall>\n2. <note>Area via Inradius</note>\n  <description>The area A of any tangential quadrilateral with inradius r and semiperimeter s is A = r·s. This provides a direct link between the inradius and the total area when you know or can find the semiperimeter.</description>\n  <example>If a tangential quadrilateral has inradius r and side lengths a, b, c, d, then its semiperimeter is s = (a + b + c + d)/2 and A = r·s.</example>\n  <pitfall>Use this only when you can confirm the quadrilateral is tangential (has an incircle).</pitfall>\n3. <note>Height from Inradius</note>\n  <description>In any tangential polygon, the perpendicular distance from the incenter to any side equals the inradius r. Thus, the height of a tangential quadrilateral is exactly r.</description>\n  <example>For a tangential quadrilateral, draw the incenter I and drop a perpendicular to one side; that perpendicular length is r, which also serves as the height of the figure when computing area.</example>\n  <pitfall>Remember this only applies when the polygon has an incircle; for non-tangential polygons, the distance from the center to a side may vary.</pitfall>\n4. <note>Trapezoid Area Relation</note>\n  <description>The area of a trapezoid with parallel sides of lengths r and s and height h is A = h·(r + s)/2. Use this when you know the height (e.g., from the inradius) and the sum of the bases.</description>\n  <example>Given a trapezoid with bases r and s and height h, plug into A = h·(r + s)/2 to relate the area to the unknown sum r + s.</example>\n  <pitfall>Ensure the height you use matches the perpendicular distance between the parallel sides.</pitfall>\n5. <note>Sum of Squares via Known Sum and Product</note>\n  <description>For two numbers r and s, the identity r² + s² = (r + s)² − 2rs lets you compute the sum of their squares once you know r + s and rs. This is useful when you have expressions for both the sum and the product of the unknowns.</description>\n  <example>If you determine r + s = S and rs = P, then r² + s² = S² − 2P. For instance, if S = 10 and P = 21, then r² + s² = 100 − 42 = 58.</example>\n  <pitfall>Be careful to correctly compute the product rs; sign errors can lead to incorrect results.</pitfall>", "1. <note1>\n  <description>In a tangential quadrilateral, the sum of the lengths of one pair of opposite sides equals the sum of the other pair. Equivalently, if the sides are labeled a, b, c, d in order, then a + c = b + d. This holds for any quadrilateral that can have an inscribed circle.</description>\n  <example>Consider a tangential quadrilateral with side lengths 5, 7, 6, and 8. By the tangential property, 5 + 6 = 7 + 8, since 11 = 11.</example>\n</note1>\n2. <note2>\n  <description>For a trapezoid with parallel sides of lengths a and b and height h, the area is given by A = (a + b)·h/2. Use this to relate the unknown sides to the given area once the height is known or can be expressed in terms of the sides.</description>\n  <example>In a trapezoid with parallel sides 4 and 6 and height 3, the area is (4 + 6)·3/2 = 15.</example>\n</note2>\n3. <note3>\n  <description>In an isosceles trapezoid with legs of length m and bases of length a and b, drop perpendiculars from the endpoints of the shorter base to the longer base. Each leg splits the trapezoid into a rectangle and two congruent right triangles, each with horizontal leg (b − a)/2 and vertical leg equal to the height h. Thus, h = √[m² − ((b − a)/2)²].</description>\n  <example>For a trapezoid with bases 5 and 11 and legs of length 10, the horizontal leg of each triangle is (11 − 5)/2 = 3, so the height is h = √(10² − 3²) = √71.</example>\n</note3>\n4. <note4>\n  <description>In a tangential trapezoid (and more generally in a tangential quadrilateral), the radius r of the inscribed circle satisfies r = A/s, where A is the area and s is the semiperimeter. This gives a direct relation between the area, side lengths, and radius.</description>\n  <example>If a tangential quadrilateral has area 20 and semiperimeter 10, then the inscribed circle’s radius is r = 20/10 = 2.</example>\n</note4>\n5. <note5>\n  <description>When you have two equations in variables a and b (e.g., from the tangential property and from the area formula), you can square and add them to eliminate the product term. This yields a relation of the form a² + b² = constant, which can be solved directly.</description>\n  <example>Suppose a + b = 10 and a·b = 21. Then (a + b)² = 100 gives a² + 2ab + b² = 100, so a² + b² = 100 − 2·21 = 58.</example>\n</note5>", "1. <note1>\n   <description>  \nIn any tangential quadrilateral (one that has an inscribed circle), the sums of the lengths of opposite sides are equal. For an isosceles trapezoid with top side a and bottom side b, this gives a + b = 2·c, where c is the leg length.  \n</description>\n   <example>  \nIf a tangential isosceles trapezoid has top side a and bottom side b and leg length c, then a + b = 2c. For instance, if a + b = 14, then each leg must be 7.  \n</example>\n</note1>\n2. <note2>\n   <description>  \nFor an isosceles trapezoid with legs of length c and bases of lengths a and b, the height h can be found by dropping perpendiculars to the longer base:  \nh = √(c² – ((b – a)/2)²).  \n</description>\n   <example>  \nSuppose a trapezoid has legs c = 5 and bases a = 4, b = 8. The horizontal distance between the top and bottom bases is (8–4)/2 = 2, so the height is h = √(5² – 2²) = √(25 – 4) = √21.  \n</example>\n</note1>\n3. <note3>\n   <description>  \nThe area A of a trapezoid with bases a and b and height h is A = ((a + b)/2)·h. This formula combines the average of the bases with the altitude.  \n</description>\n   <example>  \nWith bases a = 3, b = 7 and height h = 4, the area is A = ((3 + 7)/2)·4 = 5·4 = 20.  \n</example>\n</note1>\n4. <note4>\n   <description>  \nIn a tangential trapezoid, the radius r of the inscribed circle satisfies r = A/(a + b), where A is the area and a + b is the sum of the bases. This follows from the area being both half the perimeter times r and (a + b)/2 times the height.  \n</description>\n   <example>  \nIf a tangential trapezoid has area A = 30 and base sum a + b = 10, then the inscribed circle’s radius is r = 30/10 = 3.  \n</example>\n</note1>\n5. <note5>\n   <description>  \nFor an isosceles trapezoid with parallel sides a and b and legs c, the sum of the squares of the bases satisfies a² + b² = 2c² + 2h², where h is the height. This follows from expanding (a + b)² and (a – b)² in terms of c and h.  \n</description>\n   <example>  \nGiven c = 5 and h = 4, then a² + b² = 2·5² + 2·4² = 2·25 + 2·16 = 50 + 32 = 82.  \n</example>\n</note1>", "1. <note>\n  <description>For any polygon with an inscribed circle, the sum of the lengths of opposite sides equals the sum of the other pair: a + c = b + d. This holds because each side is tangent to the circle at exactly one point, and tangents from a common external point are equal in length.</description>\n  <example>In a tangential quadrilateral with side lengths a, b, c, d in order, if a = 5 and c = 7, then b + d must equal 12 for the circle to touch all sides.</example>\n</note>\n2. <note>\n  <description>The area A of a trapezoid with parallel sides of lengths r and s and height h is A = (r + s)/2 · h. This formula arises by averaging the two bases and multiplying by the perpendicular distance between them.</description>\n  <example>For a trapezoid with bases 4 and 6 and height 3, the area is (4 + 6)/2 · 3 = 15.</example>\n</note>\n3. <note>\n  <description>In a tangential trapezoid, the height h equals twice the inradius r: h = 2r. This follows because the two legs each form a right triangle with the inradius as one leg and the slant height as the hypotenuse, and summing the two legs gives twice the inradius.</description>\n  <example>With inradius 2, the trapezoid’s height is 4, so the area formula becomes A = (r + s)/2 · 4 = 2(r + s).</example>\n</note>\n4. <note>\n  <description>To find the slant side length ℓ of a tangential trapezoid, use the right triangle formed by the height h, the inradius r, and ℓ: ℓ = √(h² + r²). This derives from the Pythagorean theorem applied to the tangent segments and the height.</description>\n  <example>If h = 4 and r = 3, then each leg length is ℓ = √(4² + 3²) = 5.</example>\n</note>\n5. <note>\n  <description>Compute r² + s² by combining the area formula and the tangential condition: r² + s² = (A/r)² − 2r². Starting from A = (r + s)·2r and squaring gives (r + s)² = A²/r², then r² + s² follows by expanding and simplifying.</description>\n  <example>Given A = 18 and r = 3, we have (r + s)² = 18²/9 = 36, so r + s = 6. Then r² + s² = 36 − 2·9 = 18.</example>\n</note>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 6, "abstractions": ["1.  <note1>\n    <description>When forming pairs from a set of 2n distinct items, the number of ways to choose those pairs is given by the double factorial (2n–1)!! = (2n–1)·(2n–3)·…·1. This counts all possible pairings without regard to order.  \n</description>\n    <example>For 6 items, the number of pairings is (6–1)!! = 5·3·1 = 15.  \n</example>\n  </note1>\n  <note2>\n    <description>To count arrangements where a specific element must be in a particular pair, first fix that element with one other chosen element. The remaining 2n–2 items then pair in (2n–3)!! ways.  \n</description>\n    <example>Given 6 items and a requirement that X is paired with Y, there are (6–3)!! = 3·1 = 3 ways to pair the remaining 4 items.  \n</example>\n  </note2>\n  <note3>\n    <description>When the final ordering (e.g., lexicographic) is determined by pairing, the probability that a desired pair appears last equals the ratio of favorable pairings (where the desired pair is last) to total pairings.  \n</description>\n    <example>With 6 items, there are 15 total pairings. If there are 3 pairings where the pair (X,Y) is last, the probability is 3/15 = 1/5.  \n</example>\n  </note4>\n  <note5>\n    <description>After fixing a specific pair in a given position, the remaining items must be paired arbitrarily. The number of ways to pair n items is (2n–1)!!, so this factor cancels in probability ratios.  \n</description>\n    <example>For 6 items, fixing one pair leaves 4 items to pair in (4–1)!! = 3 ways, which matches the cancellation in the ratio 3/15.  \n</example>\n  </note6>\n  <note7>\n    <description>Always simplify the final probability fraction to lowest terms and ensure the numerator and denominator are coprime before reporting.  \n</description>\n    <example>From 1/5, the fraction is already in lowest terms, so m+n = 1+5 = 6.  \n</example>\n  </note7>", "1. <note1>\n   <description>When pairing n distinct items into n/2 unordered pairs, the total number of ways is (n–1)!! = (n–1)·(n–3)·…·1. This counts all ways to choose pairs sequentially without regard to order.</description>\n   <example>For 4 items, the number of ways to form 2 pairs is (4–1)!! = 3·1 = 3. These pairs correspond to the 3 ways to split 4 distinct objects into unordered pairs.</example>\n</note1>\n2. <note2>\n   <description>To count pairings that include a particular pair (A,B), first fix (A,B) as one pair, then pair the remaining n–2 items: there are (n–3)!! ways. Thus the probability that a random pairing contains (A,B) is [(n–3)!!]/[(n–1)!!].</description>\n   <example>With 6 items, the total pairings are 5!! = 15. To count those containing (X,Y), fix (X,Y), leaving 4 items with 3!! = 3 pairings. So P(including (X,Y)) = 3/15 = 1/5.</example>\n</note1>\n3. <note3>\n   <description>To count pairings where a specific item X is in the last pair (or any fixed position), first pair the other n–1 items in (n–2)!! ways, then couple X with one of the remaining n–1 items. Thus P(X in last pair) = [(n–2)!! · (n–1)]/[(n–1)!!].</description>\n   <example>For 8 items, total pairings = 7!! = 105. To count those where a given X is in the last pair, pair the other 7 items in 6!! = 42 ways, then choose its partner in 7 ways. Total favorable = 42·7 = 294, so P = 294/105 = 2/5.</example>\n</note1>\n4. <note4>\n   <description>When ordering pairs alphabetically and extracting the last word, focus on the item's partner rather than its position. The probability that the last word contains a given item X equals the probability that X’s partner appears in some pre-specified set (e.g., last positions).</description>\n   <example>In a random pairing of 10 items, to find P(last word contains Z), first note Z’s partner is equally likely to be any of the other 9 items. If among those 9 there are 3 that would make Z’s partner the last pair’s partner, then P = 3/9 = 1/3.</example>\n</note1>\n5. <note5>\n   <description>After computing probabilities via combinatorial counts, simplify the resulting fraction and ensure numerator and denominator are coprime. Use the Euclidean algorithm or prime factorization to find the greatest common divisor and cancel it.</description>\n   <example>If a count yields 12/18, compute gcd(12,18)=6, then simplify to 2/3. Always reduce final probabilities to lowest terms before interpreting or summing.</example>\n</note1>", "1. <note>\n  <description>When forming r pairs from n distinct items without regard to order, the total number of ways is the double factorial (n−1)!! = ∏_{k=1}^r (2k−1). This counts all unlabeled pairings.</description>\n  <example>For n=5, there are (5−1)!! = 3·1 = 3 ways to pair 5 items into 2 pairs (e.g. {A,B,C,D,E} → {{A,B},{C,D},E}, etc.).</example>\n</note>\n2. <note>\n  <description>To count pairings in which a specific pair {X,Y} is adjacent (or contains a given element), fix that pair as a block. Then count pairings of the remaining n−2 items, which is (n−3)!!. This gives the favorable count directly.</description>\n  <example>With n=7 and block {X,Y}, pairings are (7−3)!! = 3·1 = 3. Each corresponds to a unique pairing including the block {X,Y}.</example>\n</note>\n3. <note>\n  <description>When the final order of pairs matters (e.g. sorted alphabetically), each pairing corresponds to exactly one ordering. Thus the probability of a condition on the last pair equals (favorable pairings)/(total pairings).</description>\n  <example>For n=6, total = (6−1)!! = 5·3·1 = 15. If exactly 3 pairings put the last pair in its desired form, the probability is 3/15 = 1/5.</example>\n</note>\n4. <note>\n  <description>Always simplify the ratio of factorials or double factorials to lowest terms. Use gcd(m,n) to reduce m/n and avoid large denominators.</description>\n  <example>If you obtain 4/12, compute gcd(4,12)=4 to get 1/3. Likewise, 15/21 → gcd(15,21)=3 → 5/7.</example>\n</note>\n5. <note>\n  <description>After finding a probability m/n in lowest terms, compute the final answer by adding m and n. This is common in problems asking for m+n.</description>\n  <example>If the probability is 2/7, then m+n = 2+7 = 9.</example>\n</note>", "1. <note1>\n  <description>When pairing N distinct items into N/2 unordered pairs, the total number of ways is ( (2N)! / (2^(N) * N! ) ). This counts all possible pairings without regard to order within or between pairs.</description>\n  <example>For 4 items, the count is (4!)/(2^2*2!) = (24)/(4*2) = 3, matching the three possible pairings of {A,B,C,D}.</example>\n</note1>\n2. <note2>\n  <description>To count pairings where a specific pair {x,y} is forced, first treat that pair as one “super-item,” then count pairings of the remaining N–1 items: ( (2(N–1))! / (2^(N–1)*(N–1)!) ).</description>\n  <example>With 5 items and the forced pair {x,y}, reduce to 4 items: (4!)/(2^2*2!) = 3 pairings of the remaining items.</example>\n</note3>\n3. <note3>\n  <description>When counting pairings where a specific item x must appear alone, treat x as one “super-item” and the other N–1 items as N–1 regular items. The count is ( (2(N–1))! / (2^(N–1)*(N–1)!) ).</description>\n  <example>For 6 items with x isolated, count pairings of the other 5 items: (5!)/(2^3*3!) = 5.</example>\n</note4>\n4. <note4>\n  <description>Use the complement principle: to find the probability that a condition fails, count all pairings where it does not hold and divide by the total pairings. Then subtract from 1 to get the desired probability.</description>\n  <example>For 4 items, total pairings = 3. If a specific pair is not forced, count those and divide by 3; if that count is 2, then the probability it is forced is 1 – (2/3) = 1/3.</example>\n</note5>\n5. <note5>\n  <description>When ordering the list of words formed by each pair (e.g. alphabetically), only the overall ordering of pairs matters. Thus, the sequence of resulting words is determined by the pairing order, not by individual pair orderings.</description>\n  <example>If you pair {A,B},{C,D} and then alphabetically order the words, the list is alphabetically sorted by pairs, not by the internal order of A,B vs. B,A.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 7, "abstractions": ["1. <note1>\n  <description>\nAn equation of the form |w – w₀| = R describes all points at distance R from the point w₀, forming a circle in the complex plane. Recognizing this lets you convert absolute-value constraints into geometric circles.\n</description>\n  <example>\nFor |z – (a + bi)| = R, rewrite as (x – a)² + (y – b)² = R², a circle centered at (a, b) with radius R.\n</example>\n</note1>\n2. <note2>\n  <description>\nThe locus |z – z₁| = |z – z₂| is the perpendicular bisector of the segment joining z₁ and z₂. This line consists of all points equidistant from the two given points.\n</description>\n  <example>\nIf |z – z₁| = |z – z₂|, then the set of solutions is the line through the midpoint of z₁ and z₂ with slope perpendicular to the segment z₁z₂.\n</example>\n</note3>\n3. <note3>\n  <description>\nTo find where a circle intersects a line, substitute the line’s equation into the circle’s equation, yielding a quadratic in one variable. The number of real solutions equals the number of intersection points.\n</description>\n  <example>\nGiven (x – a)² + (y – b)² = R² and y = m x + c, substitute to get (x – a)² + (m x + c – b)² = R². Solve for x; real solutions correspond to intersection points.\n</example>\n</note4>\n4. <note4>\n  <description>\nA quadratic A x² + B x + C = 0 has exactly one real root when its discriminant B² – 4AC = 0. Use this to enforce tangency between a circle and a line.\n</description>\n  <example>\nFrom the substitution you obtain a quadratic in x. Set its discriminant to zero and solve for the parameter in the line equation to find the tangency condition.\n</example>\n</note5>\n5. <note5>\n  <description>\nWhen a parameter yields tangency, the line touches the circle at exactly one point. This guarantees a unique solution to the original system of equations.\n</description>\n  <example>\nIf solving for k in |z – z₁| = R and |z – z₂| = |z – z₃| leads to B² – 4AC = 0 in the resulting quadratic, then there is exactly one intersection, yielding one complex solution z.\n</example>\n</note6>", "1. <note>\n  <description>Complex modulus equations of the form |z – a| = r represent circles in the complex plane centered at a with radius r. Converting to real coordinates (x, y) by z = x + iy yields x² + y² – 2Re(a)·x – 2Im(a)·y + |a|² – r² = 0.</description>\n  <example>Given |z – (3 + 4i)| = 5, write (x – 3)² + (y – 4)² = 25, a circle centered at (3,4) with radius 5.</example>\n</note>\n2. <note>\n  <description>Equations of the form |z – a| = |z – b| represent the perpendicular bisector of the segment joining a and b in the complex plane. In real coordinates, this is the line through the midpoint of a and b with direction perpendicular to a – b.</description>\n  <example>For |z – (1 + 0i)| = |z – (0 + 2i)|, the midpoint is (0.5,1), and the direction is perpendicular to (–1,2), yielding the line y – 1 = (1/2)(x – 0.5).</example>\n</note>\n3. <note>\n  <description>A system of two circles (from modulus equations) has exactly one solution if and only if the distance between their centers equals the sum or difference of their radii. This corresponds to tangency of the circles.</description>\n  <example>Circle1: center (0,0), radius 3; Circle2: center (4,0), radius 1. Distance = 4 = 3 + 1, so they are externally tangent and meet at exactly one point.</example>\n</note>\n4. <note>\n  <description>Introduce a parameter in one modulus equation and derive a locus (e.g., a line or circle) that depends on it. Then impose the tangency condition (distance between centers = sum/difference of radii) to find the parameter values.</description>\n  <example>Let |z – (1 + ki)| = 3 represent a circle whose center moves along y = k with fixed radius. Intersect with a fixed circle |z – (0,0)| = 5. Tangency occurs when the distance between centers equals 5 ± 3, giving equations in k.</example>\n</note>\n5. <note>\n  <description>After solving for the parameter, verify that each solution yields exactly one intersection point by checking tangency (distance = sum/difference) and that no extraneous solutions arise from squaring or line–circle intersections.</description>\n  <example>Solving k² + 1 = 4 gives k = ±√3. Each k makes the two circles tangent, so exactly one solution exists for each k, and no other intersections occur.</example>", "3556440000857000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000", "3. Use the locus definition of |z–a|: an equation |z–a|=r describes a circle centered at a with radius r, so you can rewrite complex equations as circle equations.4. Geometric locus intersection: the intersection of two loci often has one solution when the circle from one equation is tangent to the line or circle from the other.5. Tangency condition: for two circles with centers C₁,C₂ and radii r₁,r₂, tangency occurs when |C₁C₂|=|r₁±r₂|, which yields a linear equation in the parameters."], "abstractions_meta": [[true, false], [true, false], [false, true], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 8, "abstractions": ["1. <note>\n  <description>Under a counterclockwise rotation by angle θ, any point (x, y) maps to (x′, y′) satisfying x′ = x·cosθ − y·sinθ, y′ = x·sinθ + y·cosθ. Use these formulas to convert coordinates of any curve or point rotated about the origin.</description>\n  <example>For a point (x, y) and θ = 30°, compute x′ = x·(√3/2) − y·(1/2), y′ = x·(1/2) + y·(√3/2) to obtain its rotated position.</example>\n</note>\n2. <note>\n  <description>To rotate a curve, substitute x′ = x·cosθ − y·sinθ and y′ = x·sinθ + y·cosθ into the original equation, then solve for y′ in terms of x′. This yields an explicit equation for the rotated image.</description>\n  <example>Given y = f(x), set x′ = x·cosθ − y·sinθ and y′ = x·sinθ + y·cosθ. Solve the resulting system to express y′ as a function of x′, giving the rotated parabola’s equation.</example>\n</note>\n3. <note>\n  <description>Find intersection points of two curves by equating their y-expressions in terms of x (or vice versa). This reduces the problem to solving a single-variable equation, often a polynomial.</description>\n  <example>Suppose Curve1: y = g(x) and Curve2: y = h(x). Set g(x) = h(x), then solve the resulting polynomial to find the x-coordinates of intersection points.</example>\n</note>\n4. <note>\n  <description>When solving a quadratic equation ax² + bx + c = 0, the discriminant Δ = b² − 4ac determines the nature of roots. If Δ is not a perfect square, roots are irrational and can be expressed via √Δ.</description>\n  <example>For 2x² + 5x + 1 = 0, compute Δ = 25 − 8 = 17. Then x = [−5 ± √17]/4, yielding two distinct irrational roots.</example>\n</note>\n5. <note>\n  <description>To enforce a point’s location in a specific quadrant (e.g., fourth quadrant), impose the sign conditions x &gt; 0 and y &lt; 0. After finding all intersection candidates, select the one satisfying these inequalities.</description>\n  <example>Suppose intersection candidates are x1, x2 and their corresponding y-values y1, y2. If x1 &gt; 0 and y1 &lt; 0, choose that point as the valid intersection in the fourth quadrant.</example>", "1. <note>\n  <description>Apply the 2D rotation transformation R(θ)=[cos θ −sin θ; sin θ cos θ] to a point (x,y) to obtain (x′,y′). This converts each point on a curve into its rotated image.</description>\n  <example>For θ=30°, R(30°)=[√3/2 −1/2; 1/2 √3/2]. A point (1,0) maps to (1·√3/2−0, 1·1/2+0)=(√3/2,1/2).</example>\n</note>\n2. <note>\n  <description>Substitute the rotated coordinates x′=x cos θ − y sin θ and y′=x sin θ + y cos θ into the original curve’s equation to get the rotated curve’s implicit form.</description>\n  <example>Starting from y=x²−4, with θ=30° and cos30°=√3/2, sin30°=1/2, substitute to obtain y′=(x′(2/√3)+y′(1/√3))²−4.</example>\n</note>\n3. <note>\n  <description>Use the determinant formula for two implicit curves F(x,y)=0 and G(x,y)=0: x = (det([∂F/∂x, ∂G/∂x]; [F, G]))/det([∂F/∂x, ∂F/∂y]; [∂G/∂x, ∂G/∂y]), y similarly. This yields a system of two equations in x,y.</description>\n  <example>For F(x,y)=y−x²+4 and G(x,y)=y′−(x′²−4), compute partials and set up the 2×2 determinant system to solve for x and y in terms of the rotated variables.</example>\n</note>\n4. <note>\n  <description>When the intersection’s y-coordinate appears as a radical of the form (A−√B)/C, rationalize by multiplying numerator and denominator by (A+√B) to obtain (A²−B)/C. This expresses the radical in a standard “a−√b” form.</description>\n  <example>Given y=(5−√7)/3, multiply by (5+√7)/3 to get (25−7)/9=18/9=2; thus the radicalized form is (5²−7)/3=(25−7)/3=(18)/3=6/3=2, which confirms the radical form.</example>\n</note>\n5. <note>\n  <description>Enforce quadrant constraints by checking sign conditions on x and y. For the fourth quadrant, x&gt;0 and y&lt;0, to ensure the solution lies in the correct region.</description>\n  <example>If the intersection yields x=1 and y=(2−√3)/3, check y is negative: 2−√3≈2−1.732=0.268&gt;0, so it lies in the first quadrant. Adjust the parameter or initial conditions to make y negative.</example>\n</note>", "1. <note1>\n  <description>Apply the 2D rotation matrix to each point: for rotation by θ, use R(θ)=[(cos θ,−sin θ),(sin θ,cos θ)]. Multiply this by the point’s coordinates to obtain the rotated image.</description>\n  <example>Given a point (x,y), for θ=45°, compute x′=x·cos45°−y·sin45° and y′=x·sin45°+y·cos45° to find its new location.</example>\n</note1>\n2. <note2>\n  <description>Express a rotated curve by substituting x′=x·cos θ−y·sin θ and y′=x·sin θ+y·cos θ into its original equation, then simplify to obtain the new curve’s equation in (x,y).</description>\n  <example>For the circle x²+y²=1 rotated by θ, substitute x=x′cosθ+y′sinθ and y=−x′sinθ+y′cosθ, yielding a new equation in x′,y′ that describes the rotated circle.</example>\n</note3>\n3. <note3>\n  <description>Find intersections of two curves by substituting one equation into the other, yielding a single-variable polynomial. Solve this polynomial via factoring or the quadratic formula.</description>\n  <example>To intersect y=x²−1 with y=−x+2, set x²−1=−x+2, rearrange to x²+x−3=0, then apply the quadratic formula to find x.</example>\n</note4>\n4. <note4>\n  <description>When solving a quadratic ax²+bx+c=0, use the discriminant D=b²−4ac to determine the nature of roots. If D is positive, there are two real roots; if D is a perfect square, roots are rational; otherwise, roots may be irrational.</description>\n  <example>For 2x²−3x+1=0, compute D=9−8=1, which is a perfect square, so x=[3±1]/4 yields rational roots 1 and ½.</example>\n</note5>\n5. <note5>\n  <description>After obtaining a root in the form (A±√B)/C, identify the quadrant of the original point and choose the sign that places the solution in the desired quadrant.</description>\n  <example>If a rotated curve intersects the x-axis at x=(5±√7)/3 and the problem asks for the intersection in the fourth quadrant, select the negative sign so x is negative.</example>", "1. <note>\n  <description>Rotation of a point (x,y) by angle θ around the origin maps to (x′,y′) via x′=x cos θ − y sin θ, y′=x sin θ + y cos θ. Use this to express the rotated curve’s equation in terms of the original coordinates.</description>\n  <example>Given P=(x,y) and θ, compute x′=x cos θ − y sin θ, y′=x sin θ + y cos θ. Then substitute these into the original curve’s equation to derive the new curve’s equation.</example>\n</note>\n2. <note>\n  <description>To find intersections of two curves, set their equations equal and solve the resulting system. For rotated and original curves, this yields an equation in x and y (or one variable) that you must solve carefully.</description>\n  <example>Equations: F(x,y)=0 and G(x′,y′)=0 with x′,y′ from rotation formulas. Substitute into G and set equal to F to get one equation in x,y. Solve that equation to find intersection points.</example>\n</note>\n3. <note>\n  <description>When solving a quadratic in one variable, apply the quadratic formula x=[−B±√(B²−4AC)]/(2A). Check the discriminant for nonnegativity and simplify radicals as much as possible.</description>\n  <example>From an equation of form A·x² + B·x + C=0, compute the discriminant Δ=B²−4AC. Then x=(−B±√Δ)/(2A), simplifying √Δ if it factors into a perfect square times a radical.</example>\n</note>\n4. <note>\n  <description>Use Vieta’s formulas for the sum and product of roots of a quadratic a·x² + b·x + c=0: sum=−b/a, product=c/a. This can eliminate one root when you know the other or one of the roots.</description>\n  <example>If the two roots are x₁ and x₂ of a·x² + b·x + c=0, then x₁ + x₂ = −b/a and x₁·x₂ = c/a. If you know one root, find the other by x₂ = (−b/a) − x₁ or x₂ = c/(a·x₁).</example>\n</note>\n5. <note>\n  <description>After finding a candidate solution, verify it lies in the required region (e.g., fourth quadrant) by checking signs of x and y. Discard any that fail the region constraints.</description>\n  <example>Given a solution (x,y), check x&gt;0 and y&lt;0. If either condition is violated, reject that solution and accept the other valid one.</example>\n</note>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 9, "abstractions": ["<note1>\n  <description>When filling a grid with distinct symbols, each placement reduces the number of remaining choices by one. The total number of ways to fill an n×m grid with distinct entries is n!^m. More generally, if you have k distinct symbols per row and r rows, the count is (k!)^r.</description>\n  <example>For a 2×3 grid with 4 distinct symbols, each row must use all 4. The first row has 4! ways, the second also 4! ways, so total = (4!)^2 = 576.</example>\n</note1>\n<note2>\n  <description>Apply a backtracking algorithm: place one symbol at a time, enforce all local constraints, and backtrack when a placement violates any rule. This systematically explores valid configurations without overcounting.</description>\n  <example>Place symbol A in cell (1,1). Propagate constraints and try placing B in (1,2), etc. If a conflict arises (e.g., B already exists in a block), backtrack to (1,1) and try the next symbol.</example>\n</note3>\n<note3>\n  <description>Use the multiplication (product) principle: when making a sequence of independent choices, multiply the number of options at each step. This applies when each decision does not affect the count of the others.</description>\n  <example>To fill three slots with distinct colors, pick color1 in 5 ways, color2 in 4 ways, color3 in 3 ways. Total ways = 5×4×3 = 60.</example>\n</note4>\n<note4>\n  <description>Exploit symmetry: many grids are equivalent up to relabeling or reflection. Count distinct equivalence classes under a symmetry group to avoid overcounting.</description>\n  <example>Different Sudoku grids that can be rotated or reflected to match each other count as one. If there are G such symmetries, divide the total count by G.</example>\n</note5>\n<note5>\n  <description>Compute the prime factorization of a large number by repeated division by primes. This is useful when expressing a count in the form p^a·q^b·r^c·s^d for further manipulation.</description>\n  <example>Given N = 216, divide by 2 to get 108, again by 2 to get 54, again by 2 to get 27. Then divide by 3 to get 9, again by 3 to get 3, again by 3 to get 1. So N = 2^3·3^3.</example>", "<note1>\n  <description>\nUse the product rule: when filling an n×m grid with distinct symbols, the total number of ways is n!·m! if each row and column must contain all symbols. This applies when no additional constraints (like blocks) are present.\n</description>\n  <example>\nFor a 3×3 grid with symbols 1–3, each row must be a permutation of {1,2,3}. The first row has 3! ways, the second row has 2! ways (must avoid the first row’s placements), and the third row has 1! way. Total = 3!·2!·1! = 12.\n</example>\n</note1>\n<note2>\n  <description>\nWhen you have r disjoint blocks of size k, each block’s entries are chosen from a set of size N in N! ways, and the choices for each block are independent. Thus the total number of fillings is (N!)^r.\n</description>\n  <example>\nSuppose you have 4 disjoint 2×2 blocks on a grid, and each block must contain the numbers 1–4. Each block has 4! = 24 ways, so total = (4!)^4 = 24^4.\n</example>\n</note3>\n<note3>\n  <description>\nIn a Latin rectangle (an r×c grid filled with N symbols, each row and column contains distinct symbols), the number of fillings is N!·(N–1)!·…·(N–r+1)!. This counts all ways to choose and arrange rows under row-distinctness constraints.\n</description>\n  <example>\nFor a 2×3 Latin rectangle with symbols {1,2,3}, the first row has 3! = 6 ways, and for each choice, the second row has 2! = 2 ways (it must avoid the first row’s entries). Total = 6·2 = 12.\n</example>\n</note4>\n<note4>\n  <description>\nWhen counting fillings that respect both row and column constraints, one often uses backtracking or inclusion-exclusion. Backtracking builds a partial filling row by row and prunes based on column conflicts; inclusion-exclusion corrects overcounting when constraints overlap.\n</description>\n  <example>\nTo count fillings of a 2×2 grid with symbols {1,2}, first try row 1 in 2! = 2 ways. For each, try placing row 2 in the remaining two positions, but prune if it repeats any column symbol. This yields 2 valid fillings.\n</example>\n</note5>\n<note5>\n  <description>\nAfter counting, factor the result into primes and then apply any additional exponents from block or region constraints. The final count is often a product of prime powers reflecting the independent choices in each region.\n</description>\n  <example>\nIf you find a count of 2^3·3^2 for a grid, and you know there are two extra independent regions each contributing an extra factor of 2, multiply by 2^2 to get 2^5·3^2. Then you can report the exponents and primes for further use.\n</example>\n</note6>", "<note1>\n  <description>Use the multiplication principle: when filling a structured grid, multiply the number of choices for each independent cell. If there are r independent positions with n options each, the total is n^r. This applies when choices don’t conflict across positions.</description>\n  <example>In a 2×2 grid where each cell can be one of 4 colors, there are 4·4·4·4 = 4^4 = 256 colorings, since each cell’s color is chosen independently.</example>\n</note1>\n<note2>\n  <description>Partition the grid into disjoint rows or blocks to simplify counting. Compute the number of ways to fill each row or block independently, then multiply across partitions. This reduces a complex global count to product of local counts.</description>\n  <example>For a 3×3 Latin square, count the ways to fill the first row (n! ways), then the second row (n! ways), then the third row (n! ways), giving n!·n!·n! total Latin squares.</example>\n</note3>\n<note4>\n  <description>Account for permutations within fixed rows or blocks by multiplying by k! for each independent set of k cells. If a block or row has k positions and you permute its labels freely, multiply by k! for each such block or row.</description>\n  <example>In a 3×3 grid with 3 rows, each row has 3 cells. If you can permute the 3 labels in that row freely, multiply by 3! for each of the 3 rows, giving an extra factor of (3!)^3.</example>\n</note5>\n<note6>\n  <description>Incorporate additional constraints via complementary counting or inclusion-exclusion: subtract or add counts of configurations that violate the constraint. This is useful when forced choices create conflicts in some regions.</description>\n  <example>To count 3×3 grids using {1,2,3} exactly once per row and per column, start with 3!^3 for permutations, then subtract those violating row constraints by inclusion-exclusion, and similarly for columns.</example>", "<note1>\n  <description>Count permutations of distinct items: the number of ways to assign k distinct items to k positions is k!. This applies when no repetition is allowed and each position must be filled uniquely.</description>\n  <example>Suppose you have 5 distinct symbols and you want to fill 5 slots in a row without repetition. There are 5! = 120 ways to do this.</example>\n</note1>\n<note2>\n  <description>Use the product rule for independent choices: when making a sequence of independent decisions, multiply the number of options at each step. This is fundamental for counting multi-step arrangements.</description>\n  <example>To fill a 3×3 grid row by row, first choose a permutation for the first row (9! ways), then for the second row given the first (remaining 9! ways), and so on. The total is the product of these counts.</example>\n</note3>\n<note3>\n  <description>Partition a grid into disjoint regions (e.g. blocks or rows) and count within each region separately, then multiply the results. This breaks a complex global count into simpler local counts.</description>\n  <example>In a 3×3 subgrid, you can count the ways to fill it by choosing a permutation for each cell independently, then multiply those counts for all subgrids to get the overall count.</example>\n</note4>\n<note4>\n  <description>Account for symmetries by dividing by the size of the symmetry group (Burnside’s lemma). If a configuration remains unchanged under certain transformations, it is counted multiple times and must be corrected.</description>\n  <example>When counting grid fillings up to row or block permutations, divide the raw count by the number of rows or blocks to correct for overcounting due to these permutations.</example>\n</note5>\n<note5>\n  <description>Factor the final count into prime powers to reveal the underlying structure. Expressing the result as a product of prime powers often simplifies further analysis or extraction of specific components.</description>\n  <example>If the total number of fillings is 2^4·3^2·5^1, you can immediately see that the exponents on each prime correspond to the number of times each prime divides the count.</example>\n</note6>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 10, "abstractions": ["住房公积\n  <note1>\n    <description>When a function is periodic with period T, solve the intersection equation within one fundamental interval [a,a+T) and then extend the solutions by adding integer multiples of T. This avoids redundant checks across the entire domain.</description>\n    <example>For f(x) periodic with period 4, solve f(x)=g(x) on [0,4) then list solutions x₀, x₁, x₂ in that interval; the full solutions are x₀+4k and x₁+4k and x₂+4k for all integers k.</example>\n  </note2>\n  <note2>\n    <description>Break a piecewise-defined function into its constituent cases and solve the intersection equation separately on each case’s interval. Ensure you only consider x-values within each case’s domain.</description>\n    <example>Given f(x)={x on [–1,1); 2–x on [1,3)}, to find intersections with h(x)=y, first solve x=y on [–1,1) then solve 2–x=y on [1,3). Each yields a subset of candidate solutions.</example>\n  </note3>\n  <note3>\n    <description>When substituting a quadratic relation x=34y² into a linear equation, obtain a quadratic in y. Use the quadratic formula y=[–b±√(b²–4ac)]/(2a) to find all possible y-values.</description>\n    <example>Substitute x=34y² into 2–x=y to get 34y²+y–2=0. Applying the formula yields two roots y₁ and y₂, each corresponding to a potential intersection point.</example>\n  </note4>\n  <note4>\n    <description>After finding all real roots yᵢ, apply any symmetry or parity properties of the original function to pair or discard duplicates. This helps in reducing the total number of distinct intersection points.</description>\n    <example>If the function f(x) satisfies f(–x)=f(x), then y and –y are equivalent; thus if y₁=√2 emerges, we also include –√2. If the quadratic yields y=0 twice, keep only one.</example>\n  </note5>\n  <note5>\n    <description>When summing roots of a quadratic a y² + b y + c = 0, use Vieta’s formula: the sum of roots is –b/a. This often gives the total of y-coordinates without computing each root explicitly.</description>\n    <example>For 34y² + y – 2 = 0, the sum of roots is –(1)/34 = –1/34. Thus the combined y-coordinate of all intersection points is –1/34.</example>", ".symmetricPeriodic\n<translationInvariance>\n<periodicExtend>\n<translationInvariance>\n<translationInvariance>\n<translationInvariance>", "1. <note>\n  <description>For a periodic function f with period T, reducing any argument x to its equivalent in the fundamental interval [L, L+T) simplifies analysis. Compute x mod T and adjust by adding integer multiples of T to ensure x lies in the correct piece. This avoids evaluating f at points outside its defined segments.</description>\n  <example>Let f be periodic of period T and defined on [L, L+T). To find f at x, compute r = x − ⌊(x−L)/T⌋·T so that r ∈ [L, L+T). Then f(x) = f(r).</example>\n</note>\n2. <note>\n  <description>When a curve x = g(y) intersects a piecewise-linear periodic curve f(x), substitute x = g(y) into each piecewise definition of f, yielding equations of the form h(y) = g(y). Solve each equation within the y-interval where the piece applies, then back-substitute to find x.</description>\n  <example>Suppose f(x) = {x on [0,1), 2−x on [1,2)} and x = g(y). For y in the first piece’s domain, set y = g(y) and solve. For y in the second piece’s domain, set 2−y = g(y) and solve separately.</example>\n</note>\n3. <note>\n  <description>Each solution of h(y) = g(y) corresponds to a point of intersection. Summing these y-values often yields a rational or irrational expression. Ensure you include only those y-values that lie within the active piece’s domain at that step.</description>\n  <example>From y = g(y) one finds y₁ and y₂ valid in the first piece; from 2−y = g(y) one finds y₃ and y₄ valid in the second piece. The total sum is y₁ + y₂ + y₃ + y₄, which may simplify to a rational or radical form.</example>\n</note>\n4. <description>For rational expressions with radicals, use the quadratic formula to solve for y. The sum of roots of ay² + by + c = 0 is −b/a, and the product is c/a. Use Vieta’s formulas to combine solutions without solving each quadratic individually.</description>\n  <example>Given ay² + by + c = 0 from one piece, its roots y₁ + y₂ = −b/a. If another quadratic yields roots y₃ + y₄ = −b′/a′, then the total sum is −b/a − b′/a′. Simplify the combined fraction to lowest terms.</example>\n</note>\n5. <description>After obtaining an expression in the form (a + b√c)/d, reduce it to simplest form by dividing numerator and denominator by their greatest common divisor. Ensure c is square-free and that any common factor is removed.</description>\n  <example>If a sum of roots is (10 + 6√5)/4, divide numerator and denominator by 2 to get (5 + 3√5)/2, which is in simplest form with square-free radicand under the radical.</example>", "'<%= XML %>\n<notes>\n  <note1>\n    <description>Decompose a piecewise periodic function by identifying its fundamental interval(s) and the corresponding expression(s). This clarifies the domain on which each formula applies.</description>\n    <example>For f(x)=x on [0,1) and f(x)=2−x on [1,2), express f(x) in terms of the integer part k=[x] and fractional part t=x−k, so f(x)=x for k even and f(x)=2−x for k odd.</example>\n  </note2>\n  <note2>\n    <description>Find intersections between a curve and a piecewise function by substituting the curve’s equation into each piece’s expression and solving for the variable(s). Each substitution yields a subproblem within the piece’s domain.</description>\n    <example>To intersect y=√x with f(x)=x on [0,1), substitute y=√x into x to get x=√x, solving x(x−1)=0 gives x=0 or x=1, but only x=0 lies in [0,1).</example>\n  </note3>\n  <note3>\n    <description>When the resulting equation is quadratic, apply the quadratic formula x=[−B±√(B²−4AC)]/(2A) to find all possible solutions. Then enforce domain constraints to discard extraneous roots.</description>\n    <example>Solving y²+2y−3=0 gives y=[−2±√(4+12)]/2=[−2±4]/2, so y=1 or y=−3. If the context demands |y|≤1, only y=1 is valid.</example>\n  </note4>\n  <note4>\n    <description>Use the periodicity of the piecewise function to generate all intersection points: add or subtract the period to each solution within one fundamental interval. This captures all intersections without extra computation.</description>\n    <example>For f(x) periodic with period 2, if y₀ is a solution in [0,1), then y₀+2k is also a solution for any integer k, giving the full set {y₀+2k}.</example>\n  </note5>\n  <note5>\n    <description>To sum solutions expressed in the form (A±√B)/C, group like terms and simplify: the sum is (2A)/C. Ensure A, B, C are reduced and B is squarefree to present the result in simplest radical form.</description>\n    <example>Summing (3+√5)/4 + (3−√5)/4 yields (6)/4=3/2, which is already in simplest radical form since √5 is squarefree.</example>\n  </note6>\n</notes>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 11, "abstractions": ["1. <note>\n  <description>Use the identity a² – b² = (a – b)(a + b) to factor differences of squares. This is essential when inequalities involve cross-products like xy, yz, zx. By rewriting each term as a difference of squares, you can compare or factor expressions systematically.</description>\n  <example>Given the inequality x² – yz² &gt; 0, rewrite it as (x – y)(x + y) + z(x – y) &gt; 0, then factor (x – y)(x + y + z) &gt; 0. This reveals separate sign conditions on (x – y) and (x + y + z).</example>\n</note>\n2. <note>\n  <description>When you have a chain of ordered expressions like U &gt; V &gt; W, solve each pair of inequalities V &gt; W and U &gt; V separately to obtain intervals for each variable. The intersection of these intervals gives the feasible region.</description>\n  <example>For U = x + y, V = y – zx, W = z – xy with U &gt; V &gt; W, first solve V &gt; W ⇒ y – zx &gt; z – xy ⇒ (y – z)(1 – x) &gt; 0, then solve U &gt; V ⇒ x + y &gt; y – zx ⇒ x(1 + z) &gt; 0. Combine these to find x and y intervals.</example>\n</note>\n3. <note>\n  <description>Translate the geometric constraint x + y + z = constant into a plane equation and intersect it with the region defined by inequalities. The intersection is a convex polygon or polyhedron whose area/volume can be found by sectioning or projection.</description>\n  <example>Intersect the plane x + y + z = 10 with the region determined by x &gt; y, y &gt; z, z &gt; 0. The intersection is a triangular prism cross-section; project onto a coordinate plane to find its area via base×height divided by 2.</example>\n</note>\n4. <note>\n  <description>Find the area of a convex region by decomposing it into simpler shapes (triangles, rectangles) or by using the shoelace formula for polygonal boundaries. Ensure the vertices are ordered consistently to get the correct sign.</description>\n  <example>For a triangle with vertices A(0,0), B(4,0), C(1,3), the area is ½|x_A(y_B–y_C)+x_B(y_C–y_A)+x_C(y_A–y_B)| = ½|0·(0–3)+4·(3–0)+1·(0–0)| = 6.</example>\n</note>\n5. <note>\n  <description>When a final area is expressed as A√B, factor B into its prime components and remove any perfect-square factors to ensure B is square-free. This yields the simplest radical form and is required for many contest answers.</description>\n  <example>Given 18√8, factor 8 = 2²·2, so √8 = 2√2. Then 18√8 = 18·2√2 = 36√2, and since 2 is square-free, the simplified form is 36√2.</example>", "1.  \n  <description>  \nWhen an inequality of the form “sum of cyclic terms” is bounded in a plane, substitute the plane equation into the cyclic terms to reduce it to a 2D inequality. This often simplifies the region to a familiar shape in the remaining two variables.  \n</description>  \n  <example>  \nSuppose points satisfy x+y+z=K and the inequality x–yz < y–zx < z–xy. Substitute z=K–x–y into each cyclic term to get a 2D inequality in x and y. For instance, x–yz becomes x–y(K–x–y)=x–Ky+xy+y².  \n</example>", "1. <note1>\n  <description>Use the cyclic inequality pattern A = x − yz, B = y − zx, C = z − xy to derive symmetric expressions. Summing and subtracting these cyclically often yields identities like A + B + C = x + y + z − (xy + yz + zx) or product relations among A, B, C.</description>\n  <example>For x, y, z = 1, 2, 3, compute A = 1−6 = −5, B = 2−3 = −1, C = 3−2 = 1. Then A + B + C = −5, and also x + y + z = 6 while xy + yz + zx = 1·2 + 2·3 + 3·1 = 11, so −5 = 6 − 11.</example>\n</note1>\n 2. <note2>\n  <description>Apply the plane condition x + y + z = constant to eliminate one variable. Substituting z = C − x − y reduces three-variable constraints to two variables, simplifying region descriptions and area computations.</description>\n  <example>Given x + y + z = 10, set z = 10 − x − y. Then any inequality in x, y, z becomes an inequality in x, y alone. For instance, x − yz < y − zx becomes x − y(10−x−y) < y − (10−x−y)x, which is now in x, y only.</example>\n</note3>\n 3. <note3>\n  <description>Interpret the region defined by the inequalities as a convex polygon in the (x,y)-plane. Compute its area by decomposing it into simpler polygons (triangles, trapezoids) or by using the shoelace formula. Ensure vertices lie on given lines or curves.</description>\n  <example>A region bounded by x ≥ 0, y ≥ 0, and x + y ≤ 4 is a right triangle with area = (4·4)/2 = 8. If the inequalities are more complex, find intersection points of boundary lines to list vertices and apply the shoelace method.</example>\n</note4>\n 4. <note4>\n  <description>Parameterize the finite region using a single parameter t that runs over a closed interval. Express x and y in terms of t, then integrate |dx ∧ dy| = |dx·dy| over t to compute area. This avoids manual vertex listing when boundaries are smooth curves.</description>\n  <example>For x = t, y = f(t) on t∈[0,1], compute area = ∫₀¹ |1·f′(t) − f(t)·0| dt = ∫₀¹ |f′(t)| dt. If f(t)=t², area = ∫₀¹ 2t dt = 1.</example>\n</note5>\n 5. <note5>\n  <description>Check for symmetry in the problem to identify which region has finite area. Often only one of the disjoint regions is bounded, while others extend to infinity. Use symmetry arguments to focus on the finite case without redundant work.</description>\n  <example>For a cyclic inequality in x, y, z symmetric under cyclic permutation, one can test a small symmetric subcase (e.g., x = y) to see which region is bounded. Then generalize to the full finite region by symmetry.</example>", "1. <note1>\n  <description>When a problem specifies “points in the plane” with coordinate relations, substitute the plane equation into the inequalities to reduce to a single-variable inequality in one of the variables. This often turns a 3D problem into a 2D one by fixing one coordinate.</description>\n  <example>Given points in the plane x+y+z=75 satisfying x−yz<y−zx, substitute z=75−x−y to rewrite the inequality in terms of x and y only, then solve for y as a function of x.</example>\n</note1>\n2. <note2>\n  <description>Break the finite region into convex pieces by identifying where each inequality “turns” (becomes an equality). These boundary conditions split the feasible region into polygonal or polyhedral regions that can be handled separately.</description>\n  <example>From x−yz<y−zx, set x−yz=y−zx to find the boundary curve. Repeat for the other inequality to get all intersection curves, then classify each region as “inside” or “outside” each curve.</example>\n</note3>\n3. <note3>\n  <description>Use standard area formulas for convex polygons: for a triangle with side lengths a,b,c, area=√[s(s−a)(s−b)(s−c)] with s=(a+b+c)/2; for a triangle with two sides a,b and included angle γ, area=½ab·sin γ.</description>\n  <example>After finding side lengths of a triangle region, compute its area as √[s(s−a)(s−b)(s−c)]. If an angle is known, use ½ab·sin γ directly.</example>\n</note4>\n4. <note4>\n  <description>When the region is bounded by lines and a circle, partition it into a triangle and a circular segment. Compute each area separately and sum them.</description>\n  <example>For a region bounded by a circle and two radii, first find the area of the triangle formed by the radii and the chord, then compute the circular segment area using ½r²(θ−sin θ), where θ is the central angle.</example>\n</note5>\n5. <note5>\n  <description>After computing an area in radical form, factor out the largest perfect square and simplify. Express the result as a√b with b squarefree to meet standard form requirements.</description>\n  <example>If the computed area is 72√3, factor 72=36·2 to get 36√3, then simplify to 6√3 in the form a√b with b=3.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 12, "abstractions": ["1. <note1>\n  <description>\n  Use the line addition formula: for n lines in general position in a plane, the maximum number of regions is R(n)=n(n+1)/2+1. It counts intersections of every pair of lines and adds one region for the unbounded piece.\n  </description>\n  <example>\n  For n=3 lines in general position, R(3)=3·4/2+1=7. If you draw 3 lines that all meet without three concurred, you get 7 regions.\n  </example>\n</note1>\n2. <note2>\n  <description>\n  Count new regions per segment: a new segment contributes +1 region for each intersection with existing segments, plus +1 for splitting the unbounded region. So if it meets k existing lines, it adds k+1 regions.\n  </description>\n  <example>\n  With 2 existing lines, a new segment can meet both lines (k=2), so it adds 3 regions. Thus R(3)=R(2)+3=4+3=7.\n  </example>\n</note2>\n3. <note3>\n  <description>\n  Expected intersections: if lines are drawn uniformly at random, the probability two segments intersect inside the disk is 1/3 (from crossing chords in a circle). Thus the expected number of intersections among n segments is n(n−1)/6.\n  </description>\n  <example>\n  For n=4 random segments, E(intersections)=4·3/6=2. On average, two segments cross exactly twice in the interior.\n  </example>\n</note3>\n4. <note4>\n  <description>\n  Linearity of expectation: the expected total regions is the sum over segments of (1 + E(intersections with existing segments)). Since each pair contributes 1/3 intersection on average, use linearity to avoid covariance issues.\n  </description>\n  <example>\n  For n=5 segments, expected regions = 5 + 5·4/6 + 4·3/6 + 3·2/6 + 2·1/6 = 5 + 20/6 + 12/6 + 6/6 + 2/6 = 5 + 4.666… ≈ 9.666.\n  </example>\n</note4>\n5. <note5>\n  <description>\n  General-position assumption: to apply formulas, assume no two segments coincide and no three meet at a single interior point. In random models, these events have probability zero.\n  </description>\n  <example>\n  When drawing 10 random chords, the chance that two chords align or three collinear is negligible, so the line addition formula holds exactly.\n  </example>\n</note5>", "1. <note1>\n  <description>  \nIn a disk (or plane), each new line through the center splits existing regions into two parts. By induction, the nth central line divides the disk into n + 1 regions.  \n</description>\n  <example>  \nWith 1 line, the disk is split into 2 regions. With 2 lines, each new line adds 1 region, giving 3. With 3 lines, each adds 1, giving 4, etc.  \n</example>\n</note1>\n2. <note2>\n  <description>  \nWhen a line is drawn between two random points on a circle, the number of times it crosses previous lines equals the number of previous lines whose endpoints lie on opposite sides of the new line’s chord. If k lines and m endpoints on each side, the probability of exactly i crossings is C(m, i)·C(m, k–i)/(C(2m, k)).  \n</description>\n  <example>  \nFor 4 endpoints in two quadrants and 2 previous lines, the probability of 1 crossing is C(4,1)·C(4,1)/C(8,2)=4·4/28=16/28≈0.57, and 0 crossings is C(4,0)·C(4,2)/C(8,2)=6/28≈0.21.  \n</example>\n</note2>\n3. <note3>\n  <description>  \nIn general, a new random chord across a circle crosses exactly k previous lines with probability  \nP(k)=∑_{i=0}^k [C(p_i, i)·C(p_{i+1}, k–i)]/[C(p_0 + p_1, k)],  \nwhere p_i is the number of endpoints on side i of the new chord.  \n</description>\n  <example>  \nIf 3 endpoints on each side of a new chord and 5 previous chords, the probability of 2 crossings is [C(3,2)C(3,0)+C(3,1)C(3,1)+C(3,0)C(3,2)]/C(6,5)= (3·1+3·3+1·3)/6= (3+9+3)/6=15/6=2.5; normalization would require summing all k.  \n</example>\n</note3>\n4. <note4>\n  <description>  \nTo find the expected number of crossings for a single chord, compute  \nE[crossings]=∑_{k=0}^k k·P(k).  \nThis weighted average gives the average number of intersections the chord makes with existing lines.  \n</description>\n  <example>  \nFor 3 endpoints on each side and 5 previous chords, compute P(0), P(1), P(2), P(3), then E=crossings=P(1)+2P(2)+3P(3).  \n</example>\n</note4>\n5. <note5>\n  <description>  \nThe total expected number of regions R after n random line segments in a disk is  \nR = n + 1 + ∑_{i=1}^n E[crossings_i],  \nwhere E[crossings_i] is the expected crossings of the ith line.  \n</description>\n  <example>  \nIf 3 lines each have expected crossings 0.5, 1.0, and 1.5, then R=1+3+0.5+1.0+1.5=7 regions.  \n</example>\n</note5>", "1.  \n  <note1>\n    <description>\nExpected number of regions in a disk partitioned by random chords: For n chords drawn by selecting two random points on the perimeter, the expected number of regions is  \nE = 1 + n + (n(n–1)/2).  \nThis holds regardless of chord endpoints’ positions, as each new chord adds regions in a predictable way.\n</description>\n    <example>\nIf you draw 3 chords, the expected regions are 1 + 3 + (3·2/2) = 1 + 3 + 3 = 7.\n</example>\n  </note1>", "1. <note1>\n  <description>For k lines in general position on a plane, the maximum number of regions is R_max = k(k + 1)/2 + 1.</description>\n  <example>With 4 lines, R_max = 4·5/2 + 1 = 11.</example>\n</note1>\n2. <note2>\n  <description>When each new line intersects all existing lines in general position, it adds exactly k intersections, so it creates k + 1 new regions.</description>\n  <example>Adding the 3rd line to 2 lines yields 2 intersections and thus 3 new regions, increasing total from 4 to 7.</example>\n</note2>\n3. <note3>\n  <description>If lines are not in general position (e.g. two lines coincide), the region-addition rule fails; count intersections and shared segments case by case.</description>\n  <example>Two parallel lines share the same regions on both sides, yielding only k + 1 additional regions instead of 2k + 1.</example>\n</note3>\n4. <note4>\n  <description>To find the expected number of regions when lines are drawn randomly, model each intersection count as a random variable and use linearity of expectation: sum over all pairs the probability they intersect multiplied by 2.</description>\n  <example>For n lines, the expected number of intersections is E = C(n,2)·p, where p is the probability two random lines intersect.</example>\n</note4>\n5. <note5>\n  <description>Always verify that the constructed lines are in general position (no two parallel, no three concurrent) to apply the standard R_max formula; otherwise adjust by counting shared intersections.</description>\n  <example>If three lines meet at a single point, treat them as a single intersection line to avoid overcounting regions.</example>\n</note5>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 13, "abstractions": ["5. <note1>\n  <description>For a convex $k$-gon, the minimal sum of distances from an interior point to its vertices is achieved at the Fermat point (Vogel point), which makes each angle between two edges equal to 60°. Use this when all interior angles are ≤120°.</description>\n  <example>In a triangle with angles 60°, 70°, and 50°, the Fermat point is inside and minimizes the sum of distances to the vertices by ensuring the three connecting segments form 60° angles.</example>\n</note1>\n  <note2>\n  <description>If a triangle has an angle ≥120°, the minimal sum is attained at the vertex with that angle. This is a direct consequence of the Fermat point only existing when all angles are ≤120°.</description>\n  <example>In a triangle with angles 125°, 25°, and 30°, the sum of distances to the opposite vertices is minimized at the 125° vertex, as placing the point elsewhere would increase the total.</example>\n  <pitfall>Always verify angle measures before applying the Fermat-point method.</pitfall>\n</note2>\n  <note3>\n  <description>When two adjacent sides of a polygon meet at a 60° angle, the segment connecting those sides (the “60°-connector”) has length equal to the sum of the two sides: AB + BC when ∠ABC = 60°. This follows from the Law of Cosines: c² = a² + b² – 2ab cos(60°).</description>\n  <example>In triangle ABC with AB = 5, BC = 8, and ∠ABC = 60°, the length of AC is √(5² + 8² – 2·5·8·½) = √(25+64–40) = √49 = 7, which equals 5 + 8 in a degenerate “60°-connector” view.</example>\n  <heuristics>Use this shortcut to quickly compute distances between sides forming a 60° angle.</heuristics>\n</note3>\n  <note4>\n  <description>The sum of distances from a point X to the vertices of a triangle with sides a, b, c and opposite angles A, B, C satisfies: AX + BX + CX = (a + b + c) + (a + b + c)·cos(A + B + C)/2. This generalizes the 60°-connector idea to all triangles.</description>\n  <example>In a triangle with sides 3, 4, 5 and angles 30°, 60°, 90°, the sum of distances from an interior point to the vertices is (3+4+5) + (3+4+5)·cos(180°)/2 = 12 – 12 = 0, which is a degenerate case.</example>\n  <pitfall>Avoid misapplying the formula for non-convex or obtuse configurations.</pitfall>\n</note4>\n  <note5>\n  <description>When a point is the Fermat point of a convex polygon, the minimal total distance can be expressed as the sum of the polygon’s side lengths plus additional terms involving cosines of interior angles. In particular, for pentagons with two 60° angles, the minimal sum is the perimeter plus (sum of the other three sides)·cos(60°).</description>\n  <example>For a convex pentagon with sides 4, 6, 7, 8, 9 and two 60° angles, the minimal sum is (4+6+7+8+9) + (7+8+9)·½ = 34 + 12 = 46.</example>\n  <heuristics>Break the polygon into triangles around the Fermat point to apply the triangle-distance-sum formula.</heuristics>\n</note5>", "400\n<note1>\n  <description>  \nThe sum of distances from a point to several fixed points is minimized when the point lies at the intersection of the perpendicular bisectors of segments joining pairs of those fixed points.  \n</description>\n  <example>  \nGiven three points A, B, C, the point P minimizing PA + PB + PC is the Fermat point, found by constructing equilateral triangles on AB, BC, CA and connecting their outer vertices to the opposite original vertices; their intersection is P.  \n</example>\n</note1>\n<note2>\n  <description>  \nWhen two fixed points form a 60° angle, the equal-distance locus (circle of radius r) and the bisector of the 60° angle are tangent at the unique point equidistant to both.  \n</description>\n  <example>  \nFor points X, Y with ∠XY Z = 60°, the locus of points equidistant from X and Y is a circle centered at the midpoint of XY. Its tangent at the point on the bisector of ∠XY Z gives the unique point P satisfying PX = PY.  \n</example>\n</note1>\n<note3>\n  <description>  \nReflecting a fixed point across a known point or line transforms distance sums into straight-line distances. This often converts a multi-segment sum into a single broken-line path.  \n</description>\n  <example>  \nTo minimize PX + XQ, reflect Q across the known point P to Q′. Then PX + XQ = PX + XQ′, and the minimal X is where the straight line PQ′ meets the segment or line of interest.  \n</example>\n</note1>\n<note4>\n  <description>  \nExpress distances involving a 60° angle in the form a + b√c by using the Law of Cosines or known triangle identities. Simplify radicals by factoring out perfect squares.  \n</description>\n  <example>  \nIn a triangle with sides of length 5 and 7 enclosing a 60° angle, the third side is √(5² + 7² − 2·5·7·cos60°) = √(25 + 49 − 35) = √39.  \n</example>\n</note1>\n<note5>\n  <description>  \nWhen a point is found at the intersection of three loci (e.g., bisectors, circles, lines), compute its exact coordinates or distances via coordinate geometry or by solving simultaneous equations.  \n</description>\n  <example>  \nTo find the intersection of the bisector of ∠ABC and the circle centered at A with radius r, assign coordinates to A, B, C, write the bisector equation, write the circle equation, and solve the two equations for the intersection point.  \n</example>\n</note1>", "1. <note id=\"sum-of-distances\">  \n  <description>For any point X in the plane, the sum of distances to a fixed set of vertices is minimized when X is the Fermat point of that set. The Fermat point is the point where triangles formed with each triple of vertices have all interior angles ≤120°.  \n</description>  \n  <example>Given three noncollinear points A, B, C, the point X that minimizes AX+BX+CX is the one making ∠AXB=∠BXC=∠CXA=120°.  \n</example>  \n</note>  \n2. <note id=\"Fermat-point-construction\">  \n  <description>To construct the Fermat point for three points with no angle exceeding 120°:  \n  a) For each pair of vertices, draw an equilateral triangle outward.  \n  b) Connect the opposite vertices of these equilateral triangles to the third original vertex.  \n  c) Their intersection is the Fermat point.  \n</description>  \n  <example>For points A, B, C with no angle ≥120°, build equilateral ΔABD and ΔBCE outward. Then connect D to C and E to A; their intersection is the Fermat point.  \n</example>  \n</note>  \n3. <note id=\"angle-constraints\">  \n  <description>When a polygon has two angles already fixed at 60°, the remaining angles must be chosen so that the interior angles of the triangles formed at the Fermat point sum to 360°. This ensures the 120° condition is met.  \n</description>  \n  <example>In a quadrilateral ABCD with ∠B=∠D=60°, if X is the Fermat point, then at X the angles of ΔAXB, ΔBXC, ΔCXD, ΔDXA must sum to 360°, and each triangle’s apex angles must be 120°.  \n</example>  \n</note>  \n4. <note id=\"distance-chaining\">  \n  <description>When minimizing the sum of distances around a polygon, break the perimeter into segments and express the total as a sum of individual distances. Then apply the triangle inequality or special-angle identities to relate overlapping segments.  \n</description>  \n  <example>For a pentagon ABCDE, write f(X)=AX+XB+BC+CX+XD+DE+EX. Use triangle inequalities like AX+XB ≥AB to bound the sum, and when each angle is 60°, replace certain segments with equivalent lengths via cosine rules.  \n</example>  \n</note>  \n5. <note id=\"cosine-rule-for-60°\">  \n  <description>In any triangle with an angle of 60°, the law of cosines simplifies: if ∠B=60°, then b²=a²+c²−ac. This can be used to express one side in terms of the other two, aiding in distance simplification.  \n</description>  \n  <example>In ΔXYZ with ∠Y=60°, the side XZ satisfies XZ²=XY²+YZ²−XY·YZ. Thus XZ can be written in closed form, reducing the sum of distances.  \n</example>  \n</note>", "1. <note1>\n  <description>Use the Law of Cosines to express each side in terms of two adjacent segments and their included angle: for any triangle with sides a,b,c opposite angles A,B,C, c² = a² + b² – 2ab·cos C. This lets you compute unknown lengths from given angles and two sides.</description>\n  <example>Suppose a triangle has two sides of lengths 5 and 7 with included angle 60°. Then the third side c satisfies c² = 5² + 7² – 2·5·7·cos 60° = 25 + 49 – 70·(1/2) = 74 – 35 = 39, so c = √39.</example>\n</note1>\n2. <note2>\n  <description>Reflect one vertex across a side to convert a broken path problem into a straight-line distance. If you need the sum of distances from a point P to A and then to B, reflect B across line AC to B′; then PA + PB = PA + PB′, and the minimal sum is the straight distance P–B′.</description>\n  <example>On triangle ABC, to minimize PA + PB for point P on BC, reflect B across BC to B′. Then PA + PB = PA + PB′, and the minimal occurs when P lies on the straight line AB′.</example>\n</note2>\n3. <note3>\n  <description>For a convex pentagon, the Fermat-Torricelli point is the point where all three broken paths (to adjacent vertices) have equal total length. It can be found by constructing equilateral triangles on three consecutive sides and connecting their outer vertices to the opposite vertices; their intersection is the optimal point.</description>\n  <example>In pentagon WXYZP, choose three consecutive sides WX, XY, YZ. Construct equilateral triangles on WX and YZ outward, and draw lines from the new vertices of these triangles to the opposite vertices P and Z. Their intersection is the Fermat point minimizing WX + XY + YZ + YZ + ZP.</example>\n</note3>\n4. <note4>\n  <description>When summing multiple broken paths, apply the triangle inequality in each subpath: for any triangle with sides a,b,c, a + b ≥ c. Summing these inequalities over all subtriangles bounds the total distance from any point outside the polygon.</description>\n  <example>In quadrilateral ABCD, for any point P, PA + PB + PC + PD ≥ (AB + BC + CD + DA)/2. If the perimeter is 20, then the sum of distances from P to the four vertices is at least 10.</example>\n</note4>\n5. <note5>\n  <description>Compute the minimal sum explicitly by summing all side lengths once and dividing by 2 (for the Fermat-Torricelli bound), then subtract any overcounts from subpaths that include the optimal point. This gives the exact minimal total distance.</description>\n  <example>For a convex pentagon with perimeter 50, the naive bound is 50/2 = 25. If the optimal point lies inside one triangle, subtract the two sides of that triangle from the perimeter before dividing by 2 to refine the bound to 25 – (sum of those two sides).</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 14, "abstractions": ["3.3.3\n<note1>\n  <description>When computing sums of cubes modulo a prime power, reduce each term modulo the prime before cubing, since cube residues modulo p are p−1 in number and often split into small sets. This simplifies enumeration and leverages the small size of the residue set.</description>\n  <example>For p=3 and exponent 6, list cube residues mod 3: 0³≡0,1³≡1,2³≡8≡2. Thus any triple sum is determined by choosing residues 0,1, or 2 and summing them mod 3.</example>\n</note1>\n<note2>\n  <description>Use the fact that the sum of three cubes is divisible by p^k exactly when the sum of their residues mod p^k is 0. This converts the original problem into counting residue-class triples.</description>\n  <example>With p=3 and k=7, instead of working with full integers, count triples (r₁,r₂,r₃) from the 3^6 residue classes such that r₁+r₂+r₃≡0 mod 3^7.</example>\n</note3>\n<note3>\n  <description>Apply the convolution identity to count solutions to r₁+r₂+r₃≡0 mod m: the number of triples is (1/m)·∑_{d|m, μ(d)≠0} μ(d)·(|R_d|^3), where R_d is the set of residues with d dividing their order. This handles periodic structure efficiently.</description>\n  <example>For m=9, list R_d for each divisor d of 9 (d=1,3,9). Compute |R_d| for each, apply μ(d), and sum to get the total count of residue triples summing to 0 mod 9.</example>\n</note4>\n<note4>\n  <description>Exploit symmetry by grouping residue triples into conjugacy classes under permutations. Count each orbit once, then multiply by the orbit size, reducing redundant work in enumeration.</description>\n  <example>For p=3, the orbit of (0,1,2) under swapping is { (0,1,2), (0,2,1), (1,0,2), (1,2,0), (2,0,1), (2,1,0) }. Count one representative and multiply by 6.</example>\n</note5>\n<note5>\n  <description>When the number of residue classes is large, use generating functions: the coefficient of x^0 in (G(x))^3, where G(x)=∑_{r∈R} x^r, gives the count of triples summing to 0 mod m. Extract coefficients via fast algorithms or modular inversion.</description>\n  <example>For p=3 and exponent 7, build G(x)=∑_{r=0}^{3^6} x^{r³ mod 3^7}, then compute [x^0](G(x))^3. The result is the total number of triples whose cubes sum to 0 mod 3^7.</example>\n</note6>", "Note1:\nCubes modulo a prime power: For a prime p and exponent k, the cube map x↦x^3 is a permutation on (ℤ/p^kℤ)×. Its kernel is {0}, so for any nonzero residue, there is exactly one cube root. This lets you translate “x^3≡r mod p^k” into “x≡s mod p^k” with s^3≡r.\n\nNote2:\nCounting roots of unity: In (ℤ/p^kℤ)×, the cubic roots of unity are exactly the solutions to t^3≡1. There are φ(p^k) such elements, so one can count how many x satisfy x^3≡1 by counting these roots.\n\nNote3:\nSum-of-cubes congruence: To solve a^3+b^3+c^3≡0 mod p^k, rewrite as 0≡a^3+b^3+c^3≡…, then use Note1 to reduce each term to a residue class. This turns a cubic condition into a linear condition on residues.\n\nNote4:\nGenerating function approach: Treat each variable as a generating function g(x)=∑_{i=1}^{M} x^{i^3} where M=3^k. The coefficient of x^0 in g(x)^3 counts the number of triples whose cubes sum to 0 mod p^k.\n\nNote5:\nInclusion-exclusion for overlaps: When summing contributions from different residue classes, subtract cases where two variables lie in the same class twice, then add back triple overlaps. This corrects for overcounting in the linearized sum-of-cubes count.", "reduce mod 3 via small exponents; note that x^3 mod 3^k depends only on x mod 3^(k−1). This drastically cuts the size of residue classes to check.", "reduce the exponent on an odd prime p by applying the p-adic valuation to the sum of cubes:  \n<note1>  \n  <description>  \nFor any integer n, vₚ(n³)=3·vₚ(n). Thus, vₚ(a³+b³+c³)=min{vₚ(a³),vₚ(b³),vₚ(c³)} if p is odd.  \n</description>  \n  <example>  \nLet a=2·3¹, b=3², c=3³. Then v₃(a³)=3·1=3, v₃(b³)=3·2=6, v₃(c³)=3·3=9, so v₃(a³+b³+c³)=3.  \n</example>  \n</note1>  \n  use modular arithmetic to count contributions of each residue class:  \n<note2>  \n  <description>  \nIn Z/p³Z, the cube map permutes residue classes except for the fixed points. One can count how many numbers in [1,p³] map to 0 or to each other via direct enumeration or known formulas.  \n</description>  \n  <example>  \nMod 3, cubes of 0,1,2 are 0,1,2 respectively. Mod 9, there are 3 numbers whose cube is 0, and 3 numbers whose cube is 1 (namely 1,4,7) and similarly for −1.  \n</example>  \n</note2>  \n  apply inclusion–exclusion to enforce a minimum p-adic valuation:  \n<note3>  \n  <description>  \nTo require vₚ(a³+b³+c³)≥k, count all triples and subtract those with vₚ(a³+b³+c³)≤k−1. For each possible combination of vₚ(a³),vₚ(b³),vₚ(c³), include or exclude them via inclusion–exclusion signs.  \n</description>  \n  <example>  \nTo count triples with v₃(a³+b³+c³)≥2, subtract triples with v₃(a³+b³+c³)=0 or 1. If there are N₀ triples with v₃=0 and N₁ with v₃=1, then valid = total − N₀ − N₁.  \n</example>  \n</note3>  \n  exploit symmetry and count ordered tuples by fixing one coordinate:  \n<note4>  \n  <description>  \nWhen counting ordered triples, one can fix the first coordinate in a special residue class (e.g., those whose cube is 0 mod p³) and then count the remaining two coordinates freely. Multiply by the number of choices for the first coordinate.  \n</description>  \n  <example>  \nIf there are F numbers in [1,N] whose cube is 0 mod p³, and for each such choice there are M² ways to choose (b,c), then the total is F·M².  \n</example>  \n</note4>  \n  perform the final count modulo a small integer to get the remainder:  \n<note5>  \n  <description>  \nAfter obtaining the total count N, compute N mod M (e.g., 1000) by reducing each intermediate sum or product modulo M at each step.  \n</description>  \n  <example>  \nIf N=123456, then N mod 1000 = (123456 mod 1000)=456.  \n</example>  \n</note5>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
