{"row_idx": 0, "abstractions": ["<note1>\n  <description>Use Legendre’s formula to find the exponent of a prime p in n!: the exponent is ∑_{i=1 to ∞} floor(n/p^i). This gives the exact prime factorization of n!.</description>\n  <example>For 7!, the exponent of 2 is floor(7/2)+floor(7/4)=3+1=4, so 7! contains 2^4 in its factorization.</example>\n</note1>\n<note2>\n  <description>The sum of divisors function σ(n) for n=∏p_i^{a_i} is ∏(1 + p_i + p_i^2 + … + p_i^{a_i}). Use this to compute σ(n) directly from its prime factorization.</description>\n  <example>If n=2^3·3^2, then σ(n)=(1+2+4+8)·(1+3+9)=15·13=195.</example>\n</note3>\n<note4>\n  <description>To select numbers with a specific last digit, factor out 10^k and work modulo 10. For primes other than 2 or 5, their units-digit contributions cycle; only those cycles that map to the desired digit matter.</description>\n  <example>For 12!, divide by 10^2 and compute σ(mod 10). Only primes congruent to 1 or 9 mod 10 contribute to units digit 1, so ignore p≡3,7,9 mod 10.</example>\n</note5>\n<note6>\n  <description>When summing divisors with a restricted digit, split the sum into blocks or use generating functions: form G(x)=∏(1 + x^{p_i} + x^{2p_i} + …) and extract the coefficient of x^k for the target digit. This filters out unwanted contributions.</description>\n  <example>For primes {2,3,5,7}, build G(x)=(1+x^2+x^4+…)(1+x^3+x^9+…)(1+x^5)(1+x^7) and collect terms where the exponent mod 10 is 1.</example>\n</note6>", "<note1>\n  <description>Any number divisible by 5 ends in 0 or 5, so only divisors ending in 1 can be coprime with 5. Such divisors must be of the form 2^a·3^b·7^c (excluding 5 from its prime factorization).</description>\n  <example>To find positive divisors of a number ending in 1 that are coprime with 5, list divisors of the form 2^a·3^b·7^c for all valid exponents a,b,c.</example>\n</note2>\n<note2>\n  <description>For a number N=∏ p_i^{e_i}, the sum of all its divisors is σ(N)=∏ (p_i^{e_i+1}−1)/(p_i−1). Use this to compute sums over subsets of prime factors by multiplying the corresponding σ factors.</description>\n  <example>For a number with prime factorization 2^f·3^g·5^h, σ(N)=(2^{f+1}−1)/1·(3^{g+1}−1)/2·(5^{h+1}−1)/4, giving the total sum of all divisors.</example>\n</note3>\n<note3>\n  <description>When summing divisors of a subset of prime factors, restrict each prime’s exponent sum to its allowed range. Then σ over that subset is the product of σ for each prime raised to its allowed exponent.</description>\n  <example>To sum divisors of 2^a·3^b·7^c only, compute σ_2=(2^{a+1}−1)/1, σ_3=(3^{b+1}−1)/2, σ_7=(7^{c+1}−1)/6, then multiply σ_2·σ_3·σ_7.</example>\n</note4>\n<note4>\n  <description>Use the unit digit of a divisor to constrain exponent choices. A divisor’s last digit is determined by its prime factors mod 10, so adjust exponents to ensure the desired digit.</description>\n  <example>To get a divisor ending in 1, ensure 2^a ends in 1 (i.e., a≡0 mod 4) and 3^b ends in 1 (i.e., b≡0 mod 4), then choose c accordingly to keep the product ending in 1.</example>\n</note5>\n<note5>\n  <description>Ensure that chosen exponents satisfy all divisibility and digit constraints. After selecting ranges for each prime’s exponent, verify that the resulting divisors meet the required ending digit.</description>\n  <example>After fixing a=0,4; b=0,4; c=0,2 for primes 2,3,7 respectively, list all combinations and check which yield a unit digit of 1 before summing those divisors.</example>", "<note1>\n  <description>Factor the factorial into primes: n! = ∏ pᵢᵃⁱ. This gives the prime exponents needed for divisor analysis.</description>\n  <example>For n=5, 5! = 2³·3¹·5¹. Thus any divisor has form 2ᵃ·3ᵇ·5ᶜ with a≤3, b≤1, c≤1.</example>\n</note1>\n<note2>\n  <description>Generate all divisors by iterating exponents: for each prime pᵢ, choose exponent from 0 to aᵢ, then multiply. This yields every divisor exactly once.</description>\n  <example>With 2³·3¹·5¹, choose a∈{0,1,2,3}, b∈{0,1}, c∈{0,1}, compute 2ᵃ·3ᵇ·5ᶜ for each triple.</example>\n</note3>\n<note4>\n  <description>Use Legendre’s formula to find exponent aᵢ of pᵢ in n!: aᵢ = ∑_{k=1}^∞ ⌊n/pᵢᵏ⌋.</description>\n  <example>For n=5 and prime 2, ⌊5/2⌋+⌊5/4⌋ = 2+1 = 3, so 2³ divides 5!.</example>\n</note5>\n<note6>\n  <description>Filter divisors by a digit or modular condition: test each divisor against the desired property (e.g., mod 10 ≡1) before further processing.</description>\n  <example>From divisors of 2³·3¹·5¹, compute each value, then discard all whose last digit is not 1.</example>\n</note7>", "<note1>\n  <description>Compute the prime factorization of a factorial by summing exponents of each prime: for a prime p, exponent = ⌊n/p⌋ + ⌊n/p²⌋ + ⌊n/p³⌋ + … until terms vanish.</description>\n  <example>For n=10, exponent of 2 = ⌊10/2⌋+⌊10/4⌋+⌊10/8⌋ =5+2+1=8, so 2^8 divides 10!.</example>\n</note1>\n<note2>\n  <description>Use the divisor-count formula: if n=∏p_i^a_i, then the number of divisors is ∏(a_i+1). This helps estimate how many divisors to inspect.</description>\n  <example>If n has factorization 2^3·3^2·5^1, then total divisors = (3+1)(2+1)(1+1)=4·3·2=24.</example>\n</note3>\n<note4>\n  <description>Filter divisors by their last digit by considering how each prime’s power contributes to the units digit. Only primes ending in 1 or 5 (or 7/3 when combined) can yield a units digit of 1.</description>\n  <example>Divisors of 2^3·3^2·5^1 whose last digit is 1 must avoid 2 and 5 factors, so only use 3^2, giving divisors 3^0,3^1,3^2, all ending in 1.</example>\n</note5>\n<note6>\n  <description>Use the divisor-sum formula: for n=∏p_i^a_i, the sum of divisors is ∏((p_i^{a_i+1}−1)/(p_i−1)). This yields the sum of all divisors, not just those satisfying a condition.</description>\n  <example>For 2^3·3^2, divisor sum = (2^4−1)/(2−1)·(3^3−1)/(3−1) =15·13 =195.</example>\n</note7>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 1, "abstractions": ["<note1>\n  <description>When an expression like √(X·k) equals k·√X for a nonzero constant k, divide both sides by k and square to get X·k = k²·X. This yields (k²−1)·X = 0, so either X = 0 or k = ±1 (excluding negative roots).</description>\n  <example>Suppose √(Y·m) = m·√Y for some nonzero m. Divide by m to get √Y = √Y, which is an identity. To find specific Y, one must ensure the algebraic manipulation aligns with any additional domain restrictions.</example>\n</note1>\n<note2>\n  <description>Move a leading digit outside a radical by factoring: √(a·10³ + bcd) = √a·√(10³ + bcd/a). This lets you compare the integer part √a to a scaled radical of a smaller number.</description>\n  <example>For √(p·10³ + q), write √(p·10³ + q) = √p·√(10³ + q/p). If p=2 and 10³+q/2 is a perfect square, then √(2·10³+q) = √2·√(10³+q/2) gives a direct link between the two radicals.</example>\n</note3>\n<note3>\n  <description>When two radicals are equal, square both sides to eliminate roots. Check for extraneous solutions by ensuring the original expressions are nonnegative and domain conditions are met.</description>\n  <example>If √X = √Y, squaring gives X = Y. After finding X = Y, substitute back into √X = √Y to verify both sides are defined and nonnegative.</example>\n</note4>\n<note4>\n  <description>Use integer constraints on digits and leading coefficients: a four-digit number has a≠0, and digits 0–9. Combine these bounds with algebraic solutions to narrow down possible values.</description>\n  <example>From (k²−1)·X = 0 with X a four-digit number, X≠0 so k=±1. Then the leading digit a must be 1, and the remaining three-digit part must satisfy any additional radical conditions.</example>\n</note5>\n<note5>\n  <description>After algebraic manipulation, perform a quick check by plugging the candidate back into the original expressions to ensure equality and that all radicals yield real, nonnegative results.</description>\n  <example>Having found a candidate number, compute both √(original) and the moved-digit form separately. Confirm they match numerically and that no sign errors or extraneous solutions were introduced.</example>\n</note6>", "<note1>\n  <description>When a square root’s radicand changes by removing or inserting a digit, set the two expressions equal and square both sides to eliminate the root. This transforms the problem into an algebraic equation relating the original and modified numbers.</description>\n  <example>Suppose √M = k·√N, where M and N differ by a digit shift. Squaring gives M = k²·N, so any relation between M and N can be found by solving k²·N = M.</example>\n</note1>\n<note2>\n  <description>Express the original and modified numbers in base-10 form. If a digit is removed, represent it as the original minus the removed digit times a power of 10. If a digit is inserted, represent it as the original plus the new digit times an appropriate power of 10.</description>\n  <example>For a four-digit number ABCD, removing A gives (10³·B + 10²·C + 10·D). Inserting A at the front gives 10·ABCD + A·10³.</example>\n</note3>\n<note3>\n  <description>Exploit that the ratio of two digit-shifted expressions is a perfect square. If √M = k·√N, then M/N = k², so k² must be an integer. Factorize the ratio to find integer k that satisfies the condition.</description>\n  <example>If √(100·X+Y) = k·√X, then 100·X+Y = k²·X. Simplify to (100−k²)·X = −Y, and choose k so that k² ≡ 100 (mod X) yields an integer ratio.</example>\n</note4>\n<note4>\n  <description>Impose range and digit constraints to bound the search. Since the number is a four-digit integer, A∈{1…9} and B,C,D∈{0…9}. Combined with the square relation, this narrows down the possibilities dramatically.</description>\n  <example>After finding that k²·N = M, one only tests N in the range 100…9999 and k² in the range 1…9999, filtering out all invalid digit combinations that violate the four-digit requirement.</example>\n</note5>\n<note5>\n  <description>Check the uniqueness of the solution by ruling out extraneous roots. After finding k, verify that the resulting M and N are integers and that no other k satisfies the original equation. Ensure the only valid digit configuration is the one found.</description>\n  <example>Suppose k²·N = M yields two integer solutions for N. Compute the corresponding M for each and confirm that only one pair (A,B,C,D) is a valid four-digit number without leading zeros.</example>", "<note1>\n  <description>\nWhen a radical expression is equal to a product of a digit and another radical, square both sides to eliminate the root. Then factor or cancel common terms to isolate the unknown. This works because squaring preserves equality for nonnegative expressions.\n</description>\n  <example>\nGiven √(X Y Z) = A·√(Y Z), square both sides to get X Y Z = A²·Y Z. Then divide by Y Z to obtain X = A².\n</example>\n</note1>\n<note2>\n  <description>\nUse the identity √M = K·√N ⇔ M = K²·N. This transforms the problem into a polynomial equation by equating the radicands up to a perfect-square factor.\n</description>\n  <example>\nIf √(U V W) = B·√(V W), then U V W = B²·V W, so U = B².\n</example>\n</note1>\n<note3>\n  <description>\nWhen the leading digit A is used to multiply a shorter radical, it must be a perfect square (1, 4, 9). This restricts A to a small set of candidates and simplifies the equation.\n</description>\n  <example>\nIn √(A B C) = A·√(B C), squaring gives A B C = A²·B C. For this to hold, A² = 1 or 4 or 9, so A ∈ {1, 2, 3} (since A≠0).\n</example>\n</note1>\n<note4>\n  <description>\nAfter isolating variables, enforce domain constraints: leading digits must be nonzero, radicands must be nonnegative integers, and any squared factor must be a perfect square. This prunes invalid solutions.\n</description>\n  <example>\nFrom X = A², ensure A∈{1,2,3}. From Y Z ≥0, ensure Y and Z are digits ≥0. From U V W = A²·V W, ensure V W ≠0 to avoid division by zero.\n</example>\n</note1>\n<note5>\n  <description>\nCheck for trivial or degenerate cases (e.g., all digits zero or one-digit numbers) that violate the problem’s four-digit requirement. Discard such cases before finalizing the answer.\n</description>\n  <example>\nIf A=1 and B=C=D=0, the original number is 1000, but the modified expression becomes 1·√0=0≠√0=0, which is a degenerate case and must be excluded.\n</example>\n</note1>", "<note1>\n  <description>Any fourth root can be rewritten as the square of a square root: for integer n, √[4]{n}= (√[2]{√[2]{n}}). This helps break down complex radicals into simpler nested radicals.  \n</description>\n  <example>For instance, √[4]{81} can be seen as √[2]{√[2]{81}}=√[2]{9}=3, matching the standard fourth root.  \n</example>\n</note1>\n<note2>\n  <description>Extracting perfect square factors inside a radical reduces its complexity: if n= k²·m with k integer, then √{n}= k·√{m}. This simplifies nested radicals or compares terms.  \n</description>\n  <example>Given √{72}, note 72=36·2, so √{72}=√{36·2}=6√{2}.  \n</example>\n</note1>\n<note3>\n  <description>When an expression equals a simpler radical times a factor, set up a proportion between the two forms and simplify algebraically. This often leads to a Diophantine equation in integer variables.  \n</description>\n  <example>If √{A}= x·√{B}, then squaring gives A = x²·B, so x = √(A/B). Integer solutions require A/B to be a perfect square.  \n</example>\n</note1>\n<note4>\n  <description>Check divisibility by small primes and perfect squares to identify candidate numbers. Ensuring the ratio inside a radical is a perfect square narrows down possibilities quickly.  \n</description>\n  <example>To find a four-digit number divisible by 9, test divisibility by 3 twice. If the quotient is also divisible by 4, the original number is a candidate for a perfect square.  \n</example>\n</note1>\n<note5>\n  <description>After solving the algebraic equation, verify that all variables are positive integers and that any leading coefficient is nonzero. This ensures the solution fits the original problem’s constraints.  \n</description>\n  <example>From x²·B = A, ensure x&gt;0 and B&gt;0, then confirm x = √(A/B) is integral and A/B is a perfect square.  \n</example>\n</note1>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 2, "abstractions": ["<note1>\n  <description>Apply the logarithm power rule: for any positive base a ≠ 1 and positive x, y, z, one has log_a(x^y) = y·log_a(x). Use this to convert exponents in logs into factors in the argument of log.</description>\n  <example>Given a^u = b^v, take log base a of both sides to get u = v·log_a(b). If you know u and v, you can solve for log_a(b) and hence b.</example>\n</note1>\n<note2>\n  <description>When a product of variables appears inside a logarithm, split it into a sum of logs: log_a(x·y) = log_a(x) + log_a(y). This helps in separating combined terms into manageable parts.</description>\n  <example>For an equation like a^{log_a(x·y)} = c, rewrite it as x·y = c, or equivalently log_a(x·y) = log_a(c), then split to x + y = log_a(c) if needed.</example>\n</note2>\n<note3>\n  <description>Use the change-of-base formula to align logarithms with different bases: log_a(b) = log_c(b) / log_c(a). This lets you convert all logs to a common base for easier comparison and manipulation.</description>\n  <example>Suppose you have log_p(x) and log_q(x). Write both as log_r(x) / log_r(p) and log_r(x) / log_r(q) so you can add or compare them directly.</example>\n</note4>\n<note5>\n  <description>Convert exponential equations into linear equations by taking logarithms: if a^m = b^n, then m·log(a) = n·log(b). This yields a linear relation in the exponents, which can be solved by standard methods.</description>\n  <example>From a^{p·log(b)} = b^{q·log(a)}, taking logs gives p·log(a)·log(b) = q·log(a)·log(b), which simplifies to p = q when log(a)·log(b) ≠ 0.</example>\n</note6>\n<note7>\n  <description>When optimizing a product under logarithmic constraints, apply AM–GM or Jensen’s inequality: for positive variables, the product is minimized (or maximized) when the variables are equal, given a fixed sum of their logarithms.</description>\n  <example>If you have log(x) + log(y) + log(z) = S and want to minimize xyz, set x = y = z = e^{S/3} by AM–GM, giving the minimal value e^S.</example>", "<note1>\n  <description>Apply the logarithm power rule to simplify expressions of the form (base)^{log_b(other)}. Concretely, for any positive B, N, and M, (B)^{log_N(M)} = N^{log_N(B)·log_N(M)}. This converts exponentials with logs into simpler products of logs.</description>\n  <example>Given A^{log_c(d)}, rewrite as c^{log_c(A)·log_c(d)}. For instance, 5^{log_2(7)} = 2^{log_2(5)·log_2(7)}, which is easier to compare or combine with other terms.</example>\n</note1>\n<note2>\n  <description>Use the product rule for logarithms: log_b(M·N) = log_b(M) + log_b(N). This breaks a log of a product into a sum of logs, facilitating combination with other linear expressions.</description>\n  <example>To simplify log_p(x·y), write it as log_p(x) + log_p(y). For example, log_3(6·k) = log_3(6) + log_3(k), which you can then match to other log-based terms.</example>\n</note3>\n<note3>\n  <description>When several logarithmic or exponential equations share common bases or exponents, introduce new variables for those logs (e.g. set u = log_B(x), v = log_B(y), w = log_B(z)). This transforms the system into linear equations in u, v, w.</description>\n  <example>From x^{log_5(y)}=5^k, set u=log_5(x), v=log_5(y). The equation becomes 5^{u·v}=5^k, so u·v=k. You then solve u·v=k alongside other similar relations to find u, v, w.</example>\n</note4>\n<note4>\n  <description>Use the AM–GM inequality: for positive numbers a₁,…,a_n, (a₁+⋯+a_n)/n ≥ (a₁·⋯·a_n)^{1/n}. It bounds the product by the arithmetic mean, and equality holds when all a_i are equal.</description>\n  <example>To bound a·b·c given a+b+c = S, apply AM–GM: (a+b+c)/3 ≥ (abc)^{1/3}, so abc ≤ (S/3)^3. This gives a quick upper bound on the product.</example>\n</note5>\n<note5>\n  <description>After expressing the target (e.g. xyz) in terms of sums of logs or exponents, apply the GM–AM or Cauchy–Schwarz inequality to bound those sums. This yields the minimal or maximal possible value of the product.</description>\n  <example>Given u+v+w = T, the product u·v·w is maximized when u=v=w=T/3, by GM–AM. Thus the minimal xyz occurs when the corresponding variables satisfy the same equality condition.</example>", "<note1>\n  <description>Use logarithmic exponentiation: for a positive base a and exponent b, a^b = a^{b·1} = a^{b·(log_a(a))}, which can help convert products of exponents into sums of logs. This is useful when you have expressions like a^{log_c(b)}.</description>\n  <example>Suppose you need to simplify x^{log_2(y)}. Apply the identity: x^{log_2(y)} = x^{log_2(y)·1} = x^{log_2(y·1)} = (x^{log_2(y)})^{log2(1)}, but more directly, rewrite as 2^{log_2(x^{log_2(y)})} = x^{log_2(y)}.</example>\n</note1>\n<note2>\n  <description>Apply the change-of-base formula: log_b(c) = log_k(c) / log_k(b) for any positive base k. This is essential when you need to express logs in a common base or relate logs across different bases.</description>\n  <example>To compare log_3(5) and log_7(5), use log_3(5) = log_{10}(5)/log_{10}(3) and log_7(5) = log_{10}(5)/log_{10}(7). Then the ratio log_3(5)/log_7(5) = log_{10}(3)/log_{10}(7).</example>\n</note2>\n<note3>\n  <description>Use the product rule of logarithms: log_b(MN) = log_b(M) + log_b(N). This transforms a log of a product into a sum of simpler logs, aiding in factorization and solving.</description>\n  <example>Given log_2(x y), rewrite it as log_2(x) + log_2(y). If you know log_2(x) = p and log_2(y) = q, then log_2(x y) = p + q, which can simplify exponentiation or substitution.</example>\n</note3>\n<note4>\n  <description>When multiple exponential equations share the same base, equate exponents to form a system of linear equations in the exponents. This reduces the problem to solving a linear system.</description>\n  <example>From a^u = b^v and a^u = c^w, take logs to get u·log(a) = v·log(b) and u·log(a) = w·log(c). Then log(b)/log(a) = v/u and log(c)/log(a) = w/u, yielding a linear relation between v and w.</example>\n</note4>\n<note5>\n  <description>Compute the product of variables by summing their logarithms: if x = a^{p}, y = a^{q}, z = a^{r}, then xyz = a^{p+q+r}. This often turns a product constraint into a simple sum of exponents.</description>\n  <example>Suppose x = 2^{p}, y = 3^{q}, z = 5^{r}. Then xyz = 2^{p}·3^{q}·5^{r} = (2·3·5)^{p+q+r} = 30^{p+q+r}, so minimizing xyz reduces to finding the minimal p+q+r under given constraints.</example>\n</note5>", "<note1>\n  <description>Use the power-of-a-log rule: for any positive base a and exponent m, a^{m·log_a(u)} = u^m. This transforms expressions of the form a^{k·log_b(v)} into v^k, simplifying complex exponents.</description>\n  <example>Simplify 5^{4·log_3(7)}. By the rule, 5^{4·log_3(7)} = 7^4.</example>\n</note1>\n<note2>\n  <description>Take logarithms to linearize products and exponents: log_b(u·v) = log_b(u) + log_b(v) and log_b(u^m) = m·log_b(u). This turns multiplicative constraints into additive ones, making them easier to solve.</description>\n  <example>Given x·y = 12 and y·z = 18, taking logs with base 10 gives log(x) + log(y) = log(12) and log(y) + log(z) = log(18), which can then be solved alongside other log equations.</example>\n</note2>\n<note3>\n  <description>Apply the AM–GM inequality to find a lower bound: for nonnegative a, b, c, (a + b + c)/3 ≥ √[3](abc). Equality holds when a = b = c, which often gives the minimal or maximal product under symmetric constraints.</description>\n  <example>For positive x, y, z satisfying x + y + z = 15, AM–GM yields (15)/3 ≥ √[3](xyz), so xyz ≤ 5^3 = 125, with equality at x = y = z = 5.</example>\n</note3>\n<note4>\n  <description>Use substitution to reduce the number of variables: express one variable in terms of others using a simpler equation, then substitute into the remaining constraints. This reduces the system to fewer unknowns.</description>\n  <example>From x + y = 10, set y = 10 – x. Substitute into z = 12 – x – y to get z = 2, reducing the system to two variables x and z.</example>\n</note4>\n<note5>\n  <description>Check for special cases and edge behavior: verify that the solution set is nonempty, that variables stay positive, and that boundary conditions (e.g., variables approaching zero) do not violate constraints.</description>\n  <example>When solving x·y = 10 with x, y &gt; 0, ensure x ≠ 0, y ≠ 0, and that the derived expressions for other variables remain positive under the same constraints.</example>\n</note5>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 3, "abstractions": ["<note1>\n  <description>When summing floor of a rational function over a symmetric interval, split into positive and negative parts. Use the identity ⌊A/(x + c)⌋ = ⌊A/(x + c)⌋ on x ≥ 0 and ⌊A/(x + c)⌋ = ⌊–A/(–x – c)⌋ on x ≤ 0.</description>\n  <example>For ∑_{x=–3..3}⌊5/(x+1)⌋, compute ⌊5/(x+1)⌋ for x=1..3 and ⌊–5/(–x–1)⌋ for x=–3..–1, then add the two sums.</example>\n</note2>\n<note3>\n  <description>Use the floor sum formula: ∑_{k=1}^n⌊k/a⌋ = (n² + n)/2 – a·⌊n/a⌋ – ⌊(n + a – 1)/a⌋. This gives a closed form for sums of floor divisions by a fixed constant.</description>\n  <example>To compute ∑_{k=1}^{100}⌊k/4⌋, plug n=100, a=4 into the formula: (100²+100)/2 – 4·⌊100/4⌋ – ⌊(100+4–1)/4⌋ = 5050 – 4·25 – ⌊99/4⌋ = 5050 – 100 – 24 = 4926.</example>\n</note3>\n<note4>\n  <description>Recognize that ⌊A/(x + c)⌋ = ⌊A/(x + c)⌋ can be rewritten as A – ⌈A·(x + c)⌉/A, which sometimes simplifies bounding or pairing terms.</description>\n  <example>For ⌊7/(x+0.5)⌋, write it as 7 – ⌈7·(x+0.5)⌉/7. If x=1, then ⌈7·1.5⌉/7 = ⌈10.5⌉/7 = 2, so ⌊7/1.5⌋ = 7 – 2 = 5, matching the direct floor.</example>\n</note4>\n<note5>\n  <description>Use symmetry and pairing: for a symmetric range [–N..N], terms at ±k often cancel or combine to a constant, reducing the total sum.</description>\n  <example>In ∑_{k=–5..5}⌊k/2⌋, note ⌊–k/2⌋ = –⌊k/2⌋, so the sum collapses to 0. If the function isn’t odd, split into even/odd parts and use pairing.</example>\n</note6>\n<note7>\n  <description>Track boundary cases where the argument of the floor is an integer, as these can change the sum by one. Always check endpoints or values making the denominator an integer.</description>\n  <example>When summing ⌊6/(x+1)⌋ for x=–1..2, x=–1 gives ⌊6/0⌋ undefined, x=0 gives ⌊6/1⌋=6, x=2 gives ⌊6/3⌋=2. Omit or handle the undefined case separately.</example>", "<note1>\n  <description>For a real parameter t, the function ⌊t⌋ equals ⌈t⌉ when t is non-integer, and ⌊t⌋ = ⌈t⌉ – 1 when t is an integer. Use this to convert floor and ceiling expressions into a single type of rounding function for simplification.</description>\n  <example>Given x = 3.2, ⌊x⌋ = 3 = ⌈x⌉. For x = 4, ⌊x⌋ = 4 = ⌈x⌉ – 1. This lets you replace ⌊x⌋ with ⌈x⌉ – I(x – ⌊x⌋).</example>\n</note1>\n<note2>\n  <description>Summation over a symmetric index range about zero, f(j), can often be paired into f(j)+f(–j). If f(j) is odd, the sum vanishes; if f(j) is even, each pair equals 2f(0). This reduces large sums to simple counts.</description>\n  <example>For f(j)=j³, ∑_{j=–N..N} j³ = 0 (odd). For f(j)=j², ∑_{j=–N..N} j² = N² + ∑_{j=1..N–1} (2j²) = 2∑_{j=1..N–1} j² + N².</example>\n</note2>\n<note3>\n  <description>When summing a rational function ⌊A/(j+α)⌋, introduce a new variable k = j+α to center the sum. Then ⌊A/k⌋ changes sign at each zero of the denominator, creating simple floor and ceiling expressions in k.</description>\n  <example>For ∑_{j=–N..N} ⌊A/(j+α)⌋, set k = j+α so k runs from α–N to α+N. The sum becomes ∑_{k=α–N..α+N} ⌊A/k⌋, making it easier to analyze sign changes and pair terms.</example>\n</note3>\n<note4>\n  <description>Use the identity ∑_{k=1..M} ⌊A/k⌋ = A·⌊A⌋ – ∑_{k=1..⌊A⌋} ∑_{ℓ=1..⌊A/k⌋} 1. This converts a floor sum into a double sum of indicator functions, which can be computed by counting multiples.</description>\n  <example>To compute ∑_{k=1..10} ⌊7/k⌋, note ⌊7⌋=7, so 7·7 – ∑_{k=1..7} ⌊7/k⌋ = 49 – (7 + 3 + 2 + 1 + 1 + 1 + 1) = 49 – 16 = 33.</example>\n</note4>\n<note5>\n  <description>Always check for cancellations or symmetry when terms change sign. If f(j) satisfies f(–j)=–f(j), then ∑ f(j) over a symmetric range often cancels out, reducing the workload.</description>\n  <example>For f(j)=1/j, ∑_{j=–N..N} 1/j = 0 when N≥1 (excluding j=0). This avoids computing each term individually in large ranges.</example>\n</note5>", "<note1>\n  <description>When summing ⌊A/(k + c)⌋ over an arithmetic index k, split into intervals where the denominator’s fractional part is constant to simplify floor evaluation.</description>\n  <example>For ∑_{k=0..N}⌊10/(k+0.3)⌋, note that for k=0..2, 10/(k+0.3) lies in [5.5,6.66…), so ⌊10/(k+0.3)⌋=5; for k=3..4, it lies in [2.5,3.33…), so ⌊10/(k+0.3)⌋=2; and so on.</example>\n</note2>\n  <description>Pair terms k and –k to exploit symmetry: ⌊A/(k+d)⌋ + ⌊A/(–k+d)⌋ often simplifies to a constant or a simple function of |k|.</description>\n  <example>Summing ⌊12/(k+0.2)⌋ + ⌊12/(–k+0.2)⌋ for k=1..5 gives ⌊12/1.2⌋+⌊12/0.8⌋=10+15, and similarly for k=2 gives ⌊12/2.2⌋+⌊12/–1.8⌋=5+6, yielding a total of 21.</example>\n</note3>\n  <description>Use the identity ⌊x⌋ + ⌊y⌋ ≥ ⌊x+y⌋ to bound or combine floor sums, especially when x and y are related by simple shifts or reciprocals.</description>\n  <example>To bound ∑⌊1/k⌋ + ⌊k⌋ for k=1..N, note that ⌊1/k⌋ + k ≥ ⌊1/k + k⌋, so ∑(⌊1/k⌋+k) ≥ ∑⌊1/k + k⌋; if 1/k+k ≥ 2 for k≥1, then this ≥ ∑2 = 2N.</example>\n</note4>\n  <description>Approximate the sum by an integral: ∑⌊f(k)⌋ ≈ ∫_{k=1}^N f(k) dk, then adjust by the difference between the stepwise sum and the integral.</description>\n  <example>For ∑_{k=1}^100⌊1/k⌋, approximate ∫_1^{100}(1/t)dt = ln(100). Since ⌊1/k⌋ ≥ 1/k – 1, the sum ≥ ln(100) – 100, giving a rough lower bound.</example>\n</note5>\n  <description>Recognize that ∑_{k=1}^N⌊A/k⌋ counts the number of lattice points under the hyperbola y=A/x, and use standard divisor sums or known formulas for large N.</description>\n  <example>For A=100, ∑_{k=1}^N⌊100/k⌋ counts integer pairs (i,j) with i·j ≤100. One can derive asymptotic ∑⌊100/k⌋ ≈ 2√100 + O(1) for N≫100.</example>\n</note6>\n  <description>Handle edge cases (k=0 or k=±1) separately when denominators become zero or approach the threshold, then exclude or adjust those terms before general summation.</description>\n  <example>In ∑⌊1/(k+0.5)⌋ for k=–2..2, note k=–1 makes denominator zero, so exclude it. For k=–2 and 2, evaluate ⌊1/(–1.5)⌋=–1 and ⌊1/(2.5)⌋=0, then sum over remaining k.</example>", "<note1>\n  <description>When summing a floor function f(j)=⌊A/(j+0.5)⌋ over an integer index j, first identify the points where A/(j+0.5) crosses integer values. These occur at j+0.5 = A/k for integer k&gt;0.</description>\n  <example>For A=12, solve 12/(j+0.5)=2 ⇒ j+0.5=6 ⇒ j=5.5 (not integer), so no crossing at j=5.5. If A=10, then 10/(j+0.5)=2 ⇒ j+0.5=5 ⇒ j=4.5, crossing at non-integer j.</example>\n</note1>\n<note2>\n  <description>Use the identity ⌊x+ε⌋=⌊x⌋+1 if 0≤ε≤1, and ⌊x+ε⌋=⌊x⌋ otherwise. This lets you shift the index by 0.5 and turn the floor into a simple increment.</description>\n  <example>Let x=3.3 and ε=0.4. Then ⌊x+ε⌋=⌊3.7⌋=3, and since ε≤1, it equals ⌊x⌋+1=3+0.4? No, this shows the special case: ⌊3.3+0.4⌋=3, but ⌊3.3+0.6⌋=3+1=4.</example>\n</note2>\n<note3>\n  <description>Split the sum into blocks where f(j) is constant by grouping indices around each crossing point. Compute the constant value in each block and multiply by the number of terms.</description>\n  <example>Suppose f(j)=⌊10/(j+0.5)⌋ and crossings occur at j+0.5=5, 2.5, 1.25,… Group j in [4,5), [4.5,5.5), etc., compute f(j) in each block (e.g. f(j)=2 for j in [4,5)), then multiply by the count of j in that block.</example>\n</note3>\n<note4>\n  <description>When the index range is symmetric, pair terms f(j) with f(-j) to exploit symmetry. Often f(j)+f(-j) simplifies via the floor identity and cancellation of fractional parts.</description>\n  <example>For f(j)=⌊A/(j+0.5)⌋ and j from -N to N, note that j+0.5 and -j+0.5 differ by 1. Thus f(j)+f(-j) can be expressed in terms of ⌊A/(j+0.5)+1⌋ or ⌊A/(j+0.5)-1⌋.</example>\n</note4>\n<note5>\n  <description>After splitting into blocks or pairing, sum the contributions of each block or pair. Use the formula for the sum of integers or arithmetic series if the block sizes form an arithmetic progression.</description>\n  <example>If each block of size m contributes the value C, then total from those blocks is m·C. If block sizes are 3, 5, 7, then total =3·C+5·C+7·C =15·C, using arithmetic series sum.</example>\n</note5>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 4, "abstractions": ["<note1>\n  <description>When a polynomial with integer coefficients is evaluated at a sum of radicals, it can be rewritten as a rational linear combination of the basis {1, √r₁, √r₂, √r₁·√r₂}. This turns the evaluation into solving a system of linear equations in the unknown coefficients.</description>\n  <example>For P(x)=x²+ax+b evaluated at x=√5+√2, expand to (√5+√2)² + a(√5+√2) + b. Group like terms: (5+2 + b) + (2√5+√2 + a√5+a√2). Equate the rational part to the given value and the radical parts to zero to solve for a and b.</example>\n</note1>\n<note2>\n  <description>Use the fact that if P(α)=P(β) for two distinct algebraic conjugates α,β, then P must vanish on their difference α−β. In particular, for α=√r₁+√r₂ and β=√r₁−√r₂, α−β=2√r₂, so P must be divisible by the minimal polynomial of √r₂.</description>\n  <example>Given P(√7+√3)=P(√7−√3), let d=√7+√3−(√7−√3)=2√3. Since P(d)=0, the minimal polynomial of √3, namely x²−3, divides P.</example>\n</note2>\n<note3>\n  <description>Apply the Rational Root Test to monic integer-coefficient polynomials: any rational root p/q (in lowest terms) must have p|constant term and q|leading coefficient. For monic polynomials, this means any integer root divides the constant term.</description>\n  <example>For a monic polynomial R(x)=x³+ax²+bx+c, if R(r)=0 then r must divide c. Thus if c=6, possible integer roots are ±1, ±2, ±3, ±6.</example>\n</note4>\n<note4>\n  <description>If a nonconstant monic integer-coefficient polynomial Q has integer coefficients and vanishes at an integer x₀, then Q(x₀)=0 forces x₀ to divide the constant term of Q. This yields a finite list of candidates for x₀ to test.</description>\n  <example>Suppose Q(x)=x⁴+mx³+nx²+px+q is monic with integer coefficients and Q(k)=0 for some integer k. Then k must divide q, so one checks only divisors of q for possible roots.</example>\n</note5>\n<note5>\n  <description>For a monic polynomial Q of degree d, the difference Q(m)−Q(n) equals (m−n) times the sum of all leading coefficients of the degree-d−1 terms in the expansion of Q(x)−Q(n). This avoids full expansion.</description>\n  <example>Let Q(x)=x³+ax²+bx+c. Then Q(m)−Q(n)=(m−n)(m²+mn+n² + a(m+n) + b). Thus if m−n=1, the difference simplifies to the sum of the three coefficients 1+a+b.</example>\n</note6>", "<note1>\n  <description>When evaluating a polynomial at linear combinations of square roots, the minimal polynomial of the sum (or difference) of two square roots gives all possible rational values. Use the fact that any algebraic number of degree ≤4 over ℚ satisfies its minimal polynomial.</description>\n  <example>Let α=√a+√b. Its minimal polynomial over ℚ is x⁴−2(a+b)x²+(a−b)². If R(x) is any polynomial with rational coefficients, then R(α) is either an integer or a rational number determined by the coefficients of R and the minimal polynomial.</example>\n</note1>\n<note2>\n  <description>For a monic polynomial P with integer coefficients, if P(α)=P(β) for two distinct algebraic numbers α,β, then the leading coefficient must cancel the difference α−β in a symmetric way. This forces P to be even or odd in some sense, or to have an even degree.</description>\n  <example>Suppose P is monic and P(√2+√3)=P(√2−√3). Then the difference (√2+√3)−(√2−√3)=2√3 must be a root of P(x)−P(x). Since P is integer-coefficient and monic, this implies P(x) is even in x, so P(x)=x²+…+constant.</example>\n</note3>\n<note4>\n  <description>The minimal degree of a nonconstant monic polynomial with integer coefficients that satisfies a given symmetry condition is found by balancing the highest-degree term against the symmetry requirement. Typically, the degree is even to maintain cancellation under the given difference.</description>\n  <example>For P(α)=P(β) with α−β=2√m, any candidate P of odd degree would produce an odd-power term in 2√m, which cannot be an integer. Hence the minimal degree is 2, giving P(x)=x²+…+constant.</example>\n</note5>\n<note6>\n  <description>Once the minimal polynomial form is determined, any integer-coefficient polynomial satisfying the constraint is a scalar multiple of that minimal polynomial. The scalar multiple does not affect the difference P(10)−P(0) except by a constant factor, which in the monic case is trivial.</description>\n  <example>If Q(x)=k·x²+…+constant and k is the leading coefficient (here k=1), then Q(10)−Q(0)=k·(10²−0²)=100. Thus the only possible value is 100.</example>\n</note6>", "<note1>\n  <description>When a polynomial with integer coefficients takes the same value at two algebraically conjugate inputs, it must be invariant under the corresponding Galois action. This forces the polynomial to be symmetric in the minimal polynomial of those inputs.</description>\n  <example>For inputs α=√m+√n and β=√m−√n, the condition P(α)=P(β) implies P is invariant under swapping √n and −√n. Thus P factors through the minimal polynomial x²−2m−2n, reducing the problem to a polynomial in x²−2m−2n.</example>\n</note2>\n  <description>To handle algebraic conjugates, form the minimal polynomial of their sum or difference. This yields a simpler base polynomial whose roots are the conjugates, allowing reduction to a lower-degree problem.</description>\n  <example>Given α=√p+√q, its minimal polynomial is x²−2(p+q)−2√(pq). Substituting x=α yields a quadratic in x², so any symmetric polynomial in α can be reduced to a quadratic in x².</example>\n</note3>\n  <description>Any symmetric polynomial in two conjugate variables can be expressed as a polynomial in the sum S and product P of those variables. This reduction often turns a two-variable problem into a single-variable one.</description>\n  <example>If α and β are roots of x²−Sx+P=0, then P(α)+P(β)=P(S) and P(α)−P(β)=R(α,β) for some symmetric R. Thus one can write P(α)=P(S)−R(α,β), reducing the problem to P(S) and the simpler symmetric R.</example>\n</note4>\n  <description>When a polynomial is monic and invariant under conjugation, it can be written as a product of irreducible factors over the integers. One can factor it into (x−r)(x−r′)…, where r and r′ are algebraic conjugates.</description>\n  <example>A monic polynomial invariant under x→−x has the form (x²−a)(x²−b)… . Each factor corresponds to a real root or a pair of conjugate roots, ensuring integer coefficients and symmetry.</example>\n</note5>\n  <description>The difference Q(t)−Q(0) for a monic polynomial Q is simply t·Q′(c) for some c between 0 and t. This avoids computing Q(t) and Q(0) separately and uses the Mean Value Theorem in the discrete setting.</description>\n  <example>For Q(x)=x³+2x+1, Q(t)−Q(0)=t·(3c²+2) for some c∈[0,t]. Hence Q(t)−Q(0)=t·(3c²+2), which can be evaluated once c is known or bounded.</example>", "<note1>\n  <description>For any algebraic number α of degree d over ℚ, the minimal polynomial has degree d and is invariant under all field automorphisms fixing ℚ. Use this to derive relations among coefficients when a polynomial takes the same value at α and its Galois conjugates. This ensures consistency of the polynomial’s coefficients across its conjugates.</description>\n  <example>Let α satisfy α²–cα–1=0. If P(α)=P(β) where β is the other root, then substituting both into P(x)=x³+ax²+bx+c yields two equations in a,b,c. Equating them enforces a relation among a,b,c.</example>\n</note1>\n<note2>\n  <description>Conjugation by complex conjugation or other automorphisms on algebraic numbers produces equations in unknown coefficients. Equating P(α)=P(ᾱ) or similar relations yields polynomial relations among the coefficients, often linear or quadratic. Solve these to constrain the coefficient set.</description>\n  <example>For α=√d+√e, its conjugate is √d–√e. Setting P(α)=P(√d–√e) gives an equation in a₀,…,aₙ. Solving this yields a linear relation among a₀,…,aₙ that must hold for P to satisfy the value equality.</example>\n</note3>\n<note4>\n  <description>Once coefficients are constrained by symmetry, substitute back into the polynomial to check minimality of degree. Look for the lowest-degree monic integer polynomial satisfying the constraints. This often reveals that the minimal polynomial is irreducible over ℚ.</description>\n  <example>After finding a relation like a₀–a₁–a₂=0, one substitutes into P(x)=x²+ax+b and finds that b must be 0 and a=1. This yields the minimal degree two polynomial x²+x.</example>\n</note5>\n<note6>\n  <description>For a minimal-degree polynomial Q of degree n, the difference Q(k)–Q(0) is given by the sum of the first n–1 powers of k times the corresponding coefficients. Use this to compute Q(k)–Q(0) once the minimal polynomial is known. The result is an expression purely in k and the coefficients.</description>\n  <example>If Q(x)=x²+x, then Q(10)–Q(0)=10²+10=110. More generally, for any monic quadratic Q, Q(k)–Q(0)=k²+k.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 5, "abstractions": ["<note1>\n  <description>Use Fermat’s little theorem to reduce any exponent modulo p–1 when working modulo a prime p. For a prime p and integer a not divisible by p, a^k ≡ a^(k mod (p–1)) (mod p).</description>\n  <example>To compute 5^10 mod 7, note 7 is prime so reduce exponent: 10 mod 6 = 4. Then 5^10 ≡ 5^4 = 625 ≡ 2 (mod 7).</example>\n</note2>\n<note3>\n  <description>Apply Euler’s theorem to reduce exponents modulo φ(n) when working modulo a composite n that is not prime. If gcd(a,n)=1, then a^φ(n) ≡ 1 (mod n), so a^k ≡ a^(k mod φ(n)) (mod n).</description>\n  <example>Compute 3^100 mod 14. Since φ(14)=6 and gcd(3,14)=1, reduce exponent: 100 mod 6 = 4. Then 3^100 ≡ 3^4 = 81 ≡ 13 (mod 14).</example>\n</note3>\n<note4>\n  <description>Use the Chinese remainder theorem to break a large modulus into coprime components, solve separately, then recombine. If n factors as n₁·n₂ with gcd(n₁,n₂)=1, solve a ≡ b₁ (mod n₁) and a ≡ b₂ (mod n₂), then find a unique solution mod n.</description>\n  <example>Solve x ≡ 2 (mod 3) and x ≡ 3 (mod 5). One solution is x=8, since 8≡2 (mod 3) and 8≡3 (mod 5). The general solution is x ≡ 8 (mod 15).</example>\n</note4>\n<note5>\n  <description>When subtracting 1 from a power of a prime p modulo p!, exploit Wilson’s theorem: (p–1)! ≡ –1 (mod p). Hence p^k – 1 ≡ (–1)^k (mod p).</description>\n  <example>Compute 7^3 – 1 mod 7!. Since 7 is prime, (7–1)! = 6! ≡ –1 (mod 7). Thus 7^3 – 1 ≡ (–1)^3 = –1 ≡ 6 (mod 7!).</example>\n</note5>\n<note6>\n  <description>Use the binomial theorem to expand expressions like (p+1)^n mod p!. Any term with a factor of p will be divisible by p!, so only the constant term survives modulo p!.</description>\n  <example>Compute (8)^5 mod 7!. Write 8 = 7+1 and expand: (7+1)^5 = 7^5 + 5·7^4 + 10·7^3 + 10·7^2 + 5·7 + 1. All terms except 1 are multiples of 7! and vanish, leaving 1 mod 7!.</example>\n</note6>", "<note1>\n  <description>When a prime p divides the modulus M, use the Lifting The Exponent (LTE) lemma: for any integer a coprime to p, the exponent of p in aⁿ – 1 is at least the exponent of p in p – 1 plus the exponent of p in n. This gives a lower bound on p^k dividing aⁿ – 1.</description>\n  <example>Let p be a prime and M = p^k·m with p∤m. If n is a multiple of p – 1, then v_p(aⁿ – 1) = v_p(p – 1) + v_p(n). For instance, with p = 3, k = 2, n = 2, we get v₃(3² – 1) = v₃(2) + v₃(2) = 0 + 1 = 1, so 3 divides 3² – 1 but 9 does not.</example>\n</note2>\n  <description>For a prime p dividing the base a and modulus M = p^k·m, the LTE formula is v_p(aⁿ – 1) = k + v_p(a – 1) + v_p(n) – 1. This extends the basic case to handle a divisible by p.</description>\n  <example>Take p = 5, M = 5²·3, a = 5, n = 6. Then v₅(5⁶ – 1) = 2 + v₅(4) + v₅(6) – 1 = 2 + 0 + 1 – 1 = 2, so 25 divides 5⁶ – 1 but 125 does not.</example>\n</note3>\n  <description>In a composite modulus M = ∏pᵢ^{kᵢ}, use the Chinese Remainder Theorem: reduce aⁿ – 1 modulo each prime power pᵢ^{kᵢ} separately, then combine the results. This breaks a hard problem into simpler ones.</description>\n  <example>For M = 12 = 2²·3, to compute aⁿ – 1 mod 12, first find aⁿ – 1 mod 4 and mod 3, then reconstruct. If aⁿ – 1 ≡ 3 mod 4 and ≡ 2 mod 3, CRT gives a unique solution mod 12.</example>\n</note4>\n  <description>When n is sufficiently large (e.g. n ≥ p – 1 for prime p), Fermat’s little theorem and its generalizations imply aⁿ ≡ a mod p (and mod p^k). Thus aⁿ – 1 ≡ 0 mod p, and in fact mod p^k if n is a multiple of the appropriate exponent.</description>\n  <example>Let p = 7 and n = 6. Since 6 is a multiple of 7 – 1 = 6, Fermat’s theorem gives 2⁶ ≡ 2 mod 7². Hence 2⁶ – 1 ≡ 0 mod 49, so 49 divides 2⁶ – 1.</example>\n</note5>\n  <description>When a base a and modulus M share prime factors, factor M into pᵏ·m with p∤m. Use the LTE or direct divisibility arguments on pᵏ, then handle m separately. Finally, combine via CRT or direct addition of exponents.</description>\n  <example>For M = 18 = 2·3², a = 4, n = 3: compute 4³ – 1 mod 8 and mod 9 separately, then combine. Mod 8 gives 64 – 1 ≡ 7 mod 8, mod 9 gives 64 – 1 ≡ 7 mod 9, so CRT yields 4³ – 1 ≡ 7 mod 18.</example>", "<note1>\n  <description>Wilson’s Theorem: If N is a positive integer, then (N–1)! ≡ –1 (mod N) if and only if N is prime. It provides a quick primality check or a closed form for factorials modulo primes.</description>\n  <example>For N = 7, compute 6! = 720, and 720 ≡ –1 (mod 7). This confirms 7 is prime and gives 6! mod 7 = 6.</example>\n</note1>\n<note2>\n  <description>Binomial Theorem for Exponent Modulo: For any integer a and prime p, (a^p – a) ≡ 0 (mod p). More generally, for exponent k, a^k ≡ a^(k mod (p–1)) (mod p) if p∤a. This simplifies large exponent arithmetic modulo a prime.</description>\n  <example>With p = 5 and a = 2, to compute 2^13 mod 5, note 13 mod (5–1) = 13 mod 4 = 1, so 2^13 ≡ 2^1 = 2 (mod 5).</example>\n</note2>\n<note3>\n  <description>Factorial Modulo a Prime Factor: If N = p·m with p prime and p∤m, then N! ≡ 0 (mod p). In particular, (p–1)! ≡ –1 (mod p) by Wilson’s theorem, so N! ≡ 0 (mod p) since it includes p in its factors.</description>\n  <example>For N = 10 = 2·5, 10! contains the factor 2, so 10! ≡ 0 (mod 2). Also, 5! = 120 ≡ –1 (mod 5), and 10! = 3628800 ≡ 0 (mod 5).</example>\n</note3>\n<note4>\n  <description>Factorial Modulo a Composite: To compute N! mod M when M is composite, factor M into primes p_i and use the Chinese Remainder Theorem. First find N! mod p_i by relevant theorems, then recombine the results.</description>\n  <example>For N = 6 and M = 4·3, compute 6! mod 4 and mod 3. Since 6! ≡ 0 (mod 2) and 6! ≡ 1 (mod 3), use CRT to find 6! ≡ 0 (mod 4) and 6! ≡ 1 (mod 3), so 6! ≡ 4 (mod 12).</example>\n</note4>\n<note5>\n  <description>Modular Inversion for Division: To divide by a nonzero residue a modulo M, multiply by the modular inverse b = a^(–1) mod M, satisfying a·b ≡ 1 (mod M). This avoids direct division in modular arithmetic.</description>\n  <example>Compute 3/2 mod 7. Find 2^(–1) mod 7: 2·4 = 8 ≡ 1, so inverse is 4. Then 3·4 = 12 ≡ 5 (mod 7), giving the result 5.</example>\n</note5>", "<note1>\n  <description>Use modular arithmetic to reduce exponents: if a ≡ b (mod m), then a^k ≡ b^k (mod m). This lets you replace large bases with smaller ones when computing remainders.</description>\n  <example>To compute 7^10 mod 13, note 7 ≡ 7 (mod 13). Since 7^2 ≡ 49 ≡ 10 (mod 13), then 7^10 = (7^2)^5 ≡ 10^5 ≡ 10·10=100 ≡ 9 (mod 13).</example>\n</note2>\n<note3>\n  <description>Apply Euler’s theorem: if gcd(a, m)=1, then a^φ(m) ≡ 1 (mod m). This gives an exponent reduction by φ(m), the totient of m.</description>\n  <example>For m=10, φ(10)=4 and gcd(3,10)=1, so 3^4 ≡ 1 (mod 10). Thus 3^13 = 3^(4·3+1) ≡ 1^3·3 ≡ 3 (mod 10).</example>\n</note3>\n<note4>\n  <description>Factor the modulus to apply the Chinese remainder theorem: if m = m₁·m₂ with gcd(m₁,m₂)=1, then solve a ≡ r₁ (mod m₁) and a ≡ r₂ (mod m₂) and combine.</description>\n  <example>Find x ≡ 2 (mod 3) and x ≡ 3 (mod 4). One solution is x=3, giving 3 ≡ 2 (mod 3) and 3 ≡ 3 (mod 4). The general solution is x ≡ 3 (mod 12).</example>\n</note5>\n<note6>\n  <description>Use the binomial theorem to expand expressions like (a+b)^k: (a+b)^k = Σ C(k,i)·a^(k−i)·b^i. This is helpful for remainder computations when one term is a multiple of the modulus.</description>\n  <example>Compute (1+5)^4 mod 7. Expand: 1+4·5+6·5^2+4·5^3+5^4. Since 5≡−2 (mod 7), replace and reduce each term mod 7 to get the remainder.</example>\n</note6>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 6, "abstractions": ["<note1>\n  <description>When multiple expressions share the same value, introduce a single parameter t and set each expression equal to t. This reduces a system of equations to a single variable and simplifies solving.</description>\n  <example>For equations 2(x²+1)=3(y²+1)=4(z²+1), let t=2(x²+1). Then y²+1=t/3 and z²+1=t/4, turning the three-variable system into three equations in x, y, z via t.</example>\n</note1>\n<note2>\n  <description>Express each variable in terms of the common parameter t by isolating the quadratic term. For instance, from y²+1=t/3, get y=√((t/3)−1). This step turns the original problem into a single-variable optimization or equation.</description>\n  <example>Given y²+1=t/3, rearrange to y²=(t/3)−1, so y=√((t/3)−1). Similarly, x=√((t/2)−1) and z=√((t/4)−1).</example>\n</note3>\n<note3>\n  <description>Substitute these expressions into any remaining relation (e.g. a sum or product condition) to form a single-variable equation. This often yields a polynomial equation in t that you can solve.</description>\n  <example>Using x=√((t/2)−1), y=√((t/3)−1), z=√((t/4)−1) and the condition xy+yz+zx=1, substitute to get √((t/2)(t/3)−…) + … =1, resulting in a polynomial in t.</example>\n</note4>\n<note4>\n  <description>Apply domain constraints on t—such as positivity and the requirement that each radicand be nonnegative—to eliminate extraneous solutions. This ensures only valid parameter values remain.</description>\n  <example>From t/2−1≥0, t/3−1≥0, and t/4−1≥0, deduce t≥2. Any t less than 2 is discarded, leaving only nonnegative t satisfying all radicands.</example>\n</note5>\n<note5>\n  <description>After finding t, compute the target quantity (e.g. a+b+c) by substituting back into the variable expressions. Simplify the result to obtain the final answer.</description>\n  <example>With t determined, compute a+b+c = √((t/2)−1) + √((t/3)−1) + √((t/4)−1). Simplify this sum to get the desired expression.</example>\n</note6>", "<note1>\n  <description>When multiple expressions share a common value, set them equal to a parameter t and solve each for the original variable. This reduces the system to algebraic equations in t. It works because any two expressions equal to the same quantity must each equal that quantity.</description>\n  <example>Given 2(x²+1)=3(y²+1)=t, solve 2(x²+1)=t to get x²=(t/2)−1, and 3(y²+1)=t to get y²=(t/3)−1. Now x and y are expressed in terms of t, simplifying further analysis.</example>\n</note1>\n<note2>\n  <description>For a positive real parameter t, ensure each expression inside a square root is nonnegative. This yields inequalities like (t/2)−1≥0 and (t/3)−1≥0, determining the valid domain for t. Ignoring these constraints can lead to extraneous solutions.</description>\n  <example>From x²=(t/2)−1, require t/2≥1, so t≥2. From y²=(t/3)−1, require t/3≥1, so t≥3. Thus t must be at least 3 to keep both x and y real.</example>\n</note3>\n<note3>\n  <description>When symmetric sums of variables are given, use symmetric polynomial identities. For instance, if x+y+z=S and xy+yz+zx=Q, then x²+y²+z² = S²−2Q. This transforms sums of squares into known quantities. It is useful for relating sums of variables to sums of their squares.</description>\n  <example>Suppose x+y+z=S and xy+yz+zx=Q. Then x²+y²+z² = S²−2Q. If S and Q are known, this immediately gives the sum of squares without solving for x,y,z individually.</example>\n</note4>\n<note4>\n  <description>Use the identity for the square of a sum: (x+y+z)² = x²+y²+z² + 2(xy+yz+zx). This links the square of the total to the sum of squares and the sum of pairwise products. It is essential when one seeks the sum of variables and only symmetric sums are known.</description>\n  <example>Given x²+y²+z² = P and xy+yz+zx = Q, then (x+y+z)² = P + 2Q. Thus x+y+z = √(P+2Q), yielding the total sum from known symmetric sums.</example>\n</note5>\n<note5>\n  <description>After finding a candidate for the sum of variables, verify it satisfies all original equations. Substitute back to ensure consistency. This check prevents accepting extraneous or invalid solutions.</description>\n  <example>Compute S = √(P+2Q) from the symmetric sums. Then substitute x+y+z=S and xy+yz+zx=Q into the original equations to confirm they hold. If they do, S is the valid sum; otherwise, it must be discarded.</example>", "<note1>\n  <description>When three expressions are all equal, set them pairwise equal to derive ratios of variables. This reduces multiple equations to simpler proportional relations.</description>\n  <example>Suppose E₁(x,y)=2(x²+1), E₂(y,z)=3(y²+1), and E₃(z,x)=4(z²+1) are equal. Write 2(x²+1)=3(y²+1) and 3(y²+1)=4(z²+1), then solve for x²:y² and y²:z² to obtain x:y:z.</example>\n</note1>\n<note2>\n  <description>Use the identity x²+y²+z² = (x+y+z)² − 2(xy+yz+zx) to link the sum of squares to the square of the sum and the pairwise products.</description>\n  <example>Given x+y+z=S and xy+yz+zx=P, then x²+y²+z² = S² − 2P. If you know P from another equation, you can express x²+y²+z² in terms of S.</example>\n</note2>\n<note3>\n  <description>Introduce the symmetric sums S₁=x+y+z, S₂=xy+yz+zx, and S₃=xyz to turn quadratic or symmetric equations into a system in S₁,S₂,S₃, often yielding a polynomial equation to solve.</description>\n  <example>From x+y+z=S₁ and xy+yz+zx=S₂, and another equation like x²+y²+z²=S₁²−2S₂, substitute these into a target relation to reduce to a single equation in S₁ or S₂.</example>\n</note3>\n<note4>\n  <description>Check for extraneous roots when using substitutions or squaring: after solving the transformed system, verify that each candidate satisfies the original, non-squared equations.</description>\n  <example>After deriving S₁ and S₂ from the system, plug back into the original symmetric conditions to ensure no root violates any original equality or positivity constraints.</example>\n</note4>\n<note5>\n  <description>Apply the AM–GM inequality or convexity arguments to bound expressions like x²+1, y²+1, etc., to find extremal values or to prove uniqueness of the solution.</description>\n  <example>For positive x, x²+1 ≥ 2x by AM–GM, so the minimal value of x²+1 is 2x. Comparing this with a fixed constant can determine the unique x that achieves equality.</example>\n</note5>", "<note1>\n  <description>When multiple expressions are set equal to a common parameter, introduce that parameter and express each original variable in terms of it. This reduces the number of unknowns.</description>\n  <example>Suppose x²+1 = y²+1 = k. Then x = √(k−1) and y = √(k−1), turning the problem into finding k and then computing x+y.</example>\n</note1>\n<note2>\n  <description>Use symmetric sums: let S = a+b+c, P = ab+bc+ca, Q = abc. Express given symmetric conditions in terms of S, P, Q to simplify.</description>\n  <example>For a+b+c = S and ab+bc+ca = P, one can derive a²+b²+c² = S² − 2P, which is often needed in symmetric equations.</example>\n</note3>\n<note4>\n  <description>Apply the AM–GM inequality to bound sums or products of positive variables. It often reveals necessary conditions or extreme cases.</description>\n  <example>For positive a and b, (a+b)/2 ≥ √(ab). If ab is fixed, AM–GM gives the smallest possible a+b, which can be used to test uniqueness.</example>\n</note5>\n<note6>\n  <description>Check for monotonicity or convexity of the expressions involved. A strictly increasing or convex function on an interval with two fixed values forces equality of its arguments.</description>\n  <example>If f(t) = t² + 1 is strictly increasing for t&gt;0, then f(x)=f(y) implies x=y. This can quickly rule out distinct solutions.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 7, "abstractions": ["<note1>\n  <description>Use a geometric series sum formula: for |r|&lt;1, ∑ₙ₌₀ⁿ⁻¹ rⁿ = (1–rⁿ)/(1–r). This turns infinite sums into closed forms.</description>\n  <example>Compute ∑ₙ₌₁ⁿ⁻¹ 1/2ⁿ by letting r=1/2: ∑ₙ₌₁ⁿ⁻¹ (1/2)ⁿ = (1/2–(1/2)ⁿ)/(1–1/2) = 1–(1/2)ⁿ⁻¹.</example>\n</note1>\n<note2>\n  <description>When a summand is a product of two sequences (e.g. aₙ·bₙ), split the sum into ∑aₙ·∑bₙ if the sequences are independent. This simplifies evaluation.</description>\n  <example>∑ₙ₌₁ⁿ⁻¹ (1/2ⁿ)·(–1)ⁿ = (∑ₙ₌₁ⁿ⁻¹ 1/2ⁿ)·(∑ₙ₌₁ⁿ⁻¹ (–1)ⁿ).</example>\n</note2>\n<note3>\n  <description>Recognize alternating sums of a geometric term: ∑ₙ₌₀ⁿ⁻¹ (–r)ⁿ = (1–(–r)ⁿ)/(1+r). This handles sign-flipping in geometric progressions.</description>\n  <example>For r=1/2, ∑ₙ₌₀ⁿ⁻¹ (–1/2)ⁿ = (1–(–1/2)ⁿ)/(1+1/2) = (1–(–1/2)ⁿ)/1.5.</example>\n</note3>\n<note4>\n  <description>Use the limit of partial sums to evaluate ∑₁∞ termₙ. If termₙ→0 and the partial sums converge, the infinite sum equals the limit of the partial sums.</description>\n  <example>Compute limₙ→∞ (1–(r)ⁿ) = 1–0 = 1 when |r|&lt;1, so ∑₁∞ (–r)ⁿ = 1/(1+r).</example>\n</note4>\n<note5>\n  <description>Abstract problem structure: replace concrete sequences with generic ones (aₙ, bₙ) and identify when you can split or collapse sums. This avoids ad-hoc computations.</description>\n  <example>Given ∑ₙ aₙ·bₙ where aₙ is geometric and bₙ alternates, note that bₙ is a known geometric series with sign, then combine to get a closed form.</example>\n</note5>", "<note1>\n  <description>Split the infinite sum into cases based on the sign of the sine argument. Identify intervals of n where sin(2ⁿ) is positive, negative, or zero, and rewrite the sum as a weighted sum over these intervals. This reduces the problem to analyzing finitely many sign patterns.</description>\n  <example>For a similar sum over n=1..4, check sin(2¹)=sin(2) and sin(2²)=sin(4), and so on. Group terms where sin(2ⁿ)&gt;0 and where sin(2ⁿ)&lt;0, then sum contributions 1/2ⁿ and −1/2ⁿ respectively.</example>\n</note2>\n  <description>Use the binary expansion of 2ⁿ to characterize sign changes. Since 2ⁿ in binary is 1 followed by n zeros, the parity of n mod 4 determines the sign of sin(2ⁿ) via the periodicity of sine. Thus the sign pattern repeats every 4 terms.</description>\n  <example>Compute sin(2³)=sin(8). The binary form of 8 is 1000, so n=3 gives sin(2ⁿ)=sin(8)≈0.9893, positive. By parity arguments, sin(2⁴)=sin(16)≈0.3052, negative, and so on, repeating every 4 steps.</example>\n</note3>\n  <description>Group terms in blocks of 4 to exploit the repeating pattern. Write the sum as ∑_{k=0}^{∞} [ (1/2^{4k+1}−1/2^{4k+2}) + (−1/2^{4k+3}+1/2^{4k+4}) ]. Each block is a simple geometric series whose sum is known.</description>\n  <example>For k=0, the block is (1/2 −1/4) + (−1/8 +1/16) =1/4−1/8=1/8. For k=1, the block is (1/32−1/64)+(−1/128+1/256)=1/64−1/256=3/256, and so on. Summing these gives a convergent series.</example>\n</note4>\n  <description>Use the formula for the sum of a geometric series to evaluate each block. If |r|&lt;1, then ∑_{m=0}^{∞} r^m = 1/(1−r). For each block, the common ratio r is a small fraction, so the block sum is (first term)/(1−r).</description>\n  <example>Block k=1 has first term 3/256 and ratio r=1/4. Its sum is (3/256)/(1−1/4)= (3/256)/(3/4)=1/8. Similarly, block k=2 sum is (1/1024)/(1−1/4)=1/3072, and so on.</example>\n</note5>\n  <description>Recognize the overall sum as an arithmetico-geometric series. The general term of the form a_k·r^k can be summed via a known closed form. In this case, a_k alternates between positive and negative block sums, forming an arithmetico-geometric progression.</description>\n  <example>The series ∑_{k=0}^{∞} ( (−1)^k a_k ) where a_k =1/4^k forms an arithmetico-geometric series. Apply the formula ∑_{k=0}^{∞} (−1)^k a_k = a_0/(1+2r) when r=1/4, yielding the final closed form.</example>", "<note1>\n  <description>Break the series into disjoint cases based on the sign of the inner function. If the sign changes at known thresholds, split the sum into intervals where the sign is constant, simplifying each interval separately.</description>\n  <example>For ∑ₙ₌₁^∞ (sgn(sin(2ⁿ)))/2ⁿ, identify n₀ such that sin(2ⁿ) changes sign at n₀, then write ∑ₙ₌₁^∞ = ∑ₙ₌₁^{n₀–1} + ∑ₙ₌n₀^∞, each with constant sgn(sin(2ⁿ)).</example>\n</note2>\n  <description>Use the periodicity of the inner function to reduce the problem to a finite analysis on one period. For trigonometric signs, the sign repeats every period, so you only need to analyze one full cycle.</description>\n  <example>Since sin(2ⁿ) has period T (where 2ⁿ₊T = 2ⁿ + 2π), analyze its sign over n in [0, T–1]. Once you know the sign pattern, extend it by periodicity.</example>\n</note3>\n  <description>Apply the ratio test or root test to a series of the form ∑ aₙ/2ⁿ. Compute lim sup |aₙ/2ⁿ|^(1/n) or |aₙ/2ⁿ| to show convergence via the geometric decay of 2⁻ⁿ.</description>\n  <example>Check ∑ₙ₌N^∞ |(sgn(sin(2ⁿ)))/2ⁿ| by observing |aₙ| ≤ 1, so lim sup |aₙ/2ⁿ|^(1/n) ≤ (1/2) &lt; 1, ensuring convergence.</example>\n</note4>\n  <description>Use the telescoping property when the sign flips predictably. If the sign alternates between two constant values in a block, the series can telescope into a finite sum of those values.</description>\n  <example>If in [n₀, n₁–1] sgn(sin(2ⁿ)) alternates between +1 and –1, then ∑ₙ₌n₀^{n₁–1} (sgn(sin(2ⁿ)))/2ⁿ = (1/2ⁿ₀ – 1/2ⁿ₁). Sum similar blocks to telescope.</example>\n</note5>\n  <description>Estimate the tail of the series using bounds on the sign function. Since |sgn(sin(2ⁿ))| ≤ 1, bound the tail ∑ₙ₌N^∞ |aₙ| by ∑ₙ₌N^∞ 1/2ⁿ to show it is arbitrarily small.</description>\n  <example>For N large, ∑ₙ₌N^∞ |(sgn(sin(2ⁿ)))/2ⁿ| ≤ ∑ₙ₌N^∞ 1/2ⁿ = 1/2^{N–1}, which can be made less than any ε by choosing N large enough.</example>", "<note1>\n  <description>Use the periodicity of the sine function to determine the sign of sin(x) by reducing x modulo 2π. Since sin(x)=sin(x+2πk) for any integer k, you only need to check the value of x modulo 2π.</description>\n  <example>To find the sign of sin(100), compute 100 mod 2π ≈ 100 mod 6.283 ≈ 1.436. Since 1.436 is positive, sin(100) is positive.</example>\n</note2>\n  <description>Identify the sign pattern of sin(x) over one full period [0,2π] by noting where sin(x) is positive (on (0,π)) and negative (on (π,2π)). This lets you predict the sign of sin(x) for any x without computing the full value.</description>\n  <example>On the interval [0,2π], sin(x) is positive from x=0 to x=π and negative from x=π to x=2π. Thus, for any x in (0,π), sin(x)&gt;0; for x in (π,2π), sin(x)&lt;0.</example>\n</note3>\n  <description>Convert a sequence of sine signs into a binary-like sequence by assigning 1 for positive and -1 for negative. This transforms a trigonometric problem into a problem involving ±1 terms, which can be easier to analyze or sum.</description>\n  <example>If you have values sin(a), sin(b), sin(c) with signs +, -, +, you replace them with the sequence [1, -1, 1]. You can then treat this sequence as a binary sequence {±1}.</example>\n</note4>\n  <description>Use a geometric series or related convergence test on a series ∑ a_n / r^n by checking that |a_n| ≤ M for some constant M. If the sequence {a_n} is bounded, then ∑ a_n / r^n converges by comparison to ∑ M / r^n.</description>\n  <example>For a_n = ±1, we have |a_n| ≤ 1. Therefore, ∑ a_n / 2^n converges because ∑ 1/2^n converges, and the boundedness ensures absolute convergence.</example>\n</note5>\n  <description>Apply the alternating series test to a series ∑ (–1)^n b_n when b_n is positive and decreasing to zero. This guarantees that the series converges, even if the terms alternate in sign.</description>\n  <example>Consider ∑ (–1)^n / n. Here b_n = 1/n is positive, decreasing, and lim_{n→∞} 1/n = 0, so by the alternating series test the series converges.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 8, "abstractions": ["<note1>\n  <description>\nUse Lagrange interpolation to construct the unique degree-d polynomial passing through given points.  For points (x_i,y_i), define the basis polynomials L_i(x)=∏_{j≠i}(x–x_j)/∏_{j≠i}(x_i–x_j).  Then f(x)=∑y_i·L_i(x).\n</description>\n  <example>\nTo find the degree-2 polynomial through (0,1),(1,0),(2,1), compute L_0(x)=(x–1)(x–2)/((0–1)(0–2)), L_1(x)=(x–0)(x–2)/((1–0)(1–2)), L_2(x)=(x–0)(x–1)/((2–0)(2–1)).  Then f(x)=1·L_0(x)+0·L_1(x)+1·L_2(x).\n</example>\n</note1>\n<note2>\n  <description>\nFor a polynomial of degree d with integer coefficients, the coefficient of x^k (for k&gt;d) is the coefficient of x^k in the expansion of the generating function P(x)=∑_{i=0}^d a_i x^i.  To extract it, multiply by x^m and differentiate m times, then evaluate at x=0.\n</description>\n  <example>\nGiven P(x)=1+2x+3x^2, the coefficient of x^3 in P(x)·x^2 is the coefficient of x^5 in P(x).  Compute P^{(5)}(0)/5! to get 1·1+2·5+3·10=1+10+30=41, then divide by 5!=120 to get 41/120.\n</example>\n</note3>\n<note3>\n  <description>\nWhen coefficients are taken modulo a prime p, the product rule and binomial theorem hold modulo p.  In particular, ∏_{i=1}^p (x–i)≡x^p–x (mod p) by Fermat’s little theorem.  Use this to simplify high-degree products.\n</description>\n  <example>\nOver F_7, ∏_{i=1}^7 (x–i)≡x^7–x≡x–x≡0 (mod 7).  Thus any term of the form ∏_{i=1}^7 (x–i) can be replaced by 0 mod 7, simplifying polynomial expressions.\n</example>\n</note4>\n<note4>\n  <description>\nExtract the coefficient of x^k from a polynomial by expanding it in a power series or by using the binomial theorem.  For F(x)=∑_{j=0}^d a_j x^j, the coefficient of x^k in F(x)·x^m is ∑_{j=0}^{k–m} a_{k–m–j} (if k≥m, otherwise 0).\n</description>\n  <example>\nLet F(x)=1+2x+3x^2.  The coefficient of x^3 in F(x)·x^2 is a_1 (since 3–2=1), which is 2.  If instead we wanted x^4, it would be a_2=3.\n</example>\n</note5>\n<note5>\n  <description>\nTo find the unique r in [0,p–1] such that a–r·b≡0 (mod p), solve r≡a·b^{–1} (mod p).  Compute the modular inverse of b via extended Euclid or Fermat’s little theorem (b^{p–2} mod p) and multiply by a.\n</description>\n  <example>\nLet a=5, b=3, p=7.  Compute b^{p–2}=3^5=243≡5 (mod 7).  Then r≡5·5≡25≡4 (mod 7), so r=4 is the unique solution in [0,6].\n</example>\n</note6>", "<note1>\n  <description>Polynomial interpolation via finite differences: For a polynomial of degree d on d+1 points, the d-th finite difference is constant. This yields a recurrence on the values and determines the polynomial uniquely.</description>\n  <example>Given a polynomial of degree 3 on 4 points, compute the first, second, and third differences at those points; the third difference is constant, confirming the degree and enabling reconstruction of the polynomial.</example>\n</note1>\n<note2>\n  <description>Newton’s backward interpolation: Express the polynomial in terms of backward differences at the last point. The coefficient of x^k is given by the k-th backward difference divided by k!.</description>\n  <example>To find the coefficient of x^2 in a degree-3 polynomial at point x_4, compute the second backward difference at x_4 and divide by 2!; this yields the desired coefficient.</example>\n</note3>\n<note4>\n  <description>Auxiliary polynomial construction: Define g(x) = f(x) – L(x), where L(x) is the Lagrange interpolation through the same points. Then g vanishes at all data points, so g must be the zero polynomial or a multiple of (x–x_1)…(x–x_{n+1}).</description>\n  <example>If f interpolates a degree-d polynomial on n+1 points, set g(x)=f(x)–L(x); since g vanishes at n+1 points, g(x)=C·(x–x_1)…(x–x_{n+1}). If C=0, then f equals L exactly.</example>\n</note5>\n<note6>\n  <description>Finite field arithmetic: In a prime field F_p, the difference between a numerator a and b·r (where gcd(a,b)=1) is divisible by p iff a⁻¹·(a–b·r) is an integer in [0,p–1]. One can compute this by modular inversion.</description>\n  <example>To find r such that a–b·r≡0 mod p, compute r ≡ a·b⁻¹ mod p, then check that a–b·r lies in [0,p–1].</example>", "<note1>\n  <description>Constructing a degree-≤N polynomial matching N+1 values uses the Lagrange interpolation formula:  \nf(x)=∑_{i=1}^{N+1}y_i·∏_{j≠i}(x–x_j)/∏_{j≠i}(x_i–x_j).  \nThis directly yields the unique polynomial through given points.</description>\n  <example>Given points (1,2),(3,5),(4,7), the degree-2 polynomial is  \nf(x)=2·(x–3)(x–4)/((1–3)(1–4)) +5·(x–1)(x–4)/((3–1)(3–4)) +7·(x–1)(x–3)/((4–1)(4–3)).  \nThis expands to a quadratic that passes through all three points.</example>\n</note1>\n<note2>\n  <description>When x_i are integers, the denominators ∏_{j≠i}(x_i–x_j) are integers. Thus the Lagrange coefficients y_i·∏…/∏… are rational numbers with integer numerators and denominators coprime to the moduli in question.</description>\n  <example>For points (a,b),(c,d),(e,f), the coefficient of x at (a,b) is  \nb·(x–c)(x–e)/((a–c)(a–e)),  \nwhose denominator divides (a–c)(a–e), so it is an integer when reduced mod any modulus coprime to that denominator.</example>\n</note3>\n<note3>\n  <description>Modular reduction of polynomials can be done term by term modulo a prime p:  \ncoeff(x^k) mod p = (coeff(x^k)) mod p.  \nThis allows computing high-degree polynomial coefficients modulo p without full expansion.</description>\n  <example>Given f(x)=x^4+3x^3+5x^2+7x+11, to find the coefficient of x^3 mod 7, reduce 3 mod 7 to get 3, so the coefficient of x^3 mod 7 is 3.</example>\n</note4>\n<note4>\n  <description>In a finite field of prime order p, the product of nonzero residues (1·2·…·(p–1))=–1 mod p. Thus ∏_{j≠i}(x_i–x_j) mod p is invertible if x_i run over a complete set of residues mod p.</description>\n  <example>For p=11 and x_i=1,2,3,4,5,6,7,8,9,10, the product ∏_{j≠i}(x_i–x_j) mod 11 is invertible, so each Lagrange coefficient is a well-defined element of the field.</example>\n</note5>\n<note5>\n  <description>Given a rational coefficient a/b in lowest terms and a prime modulus p, finding r≡a·b^{–1} mod p (where b^{–1} exists) yields a·b^{–1}≡a mod p. One can then choose r in [0,p–1] to satisfy a–r·b≡0 mod p.</description>\n  <example>If a/b=3/4 mod 7, then b^{–1}=2 since 4·2=8≡1 mod 7. So r≡3·2=6 mod 7, and indeed 3–6·4=3–24=–21≡0 mod 7.</example>", "<note1>\n  <description>Construct the unique degree- at most n polynomial that equals a given sequence {aₖ} on the points k = 0,1,…,n by forming the Lagrange basis polynomials Lₖ(x)=∏_{j≠k}(x−j)/(k−j). Then f(x)=∑ₖ aₖ·Lₖ(x). This works because each Lₖ is 1 at index k and 0 at all other indices.</description>\n  <example>For n=2, define L₀(x)=(x−1)(x−2)/((0−1)(0−2)), L₁(x)=(x−0)(x−2)/((1−0)(1−2)), L₂(x)=(x−0)(x−1)/((2−0)(2−1)). Then a₀L₀ + a₁L₁ + a₂L₂ gives the unique quadratic through (0,a₀),(1,a₁),(2,a₂).</example>\n</note2>\n  <description>When computing coefficients in the Lagrange basis, the denominator product ∏_{j≠k}(k−j) is the factorial k!. Hence each Lₖ has leading coefficient 1/k! in the monomial basis, and the leading coefficient of ∑aₖLₖ is ∑aₖ/k!. This simplifies the leading term without full expansion.</description>\n  <example>For n=3, the leading coefficient of f(x)=∑aₖLₖ(x) is a₀/0! + a₁/1! + a₂/2! + a₃/3! = a₀ + a₁/1 + a₂/2 + a₃/6, so f(x) has degree ≤3.</example>\n</note3>\n  <description>For a polynomial f of degree ≤n, the value f(0) is the alternating sum of its coefficients in the monomial basis: f(0)=∑_{i=0}^n (−1)^i·c_i with c_i the coefficient of x^i. Use this to relate known values at x=0 to unknown coefficients.</description>\n  <example>If f(x)=c₀ + c₁x + c₂x² + c₃x³, then f(0)=c₀. Also f(1)=c₀+c₁+c₂+c₃ and f(−1)=c₀−c₁+c₂−c₃, giving a system to solve for c_i.</example>\n</note4>\n  <description>When coefficients are rational numbers with a common denominator, their integer combination A·c₁ + B·c₂ is divisible by a prime p if and only if A·c₁ ≡ B·c₂ (mod p). One can solve for the integer r such that A−rB is divisible by p by inverting A modulo p and checking equivalence.</description>\n  <example>Suppose c₁ = α/p and c₂ = β/p with gcd(α,p)=1. Then A·c₁ + B·c₂ = (Aα + Bβ)/p. For this to be an integer, Aα + Bβ ≡ 0 (mod p). Solve Aα ≡ −Bβ (mod p) to find r≡(−Bβ)·A⁻¹ (mod p).</example>\n</note5>\n  <description>Interpret the polynomial f(x) as a sequence f(n) for n=0,1,…,n. Then f(x) can be seen as a generating function for the sequence. Computing f(0) or f(1) gives linear combinations of its coefficients, which can be used to solve for unknown coefficients or to test divisibility properties.</description>\n  <example>Let f(x)=c₀ + c₁x + c₂x². Then f(0)=c₀ and f(1)=c₀+c₁+c₂. If you know f(0) and f(1), you can set up two equations to solve for c₀ and c₁, then verify c₂ from f(2)=c₀+c₁·2+c₂. This approach generalizes to higher-degree polynomials.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 9, "abstractions": ["<note1>\n  <description>For a cyclic system of the form x² = y + k, y² = z + k, z² = x + k, summing all equations yields (x+y+z)² = x+y+z + 3k. This relation is a key starting point for finding the sum S = x+y+z.</description>\n  <example>Suppose x² = y + 2, y² = z + 2, z² = x + 2. Summing gives (x+y+z)² = x+y+z + 6, so S² = S + 6. Thus the sum S satisfies a simple quadratic in S.</example>\n</note1>\n<note2>\n  <description>After obtaining S² = S + 3k, form the quadratic S² − S − 3k = 0 and solve for S. The two roots are the only possible values for the sum of the variables.</description>\n  <example>From S² = S + 6, rewrite as S² − S − 6 = 0. The solutions are S = (1 ± √(1 + 24))/2 = (1 ± 5)/2, so S = 3 or S = −2.</example>\n</note2>\n<note3>\n  <description>Use the identity (x+y+z)³ = x³ + y³ + z³ + 3(x+y+z)(xy+yz+zx) − 3xyz combined with the given relations to compute the elementary symmetric sum T = xy + yz + zx. This step yields T in terms of S and known constants.</description>\n  <example>Given x² = y + 2, y² = z + 2, z² = x + 2, one shows x³ = 2x − xy − 2, etc. Summing gives (x+y+z)³ = (x+y+z) + 3T − 3xyz. Substituting S = 3 or S = −2 and known xyz yields T for each case.</example>\n</note3>\n<note4>\n  <description>Verify that each candidate sum S satisfies the original equations by substituting back into the cyclic relations. This step ensures no extraneous or invalid solutions are accepted.</description>\n  <example>After finding S = 3 and S = −2, substitute into (x+y+z)² = x+y+z + 6. For S = 3: 9 = 3 + 6 holds, for S = −2: 4 = −2 + 6 also holds. Both are valid.</example>\n</note5>\n<note6>\n  <description>When the system is symmetric and cyclic, distinctness of the variables often forces the sum to lie in a finite set. Use the fact that any real or complex cyclic triple with pairwise distinct values typically yields only two possible sums.</description>\n  <example>In the general case, the sum of three distinct solutions to x² = y + k, y² = z + k, z² = x + k is either 3 or −2. Thus one need only check these two cases rather than all possible sums.</example>\n</note6>", "<note1>\n  <description>\n    When a system of equations relates each variable to a power of another, summing the three equations often collapses to a single polynomial in the sum S = a + b + c, since each a², b², c², and a + b + c appears once. This reduces the system to a single equation in S.\n  </description>\n  <example>\n    Given a² = b + 6, b² = c + 6, and c² = a + 6, adding yields a² + b² + c² = (a + b + c) + 18. Defining S = a + b + c, the equation becomes a² + b² + c² = S + 18, which can be further simplified using known identities.\n  </example>\n</note1>\n<note2>\n  <description>\n    Use the identity a² + b² + c² = (a + b + c)² – 2(ab + bc + ca) to convert sums of squares into expressions involving S = a + b + c and the product sum P = ab + bc + ca. This transforms a² + b² + c² into a quadratic in S.\n  </description>\n  <example>\n    From a² + b² + c² = S + 18 and the identity a² + b² + c² = S² – 2P, set S² – 2P = S + 18. You now have one equation in S and P, reducing the system to two unknowns.\n  </example>\n</note2>\n<note3>\n  <description>\n    Introduce the product-sum Q = abc and apply the identity a³ + b³ + c³ = (a + b + c)³ – 3(a + b + c)(ab + bc + ca) + 3abc. This gives a³ + b³ + c³ in terms of S, P, and Q, linking the sum of cubes to the sums of lower powers.\n  </description>\n  <example>\n    If a³ + b³ + c³ = S + 54, then S³ – 3SP + 3Q = S + 54. With S and P known from earlier steps, this yields an equation in Q, allowing computation of the product abc.\n  </example>\n</note3>\n<note4>\n  <description>\n    To find S, substitute the expression for P from the quadratic in S into the cubic identity and solve for S. This typically leads to a quadratic equation in S, whose two roots correspond to the possible sums a + b + c.\n  </description>\n  <example>\n    From S² – 2P = S + 18 and P = (S² – 18 – S)/2, substitute into S³ – 3SP + 3Q = S + 54 to obtain a quadratic in S. Solving yields two possible values for S.\n  </example>\n</note4>\n<note5>\n  <description>\n    Always check the discriminant of the resulting quadratic for S to ensure real or complex solutions, and verify that the chosen roots satisfy the original equations. Discard any root that leads to contradictions (e.g., variable collision, negative discriminant when real solutions are expected).\n  </description>\n  <example>\n    After solving S² – kS + m = 0, compute Δ = k² – 4m. If Δ ≥ 0, both roots are real; if Δ &lt; 0, they are complex. Substitute each back into the original relations to confirm validity.\n  </example>\n</note5>", "<note1>\n  <description>When you have a cyclic system of equations of the form X_i² = X_{i+1} + k, summing over all variables yields ∑X_i² = ∑X_{i+1} + nk, which simplifies due to cyclic shift. This reduces the system to one equation in the sum.</description>\n  <example>For variables X, Y, Z satisfying X² = Y + 5, Y² = Z + 5, Z² = X + 5, adding gives X² + Y² + Z² = Y + Z + X + 15, so (X + Y + Z)² – 2(X+Y+Z) = (X+Y+Z) + 15.</example>\n</note2>\n  <description>Introduce S = X + Y + Z and P = XY + YZ + ZX to convert symmetric sums into a single-variable polynomial. This leverages the identities ∑X² = S² – 2P and ∑XY = P to form an algebraic equation in S and P.</description>\n  <example>From (X+Y+Z)² – 2(XY+YZ+ZX) = (X+Y+Z) + 15, set S = X+Y+Z and P = XY+YZ+ZX to get S² – 2P = S + 15, a relation between S and P.</example>\n</note3>\n  <description>Use the product of the original equations: (X²)(Y²)(Z²) = (X+6)(Y+6)(Z+6). This expands to a polynomial in S and P, linking S and P in another equation. Solving the two equations yields the possible values of S.</description>\n  <example>With (X²Y²Z²) = (X+6)(Y+6)(Z+6), expand RHS in terms of S and P to get a polynomial in S and P, then solve together with S² – 2P = S + 15 to find S.</example>\n</note4>\n  <description>Apply Vieta’s formula on the polynomial whose roots are the variables: if the polynomial is t³ – St² + P t – Q = 0, then the sum of roots is S. Finding S from the above relations gives the sum directly.</description>\n  <example>After finding S from S² – 2P = S + 15, substitute into t³ – S t² + P t – Q = 0 and verify that S = X + Y + Z is consistent with the polynomial’s root sum.</example>\n</note5>\n  <description>Check for extraneous roots by substituting candidate sums S back into the original cyclic equations. Discard any S that fails to satisfy at least one equation, ensuring only valid solutions remain.</description>\n  <example>For each candidate S found, solve the system for X, Y, Z using S and P, then verify that each X, Y, Z satisfies its corresponding equation; any that fail are rejected.</example>", "<note1>\n  <description>When a system of equations has the same cyclic form for each variable, introduce the sum S and product P of the variables. Then replace expressions like x² + y² + z² with S² – 2P and x³ + y³ + z³ with S³ – 3SP + 3P, reducing the system to algebraic equations in S and P.</description>\n  <example>For variables u, v, w satisfying u² = v + 1, v² = w + 1, w² = u + 1, summing yields u² + v² + w² = (u + v + w) + 3. Substitute u² + v² + w² = S² – 2P to get S² – 2P = S + 3, a single equation in S and P.</example>\n</note1>\n<note2>\n  <description>Use Vieta’s relations for the polynomial whose roots are the variables. If x satisfies x² = y + k and similarly for y, z, then x satisfies a quadratic whose coefficients depend on S = x+y+z, P = xy+yz+zx. Solving that quadratic gives expressions for x in terms of S and P.</description>\n  <example>Given x² = y + k and y² = z + k, one finds x satisfies x² – Sx + (P – 2k) = 0. Substituting x = y + k and y = z + k leads to a quadratic in S and P from which S and P can be determined.</example>\n</note2>\n<note3>\n  <description>Eliminate one variable by substitution or symmetric elimination to obtain a univariate polynomial. Solve that polynomial to find the possible sums S of the variables directly, avoiding explicit computation of each variable.</description>\n  <example>From u² = v + k and v² = u + k, eliminate v by writing v = u² – k and substituting into v² = u + k to get a quartic in u. Summing the four roots gives the sum of all u-values, which is S.</example>\n</note3>\n<note4>\n  <description>Check that the roots you find correspond to distinct complex numbers by using their pairwise differences. If two roots coincide, substitute back into the original equations to detect inconsistency.</description>\n  <example>If you find S = 3 and P = 2, check that the corresponding roots x, y, z are distinct by ensuring x – y ≠ 0, y – z ≠ 0, and z – x ≠ 0. If any difference is zero, discard that case.</example>\n</note4>\n<note5>\n  <description>Always verify that the solutions satisfy the original equations and any additional conditions (e.g., pairwise distinctness). This step catches extraneous or invalid algebraic solutions.</description>\n  <example>After finding S = 3 and P = 2, reconstruct x, y, z from Vieta’s formulas. Substitute each back into x² = y + k to confirm equality holds for all three, and ensure no variable equals another.</example>\n</note5>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 10, "abstractions": ["<note1>\n  <description>When arranging n elements in a circle, any rotation creates an identical configuration, so divide the linear count of permutations by n. For labeled elements, there are (n–1)! distinct circular orders.</description>\n  <example>For 5 distinct items around a round table, fix one item to break symmetry, then arrange the remaining 4 in 4! ways, giving 24 circular arrangements.</example>\n</note1>\n<note2>\n  <description>When adjacency constraints restrict which items can sit next to each other, model the problem as finding a Hamiltonian cycle in a graph whose vertices are the items and edges represent allowed adjacencies. The number of cycles equals the number of ways to traverse all vertices once and return to the start.</description>\n  <example>Given items A,B,C,D with edges A–B, B–C, C–D, D–A, the only Hamiltonian cycle is A–B–C–D–A, so there is exactly one valid linear ordering under those constraints.</example>\n</note2>\n<note3>\n  <description>To count circular permutations with two-way adjacency constraints, first list all valid linear sequences (via backtracking or DP), then rotate each sequence by all shifts to form distinct circular orders. This avoids overcounting rotations but may include reflections.</description>\n  <example>For 4 items with constraints, first find all valid linear orders (e.g. 2 of them), then rotate each by 0,1,2,3 positions to get all 8 circular arrangements.</example>\n</note3>\n<note4>\n  <description>When reflections (mirror images) of a circular arrangement are considered the same, impose an additional constraint by requiring the first half of the sequence to be a palindrome. This halves the count of valid circular orders.</description>\n  <example>For a 6-item circle, fix the first 3 items; the last 3 are determined by the mirror. Thus valid circular orders reduce to counting palindromic triples for the first half.</example>\n</note4>\n<note5>\n  <description>Use inclusion–exclusion to count circular arrangements that avoid forbidden adjacencies. First count all circular permutations, then subtract those containing at least one forbidden pair, add back those with two forbidden pairs, and so on.</description>\n  <example>For 4 items with one forbidden adjacency A–B, total circular orders are 6. Subtract arrangements where A and B are adjacent, then adjust for overcounting via inclusion–exclusion to get the final count.</example>\n</note5>", "<note1>\n  <description>When arranging objects around a circle, count permutations by (n–1)! for n distinct items. This accounts for rotational symmetry by fixing one reference element.</description>\n  <example>For 4 distinct symbols, fix one symbol at a spot. The remaining 3 can be arranged in 3! = 6 ways, giving 6 circular arrangements.</example>\n</note1>\n<note2>\n  <description>Apply adjacency constraints by selecting valid neighbor pairs first, then arranging them. Build the sequence locally by iterating over possible neighbors and pruning invalid choices.</description>\n  <example>To place 3 items A, B, C so that A and B are adjacent, treat AB as a block. Permute the block with C: 2! = 2 ways, then account for internal order of AB (2 ways), totaling 4 valid arrangements.</example>\n</note2>\n<note3>\n  <description>Use inclusion–exclusion to handle multiple overlapping constraints. Count total arrangements, subtract those violating one constraint, add back overlaps, and so on.</description>\n  <example>For 3 items A, B, C with the rule “A next to B,” total permutations = 3! = 6. Subtract arrangements where AB is not adjacent: 2! = 2, giving 4 valid.</example>\n</note3>\n<note4>\n  <description>Model adjacency as a graph: each item is a vertex, edges connect valid pairs. Count Hamiltonian cycles in this graph to enumerate valid circular arrangements.</description>\n  <example>With vertices {A,B,C} and edges AB, AC, BC, the number of distinct Hamiltonian cycles (each vertex visited once) is (3–1)! = 2, corresponding to the two possible cycles A→B→C→A and A→C→B→A.</example>\n</note4>\n<note5>\n  <description>When constraints are symmetric across the circle, group equivalent cases and multiply by the number of groups. This reduces redundant checks.</description>\n  <example>For 5 symbols where the rule “X next to Y” is symmetric, count arrangements fixing X and Y adjacent, then multiply by 2 to account for the two symmetric roles of X and Y.</example>\n</note5>", "<note1>\n  <description>Convert adjacency constraints on products to a graph where vertices are elements and edges connect pairs whose product is ≤20. This turns the problem into finding a Hamiltonian cycle in the graph.</description>\n  <example>Given numbers {a,b,c,d}, if ab≤20, ac≤20, ad≤20, bc≤20, bd≤20, and cd≤20, draw edges between each pair. A cycle through all vertices corresponds to an arrangement meeting the adjacency constraint.</example>\n</note1>\n<note2>\n  <description>Use the fact that in a circular arrangement, any two arrangements that differ by a rotation or reflection are equivalent. When counting cycles, divide by the size of the symmetry group (e.g. order of the cyclic group and reflections).</description>\n  <example>For a cycle of length n, there are n rotations and n reflections, so total distinct arrangements = (number of labeled cycles) / (2n).</example>\n</note2>\n<note3>\n  <description>Apply the adjacency-product bound to eliminate impossible adjacent pairs. For each element, list its allowed neighbors, reducing the search space and simplifying cycle enumeration.</description>\n  <example>If 5 only pairs with 2, 3, and 4, then any cycle must have 5 adjacent to one of these three, cutting down the branching factor in the search.</example>\n</note3>\n<note4>\n  <description>Use backtracking with degree-based pruning: always choose the vertex with the fewest remaining neighbors next, and backtrack early when no valid neighbor remains. This heuristic speeds up the search for Hamiltonian cycles.</description>\n  <example>Start at a vertex of degree 2, try its two neighbors in turn, and if neither leads to a valid cycle, backtrack immediately rather than exploring further choices.</example>\n</note4>\n<note5>\n  <description>Exploit symmetries by fixing one element at a reference position (e.g. “1” at the top) to reduce equivalent cycles. This avoids redundant enumeration of rotations.</description>\n  <example>Place 1 at position 1, then search for cycles among the remaining n−1 elements, knowing any rotation of a valid cycle can be obtained by repositioning the fixed element.</example>\n</note5>", "<note1>\n  <description>Many circular arrangement problems require fixing one element to break rotational symmetry. Choose a reference point to reduce the problem to a linear permutation of the remaining elements.</description>\n  <example>For arranging n distinct items around a circle, fix item A at a specific position. Then count permutations of the other n–1 items in a line, which yields (n–1)! total arrangements.</example>\n</note2>\n<note3>\n  <description>When adjacency constraints exist, model the problem as a graph where each vertex represents an element and edges represent allowed adjacencies. A valid arrangement corresponds to a Hamiltonian cycle in this graph.</description>\n  <example>Given elements {A,B,C,D} with allowed pairs (A–B), (B–C), (C–D), (D–A), the graph is a cycle graph on 4 vertices. The number of distinct cycles is (4–1)! = 6, matching the valid orderings.</example>\n</note3>\n<note4>\n  <description>Use the product (or sum) constraint to generate a list of allowed adjacent pairs. For each element, list its neighbors that satisfy the condition, then build adjacency lists or matrices for further analysis.</description>\n  <example>For numbers 1 through 5 with adjacency constraint that their product ≤ 8, list neighbors of 1 as {1,2,3}, of 2 as {1,2,3,4}, etc. This adjacency data can be used to count valid circular or linear arrangements.</example>\n</note4>\n<note5>\n  <description>Apply casework by fixing the first element and then enumerating valid neighbors for each step. Multiply the number of choices at each step or use inclusion-exclusion to count all sequences.</description>\n  <example>Fix element A first. If it has 3 valid neighbors, place each neighbor next and, for each choice, count the remaining valid neighbors for the next position. Summing over all choices yields the total count.</example>\n</note5>\n<note6>\n  <description>When rotations or reflections are considered distinct, avoid dividing by n or 2n. Always count each distinct arrangement as unique, preserving all symmetries.</description>\n  <example>For a circular seating of 6 people where rotations and reflections differ, count all 6! = 720 seatings without further adjustment, since no symmetry is imposed.</example>\n</note6>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 11, "abstractions": ["<note1>\n  <description>Model the grid as a graph and the removal of lily pads as deleting vertices. Count the number of ways to delete k vertices so that two specified vertices remain connected. This reduces a geometric removal problem to a graph connectivity question.</description>\n  <example>In a 4×4 grid graph, to ensure the bottom-left and top-right vertices stay connected after deleting 4 other vertices, list all ways to delete 4 vertices and check each deletion leaves a path between the endpoints. The total valid deletions is the count of those that maintain connectivity.</example>\n</note1>\n<note2>\n  <description>When forbidden moves form a subgraph blocking a path, count the number of vertex-deletion sets that preserve connectivity by subtracting the number of forbidden-deletion sets from the total. This uses the principle of complementary counting on connectivity.</description>\n  <example>In a 4×4 grid, suppose 5 vertices form an L-shaped block that, if removed, separates the two endpoints. First count all ways to remove 5 vertices, then subtract the number of ways to remove the L-block and any other vertices, giving the count of removals that keep the path intact.</example>\n</note3>\n<note4>\n  <description>Use inclusion-exclusion to count deletions that avoid disconnecting the graph: sum over all forbidden subsets the count of deletions containing them, alternating signs. This handles overlaps where multiple forbidden sets can occur simultaneously.</description>\n  <example>To count removals of 4 vertices that avoid disconnecting two specified nodes, start with total C(16,4). Subtract C(f1,4) for each forbidden set f1 of size 4, add back C(f1∪f2,4) for intersections of two forbidden sets, and so on.</example>\n</note5>\n<note6>\n  <description>Exploit symmetry by partitioning deletions into orbits under the grid’s automorphism group. Count one representative from each orbit and multiply by the orbit size to avoid redundant work and ensure uniform treatment of symmetric cases.</description>\n  <example>In a 3×3 grid, the four corner vertices form one orbit under rotations and reflections. Compute the number of valid deletions for the top-left corner and multiply by 4, then handle the center and edges similarly by their own symmetry classes.</example>\n</note6>", "<note1>\n  <description>\n    Use the determinant formula for the number of lattice paths from (0,0) to (n,n) that avoid a forbidden set of points. It expresses the count as a product of factorials over a determinant of binomial coefficients, where rows and columns are indexed by forbidden points.\n  </description>\n  <example>\n    For a grid of size n and no forbidden points, the determinant formula simplifies to (n!)² / n!. For n=2, it gives 2 paths. If one point is removed, the determinant becomes a 2×2 matrix whose determinant gives the adjusted count.\n  </example>\n</note1>\n<note2>\n  <description>\n    Apply the reflection principle by reflecting the forbidden point across the boundary to count paths that touch it. Compute the total number of paths without restriction, subtract the number of paths that hit the forbidden point by reflecting the endpoint past the boundary.\n  </description>\n  <example>\n    In a 2×2 grid with a forbidden point on the main diagonal, total paths are 6. Reflecting the endpoint of any path that touches the forbidden point across that diagonal yields a path to (2,0) or (0,2), so subtract twice the number of paths to those reflected points.\n  </example>\n</note2>\n<note3>\n  <description>\n    Count the total number of ways to choose k forbidden points from a grid of size m×m by using binomial coefficients: C(m², k). This gives the number of subsets of size k before any restrictions are applied.\n  </description>\n  <example>\n    In a 3×3 grid, the total number of ways to remove 4 lily pads is C(9, 4) = 126. Each subset is considered in turn when applying further path-counting constraints.\n  </example>\n</note3>\n<note4>\n  <description>\n    Use complementary counting: compute the total number of forbidden-sets and subtract the number of sets that allow a valid path from start to finish. This often simplifies by counting those that forbid the key path.\n  </description>\n  <example>\n    With 126 total subsets, if 50 of them leave a direct path open, then 76 forbid the key path. Thus the number of forbidden-sets leading to no path is 126 − 50 = 76.\n  </example>\n</note4>\n<note5>\n  <description>\n    Employ dynamic programming on the grid to count paths avoiding a set of forbidden points. Initialize a DP table for paths ending at each cell, propagate values by summing from adjacent cells, and ignore cells marked forbidden.\n  </description>\n  <example>\n    For a 3×3 grid with one forbidden point at (1,1), initialize dp[0,0]=1. Then dp[i,j] = dp[i−1,j] + dp[i,j−1] if (i,j) is not forbidden; otherwise dp[i,j]=0. Summing dp[2,2] gives the number of valid paths.\n  </example>\n</note5>", "<note1>\n  <description>When counting paths on a grid with obstacles, use dynamic programming: let dp[i][j] be the number of ways to reach cell (i,j) without stepping into any blocked cell. Initialize dp[0][0]=1 if unblocked, otherwise 0. Then dp[i][j]=dp[i−1][j]+dp[i][j−1] for adjacent cells. This builds the total number of valid paths from start to end.</description>\n  <example>On a 2×2 grid with no blocks, dp[0][0]=1, dp[1][0]=1, dp[0][1]=1, dp[1][1]=dp[0][1]+dp[1][0]=2, giving 2 paths. If cell (1,1) is blocked, dp[1][1]=0, so only the two direct paths remain.</example>\n</note1>\n<note2>\n  <description>Apply casework by choosing where to block the critical path segments. Partition the set of all allowed placements of blocks into disjoint categories based on how many or which cells are removed from key segments (e.g. the diagonal or row/column). Count each category separately, ensuring no overlap.</description>\n  <example>On a 3×3 grid, to block the main diagonal, choose 2 out of 3 diagonal cells to remove. If you block the first two diagonal cells, then the only remaining cell on that diagonal is the corner, and the start cannot reach the end via that diagonal. Sum over all choices of which two cells you block.</example>\n</note2>\n<ernote3>\n  <description>Use inclusion–exclusion to count configurations that avoid multiple forbidden paths. Start by counting all ways to place k blocks, then subtract those that block at least one forbidden route, add back those that block two, and so on. This ensures you don’t double-count configurations that block multiple routes.</description>\n  <example>Suppose you want to place 2 blocks so that neither of two different paths from start to finish is blocked. Count all C(N,2) placements, subtract the number of placements that block path A, subtract those that block path B, then add back those that block both A and B.</example>\n</note3>\n<note4>\n  <description>Exploit symmetry of the grid to reduce work. If the grid or problem is symmetric under reflection or rotation, you can count one representative class of configurations and multiply by the number of symmetric classes. This cuts down on redundant casework.</description>\n  <example>On a 3×3 grid, the four corners are symmetric under 180° rotation. If you count the number of ways to remove k blocks so that a specific corner pattern stays unblocked, multiply that count by 4 to account for all corner positions.</example>\n</note4>\n<note5>\n  <description>Implement a backtracking (DFS) approach with pruning: try placing each block one by one, and at each step check if the current partial configuration blocks the start–end path. If it does, backtrack; otherwise continue. This avoids exploring invalid configurations early.</description>\n  <example>On a 3×3 grid with 2 blocks to place, start at the empty grid. Try placing block 1 in each empty cell, then for each placement try block 2 in each remaining empty cell. If at any point the start–end path is blocked, discard that branch and backtrack.</example>\n</note5>", "<note1>\n  <description>Model the grid as a graph and the removal of lily pads as deleting vertices. Use the adjacency relationships to determine which vertices remain reachable. This converts the geometric removal problem into a graph connectivity problem.</description>\n  <example>On a 2×2 grid, remove three vertices so that the bottom-left and top-right remain. Model the grid as a 4-vertex graph with edges between adjacent vertices. Deleting any edge or vertex that disconnects the two corners yields a configuration where they are no longer reachable.</example>\n</note1>\n<note2>\n  <description>Compute the number of ways to choose which vertices to remove using combinations: for k removals on n vertices, there are C(n, k) total choices. This counts all possible subsets of size k before imposing connectivity constraints.</description>\n  <example>In a 3×3 grid (9 vertices), choosing to remove 4 vertices gives C(9, 4)=126 total ways. Each of these 126 subsets must then be tested for the connectivity condition.</example>\n</note2>\n<ernote3>\n  <description>Apply a parity or bipartite coloring argument to detect when a removal disconnects the graph. Color vertices alternately black and white; if a removal breaks all paths between two colored vertices, the graph is disconnected.</description>\n  <example>Color a 3×3 grid like a chessboard. Remove 4 vertices including one from each color. If the removal prevents any path between the two corner vertices of the same color, the graph is disconnected.</example>\n</ernote3>\n<note4>\n  <description>Use the principle of inclusion–exclusion to count configurations where the graph remains connected. Subtract the number of configurations that disconnect the graph from the total C(n, k). This can be done by summing over disjoint disconnection events.</description>\n  <example>For 4 removals on 9 vertices, count all C(9, 4)=126. Then subtract those removals that disconnect the two corners: count each disconnection event, add back overlaps, and subtract from 126 to get the connected count.</example>\n</note4>\n<note5>\n  <description>Exploit symmetry by partitioning removals into equivalence classes under grid rotations/reflections. Count one representative per class and multiply by the number of symmetries. This reduces redundant casework.</description>\n  <example>On a square grid, group removals by their positions modulo 90° rotation. Count the number of ways to remove 4 vertices in one orientation, then multiply by 4 to get the total for all orientations.</example>\n</note5>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 12, "abstractions": ["<note1>\n  <description>  \nWhen selecting k items from n items without regard to order, use the binomial coefficient C(n,k)=n!/(k!(n−k)!). This counts the number of ways to choose k elements from an n-element set.  \n</description>\n  <example>  \nTo choose 3 elements from a set of 7, compute C(7,3)=7!/(3!4!)=35.  \n</example>\n</note1>\n<note2>\n  <description>  \nFor placing k identical items into m distinct boxes, the number of nonnegative solutions to x₁+…+xₘ=k is C(k+m−1, m−1). This is a stars-and-bars count.  \n</description>\n  <example>  \nDistribute 4 identical balls into 3 boxes: the number of ways is C(4+3−1, 3−1)=C(6,2)=15.  \n</example>\n</note2>\n<note3>\n  <description>  \nTo count configurations where each chosen element must satisfy a local constraint (e.g., share a box with at least one neighbor), first find all valid subsets of elements that satisfy the constraint, then multiply by the number of ways to distribute them.  \n</description>\n  <example>  \nIf only subsets {1,2} and {3,4} satisfy the neighbor rule and each subset must go into 2 boxes, multiply by the ways to distribute subsets: C(2+2−1,2−1)=3 for each subset, giving 2×3=6.  \n</example>\n</note3>\n<note4>\n  <description>  \nWhen selecting two disjoint subsets of sizes k₁ and k₂ from the same set, the count is C(n,k₁)×C(n−k₁,k₂). This avoids double-counting and ensures subsets are nonoverlapping.  \n</description>\n  <example>  \nFrom 8 items, choose 3 for group A then 2 for group B: C(8,3)×C(5,2)=56×10=560.  \n</example>\n</note4>\n<note5>\n  <description>  \nUse casework on the size of one subset when the problem’s constraint naturally splits into cases (e.g., subset size k₀ or k₁). Sum the counts for each case.  \n</description>\n  <example>  \nCount ways to split 10 items into two groups of size 3 or 4: compute C(10,3)=120 and C(10,4)=210, then add to get 330.  \n</example>\n</note5>", "<note1>\n  <description>Model the problem as a graph where vertices represent balls and edges represent adjacency. Placing balls into boxes corresponds to partitioning the graph into connected components (blocks) of a fixed size. This transforms a placement problem into a counting problem on graph partitions.</description>\n  <example>For a path of 6 vertices (each vertex has two neighbors) and boxes of size 2, one representation is a 3-block partition of the path into three edges. Each edge is a block of size 2, ensuring each vertex is in a block with its neighbor.</example>\n</note1>\n<note2>\n  <description>Use the inclusion–exclusion principle to count partitions satisfying connectivity. First count all ways to partition the set into blocks of size k, then subtract partitions where at least one block is disconnected, add back those with two disjoint blocks disconnected, and so on.</description>\n  <example>With n=5 vertices and k=2, total partitions = C(5,2)·C(3,2)·C(1,1). Subtract partitions where a chosen block of size 2 is disconnected from the rest, then add back overcounts, yielding the exact count of connected partitions.</example>\n</note2>\n<note3>\n  <description>Partition the graph by its connected components. For each component size s, count the number of ways to choose s vertices from the graph, then multiply by the number of ways to place s balls into a single box, and sum over all valid component sizes.</description>\n  <example>In a cycle of length 8 with k=2 boxes, components can be size 1 or 2. There are C(8,2) ways to choose the 2-vertex component and C(6,2) ways for the 1-vertex component, yielding the total number of valid partitions.</example>\n</note3>\n<note4>\n  <description>Exploit symmetry by fixing a reference vertex or block to break rotational or reflectional indistinguishability. This reduces the number of equivalent cases one must consider and simplifies the enumeration of connected components.</description>\n  <example>In a cycle of 7 vertices, fix one vertex in a block of size 2. There are 3 remaining vertices that must form a connected component, so only two cases arise: a 2-block adjacent to the fixed block or a 3-block, rather than enumerating all rotations.</example>\n</note4>\n<note5>\n  <description>Use generating functions to encode the number of ways to form blocks of size k. The ordinary generating function for blocks of size k is (1 + x^k + x^{2k} + …). The coefficient of x^n in the product of these functions over all possible blocks gives the total number of partitions.</description>\n  <example>For n=6 and k=2, the generating function is (1 + x^2 + x^4 + x^6)^3. Expanding and extracting the coefficient of x^6 yields the number of ways to split 6 vertices into 3 blocks of size 2.</example>\n</note5>", "<note1>\n  <description>When placing indistinguishable objects into boxes, count by partitioning the set of objects into up to k unlabeled subsets of specified sizes, using the multiset coefficient C(n, n₁, n₂, …, nₖ) = n!/(n₁! n₂! … nₖ!).</description>\n  <example>For 12 items into 3 boxes of sizes 4, 4, 4, the count is C(12,4,4,4) = 12!/(4! 4! 4!).</example>\n</note1>\n<note2>\n  <description>To enforce that each object shares its box with at least one neighbor, first place all objects into boxes so that no two neighbors are together (a “no-adjacency” configuration). Then, iteratively move each adjacent pair into the same box, counting each valid merge step.</description>\n  <example>With n=6 labeled objects in 3 boxes of size 2, start with each box having distinct neighbors, then count ways to merge each neighbor pair into a single box.</example>\n</note2>\n<note3>\n  <description>Use complementary counting: total placements minus those where at least one object has no neighbor in its box. Apply inclusion–exclusion by summing over subsets of objects that violate the adjacency requirement.</description>\n  <example>For n=8 objects into 4 boxes of size 2, subtract placements where a specific object has no neighbor, add back placements where two disjoint violations occur, etc.</example>\n</note3>\n<note4>\n  <description>Exploit symmetry by fixing a reference object in a canonical box or position, reducing equivalent cases and simplifying the count. Ensure the chosen symmetry is compatible with the adjacency constraint.</description>\n  <example>Fix object 1 in box A; then count placements of the remaining objects relative to box A, ensuring object 1’s neighbors remain adjacent.</example>\n</note4>\n<note5>\n  <description>Model the adjacency relation as a graph and represent each valid box assignment as a vertex-coloring of the graph with k colors. Count colorings where each vertex shares its color with at least one neighbor, often via known formulas or inclusion–exclusion.</description>\n  <example>For a path of n labeled vertices into 2 colors, count colorings where each vertex matches at least one neighbor, using linear recurrence or direct enumeration.</example>\n</note5>", "<note1>\n  <description>\n    Model the problem by a path graph where vertices represent balls and edges represent neighbor relations. A valid placement corresponds to a proper vertex-coloring of the graph with four colors, ensuring each vertex shares its color with at least one neighbor. This transforms the original task into counting colorings under adjacency constraints.\n  </description>\n  <example>\n    For a path of length 3 with vertices v1–v3 and four colors, a valid coloring is v1→A, v2→A, v3→B (since v2 and v3 share color A). Another is v1→A, v2→B, v3→B. Invalid is v1→A, v2→B, v3→C, because v3 has no neighbor sharing color C.\n  </example>\n</note1>\n<note2>\n  <description>\n    Identify and count special cases where a single color appears on two consecutive vertices. Such “double” patterns force the remaining vertices to be colored with the other three colors in a way that still satisfies adjacency. Counting these patterns reduces the problem to simpler subcases.\n  </description>\n  <example>\n    In a path of length 4, if colors A and A appear at positions 1 and 2, then positions 3 and 4 must be colored with B, C, or D in a way that each new vertex shares its color with its neighbor. For instance, 1–A, 2–A, 3–B, 4–C is valid.\n  </example>\n</note2>\n<note3>\n  <description>\n    Use the recurrence for proper colorings of a path: let f(n, k) be the number of ways to color a path of length n with k colors, allowing each vertex to share its color with at least one neighbor. Then f(n, k) = k·f(n–1, k) – (k–1)·f(n–2, k), with base f(0, k)=1 and f(1, k)=k. This recurrence accounts for the choice at each step and avoids overcounting.\n  </description>\n  <example>\n    For n=2 and k=3, f(2,3)=3·f(1,3)–2·f(0,3)=3·3–2·1=9–2=7. The seven valid colorings are (1) (1,2), (1,3), (2,1), (2,3), (3,1), (3,2), and (1,1), (2,2), (3,3) if allowing same-color adjacency.\n  </example>\n</note3>\n<note4>\n  <description>\n    Employ a case-split based on how many colors appear exactly twice. For example, if exactly two colors appear twice, the remaining vertices must be colored with the other two colors in a way that satisfies adjacency. Summing the counts over all possible distributions of colors yields the total number of valid colorings.\n  </description>\n  <example>\n    In a path of length 5 with four colors, suppose colors A and B each appear twice. Then positions where A and B occur must be chosen so that each new position shares its color with a neighbor. One counts placements of A and B, then assigns the remaining C and D to the leftover positions under adjacency constraints.\n  </example>\n</note4>\n<note5>\n  <description>\n    Apply a local complementation or deletion-contraction principle: deleting a vertex reduces the problem to a smaller path, and reattaching it can enforce adjacency constraints. This method often simplifies counting by breaking down the path into smaller subgraphs.\n  </description>\n  <example>\n    To count colorings of a path of length 4, first delete vertex 2 to get a path of length 3. Count f(3,4)=f(2,4)·4–3·f(1,4)=7·4–3·4=28–12=16. Then reattach vertex 2 and ensure it shares its color with its neighbors, adjusting the count accordingly.\n  </example>\n</note5>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 13, "abstractions": ["<note1>\n  <description>Use a recurrence relation by classifying moves into categories based on their net change in coordinates. For each category, express the number of ways to reach a target point as a sum of ways to reach previous points, weighted by the number of ways to make each type of move.</description>\n  <example>Suppose you have two move types: one that increases the x-coordinate by 1 and the other that increases both coordinates by 1. Then the number of ways to reach (i, j) is f(i, j) = f(i−1, j) + f(i−1, j−1), since the last move could be the first type or the second type.</example>\n</note1>\n<note2>\n  <description>Implement the recurrence via dynamic programming (DP) with a 2D array or table. Fill the table row by row (or column by column) to avoid recomputing values. Ensure boundary conditions (e.g. f(0, 0)=1) and handle invalid indices by initializing them to zero.</description>\n  <example>Initialize f[0][0]=1. Then for each i from 0 to 3 and j from 0 to 3, compute f[i][j] = f[i−1][j] + f[i−1][j−1], unless f[i−1][j−1] is out of bounds.</example>\n</note2>\n<note3>\n  <description>When moves are constrained by a maximum coordinate value, truncate the DP table to the allowed range. This prevents unnecessary computation of unreachable or invalid points. Always update your DP bounds to reflect the problem’s constraints.</description>\n  <example>If the coordinates must lie between 0 and 3, set up a table of size 4×4. Any attempt to reference f[i][j] with i&gt;3 or j&gt;3 is invalid and should be handled by returning zero in your recurrence.</example>\n</note3>\n<note4>\n  <description>Use memoization to avoid redundant calculations. Store the result of each subproblem in a hash or 2D array and reuse it when the same subproblem arises again. This speeds up computation for problems with many overlapping subproblems.</description>\n  <example>Before computing f[i][j], check if it has already been computed. If so, return the stored value. Otherwise, compute it via the recurrence and store it for future use.</example>\n</note4>\n<note5>\n  <description>Apply boundary checks and validity tests before performing any computation. Ensure that each move is within the allowed coordinate range and that the point has not been visited. This prevents invalid paths and ensures correctness.</description>\n  <example>Before adding f[i−1][j−1] to f[i][j], verify that i−1≥0, j−1≥0, and that the point (i−1, j−1) has not been marked as visited. If any condition fails, skip that term in the sum.</example>\n</note5>", "<note1>\n  <description>Use a recursive function f(x,y) = count of paths to (x,y). For each valid move from (x,y), add f(x–1,y), f(x,y–1), f(x–1,y–1), f(x+1,y–1). This works when there are no forbidden regions or revisits.</description>\n  <example>On a 2×2 grid with allowed moves right, up, and diagonal, f(0,0)=1. Then f(1,0)=f(0,0)=1, f(1,1)=f(1,0)+f(0,1)+f(0,0)=1+1+1=3, etc.</example>\n</note1>\n<note2>\n  <description>Account for forbidden regions by excluding those moves. If some moves lead to a point outside boundaries or that has already been visited, remove those recursive terms. This maintains the count under constraints.</description>\n  <example>On a 3×3 grid, if diagonal moves to (x+1,y–1) are disallowed when y=0, then f(1,0)=f(0,0)+f(0,1) (only right and up allowed), and f(1,0)=1+1=2.</example>\n</note3>\n<note3>\n  <description>Use dynamic programming by filling a 2D table from base case (x,y)=(0,0). Compute each cell by summing contributions from neighboring cells that satisfy move rules. This avoids redundant recursion.</description>\n  <example>Initialize dp[0][0]=1. For i from 1 to 3 and j from 1 to 3, set dp[i][j]=dp[i–1][j]+dp[i][j–1]+dp[i–1][j–1]+dp[i+1][j–1] (only include if indices valid).</example>\n</note4>\n<note4>\n  <description>Apply boundary conditions to handle grid edges. When x=0 or y=0 or x=3 or y=3, restrict the allowed moves so that invalid moves (e.g., left from x=0 or up from y=0) are zero contributions.</description>\n  <example>At dp[0][2], only right and diagonal moves are allowed, so dp[0][2]=dp[0][1]+dp[–1][1] (set dp[–1][1]=0) = dp[0][1].</example>\n</note5>\n<note5>\n  <description>Use a breadth-first search (BFS) with a visited set to count distinct paths. Enqueue (x,y) with possible moves, mark each as visited, and count the number of nodes enqueued at the target. This finds all non-revisiting paths.</description>\n  <example>Start BFS from (0,0). At each node, enqueue each allowed move that hasn’t been visited yet. When you reach (3,3), the number of nodes enqueued in the BFS tree is the total count.</example>", "<note1>\n  <description>Model the allowed moves as a directed graph on grid points, with edges for each valid step. Counting paths then reduces to counting walks on this graph that start at the origin and end at the target, without revisiting any vertex.</description>\n  <example>On a 2×2 grid, suppose you can move to the right, up, or diagonally northeast. Draw all points as vertices and draw edges for each valid move. Then the number of valid paths from (0,0) to (2,2) is the number of walks in that graph from the start vertex to the end vertex.</example>\n</note2>\n  <description>Use dynamic programming on the grid by defining dp[x][y] as the number of ways to reach (x,y). Initialize dp[0][0]=1 and propagate via dp[x][y]+=dp[x−1][y] + dp[x][y−1] + dp[x−1][y−1], adjusting for forbidden moves or negative coordinates.</description>\n  <example>For a 3×3 grid with allowed moves right, up, and diagonal, set dp[0][0]=1. Then dp[1][0]=dp[0][0] (only right move), dp[0][1]=dp[0][0] (only up move), and dp[1][1]=dp[0][1]+dp[1][0]+dp[0][0] (right+up+diagonal). Continue filling the table up to (3,3).</example>\n</note3>\n  <description>Apply the inclusion–exclusion principle to enforce constraints: count all walks without constraints, then subtract those that violate each constraint (e.g., stepping outside the grid), add back those that violate two constraints simultaneously, and so on.</description>\n  <example>On a 4×4 grid, count all walks from (0,0) to (4,4) with no restrictions (using standard DP). Then subtract walks that ever leave the grid, add back walks that leave the grid twice (both times), etc., to enforce the “never leave” rule.</example>\n</note4>\n  <description>Use generating functions: assign a variable to each move type and form the product of generating functions for each allowed move. The coefficient of the term corresponding to the total number of moves gives the number of ways to achieve that sequence of moves.</description>\n  <example>For moves right (R), up (U), and diagonal (D), let G(x,y)=1+x+y+… (infinite series). Then the generating function is G(x,y)^3 (three moves). Extract the coefficient of x^3 y^3 to count walks of length 3 to (3,3) with those moves.</example>\n</note5>\n  <description>Exploit symmetry or parity to reduce the state space. If moves preserve parity of coordinates or other invariants, group states by these invariants and only propagate between groups, cutting down on redundant calculations.</description>\n  <example>On a 3×3 grid where diagonal moves swap x and y parity, group states by (parity of x, parity of y). From each group (e.g., even–even), only move to other even–even or odd–odd groups. This halves the number of distinct states to track in DP.</example>\n</note6>\n  <description>Use recursion with memoization: define f(x,y) as the number of ways to reach (x,y), and write f(x,y)=sum_{allowed move (x',y')} f(x',y') with memoization to avoid recomputing the same subproblems.</description>\n  <example>On a 3×3 grid with allowed moves right, up, and diagonal, define f(x,y). Then f(0,0)=1 and f(x,y)=f(x−1,y)+f(x,y−1)+f(x−1,y−1) for x,y&gt;0. Memoize each f(x,y) as you compute it to speed up the process.</example>", "<note1>\n  <description>Model the problem as counting paths in a grid with forbidden moves (or forbidden cells), which can be solved by inclusion-exclusion or by dynamic programming on the grid with constraints. Ensure each step respects the bounds on coordinates.</description>\n  <example>Suppose you must move from (0,0) to (n,n) on a grid but cannot step onto any forbidden squares. Assign each square a cost of 1 if reachable and 0 if forbidden. Then count the number of ways to reach each square by summing the counts from its valid predecessors, excluding forbidden transitions.</example>\n</note1>\n<note2>\n  <description>Use state-based dynamic programming (DP) where each DP state is a tuple (x,y). Transition from (x,y) to each allowed neighbor (x+1,y), (x,y+1), (x−1,y+1), or (x+1,y−1), ensuring the new state is within bounds. The base case is DP(0,0)=1, and the final answer is DP(n,n).</description>\n  <example>Initialize a 2D array DP of size (n+1)×(n+1). Set DP[0][0]=1. Then for each (i,j) with i,j∈[0,n], update DP[i][j] by summing DP[i−1][j], DP[i][j−1], DP[i−1][j+1], and DP[i+1][j−1] (only if those indices are valid). The value at DP[n][n] is the number of valid paths.</example>\n</note2>\n<note3>\n  <description>Exploit symmetry by observing that certain moves or coordinates yield equivalent subproblems. Divide the problem into symmetric regions, count paths in one region, then multiply by the number of symmetric regions. This reduces redundant work.</description>\n  <example>If the allowed moves are symmetric under swapping x and y, then the number of paths from (0,0) to (n,n) is twice the number of paths from (0,0) to (k,k) for k<n, plus the special case when k=n. Compute the smaller count once and scale appropriately.</example>\n</note3>\n<note4>\n  <description>Use generating functions to encode the allowed moves as polynomials and extract coefficients. For each move, represent it as a polynomial in two variables (e.g. x for “+1 in x” and y for “+1 in y”). The product of these polynomials over all allowed moves gives a generating function whose coefficient of xⁿyⁿ counts the number of paths.</description>\n  <example>Let P(x,y) = (x + y + x⁻¹y + xy⁻¹). Then the number of ways to go from (0,0) to (n,n) is the coefficient of xⁿyⁿ in (P(x,y))ⁿ. Expand or use known series to extract that coefficient.</example>\n</note4>\n<note5>\n  <description>Apply the reflection principle to count paths that violate boundary conditions. Count all unconstrained paths, then subtract those paths that step outside the allowed region by reflecting the first step that violates a boundary. This yields the number of valid paths.</description>\n  <example>Count all paths from (0,0) to (n,n) without restriction (Catalan number). For each path that goes below y=x, reflect the first step that would cross the boundary by swapping x and y for that segment. The number of invalid paths equals the number of unconstrained paths to a reflected endpoint, which can be counted similarly.</example>\n</note5>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 14, "abstractions": ["<note1>\n  <description>Model the grid as a graph with cells as vertices and doors as edges. A path that starts and ends at the same vertex and uses each edge at most once is an Eulerian circuit if every vertex has even degree and all vertices are connected.</description>\n  <example>In a 2×2 grid of vertices, there are 4 vertices and 6 doors. Each vertex has degree 2 or 3, so no Eulerian circuit exists. Removing one door reduces the degrees to all even and the graph is connected, yielding an Eulerian circuit.</example>\n</note1>\n<note2>\n  <description>Compute the total number of doors in the grid: for an m×n grid, there are m(n+1) horizontal doors and (m+1)n vertical doors, so total doors = m(n+1) + (m+1)n.</description>\n  <example>In a 3×4 grid, horizontal doors = 3×5 = 15, vertical doors = 4×4 = 16, so total doors = 15 + 16 = 31.</example>\n</note3>\n<note3>\n  <description>To achieve an Eulerian circuit, ensure all vertices have even degree. For an m×n grid, the four corner cells have degree 2, the (m−2)×(n−2) interior cells have degree 4, and border cells (excluding corners) have degree 3. Removing one door at each cell of odd degree yields a circuit.</description>\n  <example>In a 3×3 grid, all interior cells have degree 4, all border cells have degree 3. Remove one door at each of the 12 border cells to make every vertex degree 2, then find an Eulerian circuit.</example>\n</note4>\n<note4>\n  <description>Once the graph is Eulerian, the maximum number of doors traversed in a closed walk is equal to the total number of doors, since the walk must use every door exactly once.</description>\n  <example>In a 2×2 grid after removing doors as above, the Eulerian circuit uses exactly 6 doors, which is the total number of doors in the original 2×2 grid.</example>\n</note5>\n<note5>\n  <description>Check connectivity before applying Eulerian conditions. If the graph is disconnected, an Eulerian circuit is impossible, and the maximum closed walk must use fewer doors than the total.</description>\n  <example>In a 1×5 grid of vertices, removing doors at the centers of each cell leaves two separate paths. No Eulerian circuit exists, so the maximum closed walk cannot use all doors.</example>", "<note1>\n  <description>\n    Model the grid as a graph where each cell is a vertex and each door is an edge. A closed walk that uses each edge at most once is a trail that returns to the start. Such walks exist in any 2-regular graph (all vertices of degree 2), since they can be decomposed into disjoint cycles.\n  </description>\n  <example>\n    In a 3×3 grid graph, each vertex has degree 4. One can split the graph into two disjoint cycles by choosing a vertex of degree 4, traversing its four edges in a loop, then removing that cycle and repeating on the remaining subgraph. This yields two cycles covering all edges.\n  </example>\n</note1>\n<note2>\n  <description>\n    Decompose the graph into edge-disjoint cycles. In a grid graph of size n×n, the number of edges is n². Each cycle uses an even number of edges, and the total number of edges equals the sum of edges in each cycle. Thus the maximum number of edges used in a closed trail equals n².\n  </description>\n  <example>\n    For n=4, the grid has 16 edges. Decompose it into two 8-edge cycles (e.g. two disjoint 4×2 strips) and one 4-cycle. Total edges used = 8+8+4 = 20, but since we want to cover all 16, one must find two disjoint cycles of lengths summing to 16.\n  </example>\n</note2>\n<note3>\n  <description>\n    Use a bipartite decomposition: color the grid’s cells alternately black and white. In any cycle, the number of black and white vertices differs by at most 1. Thus a cycle in a grid can cover at most 2⌊(n²)/2⌋ edges. Pairing cycles can reach this bound.\n  </description>\n  <example>\n    In a 5×5 grid, there are 13 black and 12 white cells. A cycle covering 13 edges must use 7 black and 6 white vertices. Two such cycles can cover 26 edges (13+13), matching 2⌊25/2⌋=25.\n  </example>\n</note3>\n<note4>\n    <description>\n    Apply a greedy cycle-extraction algorithm: start at any vertex, follow unused doors until you return to the start, remove that cycle, and repeat. This produces a collection of vertex-disjoint cycles covering all edges. The maximum number of edges used is the sum of cycle lengths.\n  </description>\n  <example>\n    In a 4×4 grid, begin at a corner. Traverse unused doors in a loop around the perimeter, removing that cycle. Then pick an unused corner and repeat. The two resulting cycles together cover all 16 edges.\n  </example>\n</note4>\n<note5>\n    <description>\n    Use parity and degree constraints: in a grid graph, each vertex has even degree. A closed trail that visits each edge at most once must traverse an even number of edges. Therefore, the maximum number of edges in a closed trail is the total number of edges, since the graph is bipartite and 2-regular on each component.\n  </description>\n  <example>\n    In a 6×6 grid, each vertex has degree 4. Since the graph is bipartite and each component is 2-regular, a closed trail can cover all 36 edges by decomposing the graph into disjoint 4-cycles.\n  </example>\n</note5>", "<note1>\n  <description>Model the grid as a graph where each cell is a vertex and each door is an edge. Restricting traversal to each edge at most once transforms the problem into finding a maximum-size subgraph without multiple edges. This abstraction lets you apply graph-theoretic techniques.</description>\n  <example>For a 3×3 grid, there are 9 vertices and 24 edges. Represent each cell by a vertex and each adjacent cell pair by an edge. Any valid walk in the grid corresponds to a path in this graph, with the restriction that each edge can be used at most once.</example>\n</note1>\n<note2>\n  <description>Use parity considerations on the grid’s vertices. In any bipartite graph, a closed walk that uses each edge at most once must alternate between parts of the bipartition. In an odd×odd grid, the number of vertices in each part is equal, so any such walk must cover exactly one vertex per part, making it impossible to return to the start without revisiting an edge.</description>\n  <example>In a 3×3 grid, label cells by parity (e.g. (row+col) mod 2). There are 9 vertices, 5 of one parity and 4 of the other. A closed walk using each edge once would need to visit 5 of one parity and 5 of the other, which is impossible. Hence the maximum edge count is less than the total edges.</example>\n</note3>\n<note3>\n  <description>Apply the handshake lemma: in any graph, the sum of all vertex degrees is twice the number of edges. If you require each edge to be used at most once, the degrees of the start and end vertices must be even. This restricts the possible total edge count.</description>\n  <example>Consider a 3×3 grid graph with 24 edges. If you start and end at the same vertex, its degree must be even. Since each cell has degree 4 (even), you can use up to 24 edges, but you must also check local constraints (e.g. parity or adjacency) to confirm feasibility.</example>\n</note4>\n<note4>\n  <description>Construct explicit examples to meet the maximum edge count under the given constraints. For instance, in a 3×3 grid, a closed loop that visits each cell exactly once (a Hamiltonian cycle) uses 9 edges. Extending this idea to larger odd×odd grids shows that the maximum is the number of cells.</description>\n  <example>On a 3×3 grid, label cells 1–9 in one direction (e.g. row-major). The path 1→2→3→4→5→6→7→8→9→1→2… forms a cycle that visits every cell exactly once. This gives 9 edges, which is the maximum achievable in that size.</example>\n</note5>\n<note5>\n  <description>Use double counting of door uses. Each door (edge) is traversed at most once, so the total number of door uses cannot exceed the total number of doors. This provides an upper bound without needing to optimize the walk further.</description>\n  <example>For an n×n grid, there are n² vertices and n(n+1) doors. Since each door can be used at most once, the maximum number of doors Karthik can go through is n(n+1). This bound applies to any configuration of start and end points.</example>", "<note1>\n  <description>Model the grid as a graph where each cell is a vertex and each door is an edge. A self-returning walk that uses each edge at most once is a cycle or a union of cycles. Use this graph model to apply standard cycle-structure theorems.</description>\n  <example>In a 3×3 grid graph, start at vertex A, traverse edges to form one cycle (A→B→C→D→E→F→G→H→I→J→K→L→M→N→O→P→Q→R→S→T→U→V→W→X→Y→Z→AA), then return to A. Each edge is used exactly once, forming a single cycle.</example>\n</note2>\n  <description>Each vertex in a cycle has degree 2. In a connected graph, the only way to have all vertices with degree 2 is to decompose the graph into edge-disjoint cycles covering all vertices. This ensures no edge is used more than once.</description>\n  <example>Consider a 4×4 grid graph. After finding one maximal cycle, remove its edges and repeat on the remaining subgraph. Each time you find a cycle, all its vertices become degree 2 until no more cycles exist, guaranteeing a cycle cover.</example>\n</note3>\n  <description>On an $n \\times n$ grid, the number of edges is $n^2 \\times (n+1)$. Since each edge appears in exactly one cycle, the total number of edges yields the maximum number of doors that can be traversed exactly once in a self-returning walk.</description>\n  <example>For an 11×11 grid, there are 11^2 × 12 edges. Therefore, the maximum number of doors in a self-returning walk using each door once is 11^2 × 12.</example>\n</note4>\n  <description>A common pitfall is assuming a Hamiltonian path (one edge per vertex) instead of a cycle. In grids, Hamiltonian paths are possible but may not use all edges. Always check for cycle decompositions rather than paths.</description>\n  <example>In a 2×3 grid, a Hamiltonian path uses 6 edges but only visits 6 vertices. It does not cover all edges. By contrast, a cycle covers all edges exactly once, achieving the maximum use of doors.</example>\n</note5>\n  <description>Use parity checks on the graph’s structure to confirm a cycle decomposition is possible. For instance, in a bipartite grid graph, each component of a cycle must alternate colors. Ensuring all vertices can be colored alternately helps verify a cycle cover.</description>\n  <example>In a 5×5 bipartite grid, color cells alternately. Any cycle you form must start and end on cells of the same color. Checking this parity constraint for each trial cycle ensures consistency with bipartite structure.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 15, "abstractions": ["<note1>\n  <description>Use the identity C(n + k – 1, k) to count the number of nonnegative integer solutions to the equation x₁ + x₂ + … + xₖ = n. This counts how many ways you can choose k intervals (or rectangles) along one dimension to cover n positions without gaps.</description>\n  <example>To count how many ways to place 3 nonoverlapping intervals on 5 positions, solve x₁ + x₂ + x₃ + x₄ = 5 with xᵢ ≥ 0. The number of solutions is C(5 + 4 – 1, 4) = C(8, 4) = 70. Each solution gives one valid placement of intervals.</example>\n</note1>\n<note2>\n  <description>When selecting two or more objects from a set of size N without regard to order, use the combination formula C(N, k) = N!/(k!(N–k)!). This directly counts unordered selections.</description>\n  <example>Given 10 distinct points, the number of ways to choose any 2 points is C(10, 2) = 45, since order does not matter.</example>\n</note2>\n<note3>\n  <description>Exploit symmetry by fixing one element’s position (or dimension) before counting the second. This reduces double counting and simplifies the enumeration of unordered pairs.</description>\n  <example>To count unordered pairs of rectangles in a grid, first choose an arbitrary rectangle, then count all possible second rectangles that do not overlap with it. Multiplying by 2 and dividing by 2 yields the total without overlap.</example>\n</note3>\n<note4>\n  <description>Use inclusion-exclusion to count selections avoiding overlaps. First count all selections, then subtract those where at least one overlap occurs, add back those where two overlaps occur, and so on.</description>\n  <example>For two intervals on 5 positions, total pairs are C(7,2)=21. Subtract those with overlap: count pairs with at least one overlap, then add back pairs with two overlaps, etc., to get the nonoverlapping count.</example>\n</note4>\n<note5>\n  <description>When objects can be positioned in a grid or line, count positions by treating each dimension separately. Multiply the number of choices along each dimension to get the total ways to place an object.</description>\n  <example>In a 4×4 grid, to place a single rectangle of size 2×3, choose any 2 of the 4 rows (C(4,2)=6) and any 3 of the 4 columns (C(4,3)=4), giving 6×4=24 placements.</example>\n</note5>", "<note1>\n  <description>Count all axis-aligned rectangles in an M×N grid by summing over the number of rows and columns: ∑_{i=1}^M ∑_{j=1}^N (M–i+1)(N–j+1). This counts every possible rectangle with its top-left and bottom-right corner in the grid.</description>\n  <example>In a 3×3 grid, sum over i=1…3, j=1…3: for i=1 there are 3·3 choices, i=2 gives 2·3, i=3 gives 1·3; same for j. Total =9+6+3 +9+6+3 +9+6+3 =54.</example>\n</note1>\n<note2>\n  <description>When selecting two non-overlapping (in interior, edges, or vertices) rectangles, first choose two disjoint sets of row indices and two disjoint sets of column indices. The count is ∑_{i=0}^{M-1} ∑_{j=0}^{M-1-i} ∑_{k=0}^{N-1} ∑_{ℓ=0}^{N-1-k} C(M–i–1,1)C(N–k–1,1)C(M–j–1,1)C(N–ℓ–1,1).</description>\n  <example>For a 4×4 grid, i,j∈{0,1,2}, k,ℓ∈{0,1,2,3}. For i=0, j=1, k=0, ℓ=2: choose row 2,4; choose col 1,3; multiply: C(3,1)C(3,1)C(2,1)C(2,1)=3·3·2·2=36; sum over all (i,j,k,ℓ).</example>\n</note2>\n<note3>\n  <description>Use inclusion–exclusion to subtract pairs that overlap. Start with the total number of ordered pairs of rectangles, then subtract those where they share an overlap region (edge or vertex). Sum over all possible overlap types and alternately add/subtract.</description>\n  <example>Total ordered pairs = C(54,2). Subtract pairs where one rectangle lies entirely inside the other (count by fixing a subset of rows and cols for the inner rectangle). Then add back those where they share edges or vertices, etc.</example>\n</note3>\n<note4>\n  <description>Exploit symmetry: count rectangles by size (r×c) first, then count pairs of distinct sizes that intersect. Sum over all size pairs (r₁,c₁) and (r₂,c₂) where r₁+r₂≤M and c₁+c₂≤N, and multiply by the number of ways to choose the same-size pair.</description>\n  <example>For a 5×5 grid, list all r×c with 1≤r≤5,1≤c≤5. Then for each size (r₁,c₁), count how many (r₂,c₂) satisfy r₁+r₂≤5 and c₁+c₂≤5. Multiply by C(C(r₁,c₁),2) for each size.</example>\n</note4>\n<note5>\n  <description>Model rectangles by their top-left and bottom-right corners. Two rectangles are disjoint iff the bottom-right of one lies strictly above and to the left of the other’s top-left. Count ordered pairs satisfying these inequalities, then divide by 2 for unordered pairs.</description>\n  <example>Label top-left (x₁,y₁) and bottom-right (x₂,y₂). Count solutions to x₂≤x₁–1 or y₂≤y₁–1. Total ordered pairs = (sum over grid) C(x₁–x₂+1,1)·C(y₁–y₂+1,1); divide by 2 for unordered.</example>\n</note5>", "<note1>\n  <description>Count all axis-aligned rectangles in an $n \\times n$ grid by choosing two distinct vertical lines and two distinct horizontal lines: the number of rectangles is C(n+1, 2) * C(n+1, 2). This works because each pair of vertical lines and each pair of horizontal lines defines one rectangle.</description>\n  <example>For a 3×3 grid, there are C(4,2)=6 ways to pick vertical lines and C(4,2)=6 ways to pick horizontal lines, giving 6×6=36 rectangles in total.</example>\n</note1>\n<note2>\n  <description>Count non-overlapping rectangles by partitioning into disjoint cases based on their relative positions (e.g., one inside another, side by side, corner-adjacent). Sum the counts for each disjoint case to get the total without overlap.</description>\n  <example>In a 2×2 grid, one can count pairs where one rectangle is entirely inside the other (0 ways), side by side (2 ways), or corner-adjacent (2 ways), yielding 4 non-overlapping pairs.</example>\n</note2>\n<note3>\n  <description>Use inclusion–exclusion to subtract overlapping configurations from the total count of all pairs: Total_pairs = C(rectangles, 2) – C(overlapping_pairs, 2) – 2·C(non-overlapping_pairs, 2). This corrects for double-counting and over-counting of overlaps.</description>\n  <example>Suppose there are 10 rectangles total, 4 overlapping pairs, and 6 non-overlapping pairs; then Total_pairs = C(10,2) – C(4,2) – 2·C(6,2) = 45 – 6 – 2·15 = 45 – 6 – 30 = 9.</example>\n</note3>\n<note4>\n  <description>Apply the lattice-path interpretation: each rectangle is encoded by a path from (0,0) to (n+1,n+1) that stays within a diagonal; two paths cross exactly when they define overlapping rectangles. Counting non-crossing paths yields non-overlapping rectangle pairs.</description>\n  <example>In a 1×1 grid, there is only one diagonal path, so no non-overlapping pairs. In a 2×2 grid, there are 6 diagonal paths, and non-crossing pairs correspond to Catalan numbers C(4)=2, giving 2 non-overlapping pairs.</example>\n</note4>\n<note5>\n  <description>Exploit symmetry by fixing one rectangle’s orientation and position to reduce casework. Count valid placements of the second rectangle relative to the first, then multiply by the number of orientations and positions of the first.</description>\n  <example>For an axis-aligned rectangle, one can fix its position at the origin and count all valid placements of the second rectangle. After counting, multiply by the number of possible orientations of the first rectangle to get the total.</example>\n</note5>", "<note1>\n  <description>Counting axis-aligned rectangles in an m×n grid: choose two distinct rows and two distinct columns; the number of ways is C(m,2)·C(n,2). This counts all possible non-overlapping axis-aligned rectangles.</description>\n  <example>In a 4×3 grid, there are C(4,2)=6 ways to pick rows and C(3,2)=3 ways to pick columns, yielding 6·3=18 rectangles.</example>\n</note2>\n  <description>Counting non-overlapping rectangles: for each possible rectangle size k×ℓ, count its placements and multiply by the number of ways to pick a second rectangle of any size that does not share a cell. Sum over all sizes.</description>\n  <example>For a 2×2 in a 4×4 grid there are (3·2)=6 placements. To place a second 2×2 non-overlapping, ensure no cell in the first is used; the count of disjoint placements can be computed by shifting the second rectangle outside the first’s footprint and summing.</example>\n</note3>\n  <description>Inclusion-Exclusion for non-overlap: start with the total number of rectangle pairs (C(R,2)), subtract pairs that share at least one cell. Use inclusion-exclusion over all possible shared cells or regions to correct overlaps.</description>\n  <example>Total pairs: C(18,2)=153. Subtract pairs sharing a single cell, then add back pairs sharing a line segment, and so on, to get the number of truly non-overlapping pairs.</example>\n</note4>\n  <description>Generating functions: encode the number of ways to place each rectangle by a polynomial in x and y (or other variables) where exponents track dimensions. Multiply the polynomials and extract the coefficient of x^a y^b to count placements of two rectangles of sizes a×b.</description>\n  <example>For rectangles in a 4×4 grid, let P(x,y)=Σ_{i,j}(number of i×j placements)·x^i y^j. Then the coefficient of x^2 y^3 in P(x,y)·P(x,y) gives the number of ways to place two rectangles that do not overlap.</example>\n</note5>\n  <description>Geometric area model: interpret each rectangle as a region in the grid. Count all ways to choose two regions whose union covers all points, ensuring no overlap. This can be done by enumerating all possible union patterns of two non-overlapping regions.</description>\n  <example>Label the 16 cells A–P. Count all pairs of disjoint subsets of {A–P} of sizes corresponding to rectangle dimensions, then adjust for order by dividing by 2. This yields the total number of non-overlapping rectangle pairs.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 16, "abstractions": ["<note1>\n  <description>\nIn a sequence of length N with a fixed number of each symbol, the count of a given symbol between two specified positions is determined by the total occurrences of each symbol. Use the fact that if there are m symbols of type A and m of type B, then the number of B between the kᵗʰ and ℓᵗʰ A is (m–k)–(ℓ–k)=m–ℓ.\n</description>\n  <example>\nConsider a sequence of length N with 4 A’s and 4 B’s. If the 2ⁿᵈ A appears at position 5 and the 3ʳᵈ A at position 10, then there are 4–3=1 B between them.\n</example>\n</note2>\n<note3>\n  <description>\nA necessary and sufficient condition for the given pattern is that all symbols occur an even number of times. This follows because each symbol must contribute the same number of “intermediate” symbols between every pair of its occurrences.\n</description>\n  <example>\nFor a sequence with symbols X, Y, Z occurring 2, 3, and 5 times respectively, it cannot satisfy the condition since 3 and 5 are odd. Only sequences with all counts even can be valid.\n</example>\n</note3>\n<note4>\n  <description>\nUse a bijection to map each valid sequence to a pair of distinct monotonic sequences of length k (one for each symbol). This reduces the problem to counting such pairs under the constraint that their first elements differ.\n</description>\n  <example>\nIf there are 3 symbols and each occurs twice, map each symbol’s positions to two increasing sequences of length 2. For instance, symbol 1’s positions become (p₁,p₂) in increasing order, symbol 2’s positions become (q₁,q₂), and symbol 3’s positions become (r₁,r₂)—with p₁≠q₁, etc.\n</example>\n</note5>\n<note6>\n  <description>\nCount the number of pairs of increasing sequences by choosing k distinct elements for the first sequence and then permuting the remaining k–1 into the second (or vice versa). The total is C(n,k)·(k–1)!.\n</description>\n  <example>\nWith n=5 symbols and k=2 occurrences per symbol, choose 2 symbols for the first sequence in C(5,2)=10 ways, then order the remaining 1 symbol in 1! ways, giving 10·1=10 valid pairs.\n</example>\n</note6>", "<note1>\n  <description>When two distinct symbols each appear three times in a sequence, the condition on the counts of one symbol between occurrences of the other can be encoded by a linear equation: if symbol A occurs at positions a₁, a₂, a₃ and symbol B occurs at positions b₁, b₂, b₃, then the condition b₂ – a₁ = b₃ – a₂ yields a₁ + a₂ = b₂ + b₃. This reduces a geometric constraint to a simple arithmetic relation.</description>\n  <example>Let A occur at positions p, q, r and B at positions u, v, w. If v – p = w – q, then p + q = v + w. For instance, if p + q = 10 and v + w = 10, the positions satisfy the spacing condition.</example>\n</note1>\n<note2>\n  <description>Once the linear relation a₁ + a₂ = b₂ + b₃ is known, treat it as a fixed total T = a₁ + a₂ = b₂ + b₃. This transforms the problem into selecting two positions for A’s first and second occurrences and two positions for B’s second and third occurrences, each summing to T.</description>\n  <example>With T = 8, choose any two distinct indices i and j for A₁ and A₂ so that i + j = 8, and similarly choose two distinct indices k and ℓ for B₂ and B₃ with k + ℓ = 8. All other placements of letters follow.</example>\n</note3>\n<note3>\n  <description>For each choice of T, count the number of ways to select two distinct indices summing to T. If n positions are available, the count is ∑_{T=2 to 2n-2} (number of solutions to x + y = T with x ≠ y). This can be computed by summing the number of unordered pairs whose sum equals each T.</description>\n  <example>With n = 5, T ranges from 2 to 8. For T = 2 there is 1 pair (1,1) but since they must be distinct, count = 0. For T = 3 there is 1 pair (1,2), etc. Summing over all T gives the total number of valid (i,j).</example>\n</note4>\n<note4>\n  <description>Account for symmetry: swapping A and B yields the same sequence. If the total number of sequences with given placements is S, then the overall count is S/2 unless the scenario is symmetric under A↔B, in which case it remains S.</description>\n  <example>If you find 12 sequences where A’s first two occur at positions (i,j) and B’s last two at (k,ℓ), and this is the only configuration, then the total is 12. If swapping A and B also gives a valid configuration, divide by 2 to avoid double-counting.</example>\n</note5>\n<note5>\n  <description>After fixing the positions of A and B, assign the remaining letters freely in the leftover slots. If there are L leftover slots and R distinct letters to place, the number of ways is R!/(R – L)! by the permutation principle.</description>\n  <example>With 10 slots remaining and 20 distinct letters available, the number of ways to fill them is 20!/(20 – 10)! = P(20,10). This accounts for all permutations of the unused letters.</example>\n</note6>", "<note1>\n  <description>When arranging objects with repeated types, the total number of distinct sequences is given by the multinomial coefficient N!/(n₁!·n₂!·…·n_k!), where N is the total count and nᵢ are counts of each type.</description>\n  <example>For instance, arranging 4 A’s, 3 B’s, and 2 C’s in a row yields 9!/(4!·3!·2!) sequences.</example>\n</note1>\n<note2>\n  <description>In fixed-spacing constraints, each pair of occurrences of a symbol must have the same number of intervening symbols. This reduces the problem to choosing positions for each symbol block rather than individual symbols.</description>\n  <example>For a symbol X appearing three times, if the spacing constraint is 2 between each pair, you treat each “X block” as a single unit of width 3, simplifying placement.</example>\n</note3>\n<note3>\n  <description>Use symmetry or relabeling to reduce casework: when multiple constraints are mirror images, count one case and multiply by the number of symmetric cases.</description>\n  <example>Count arrangements with spacing between two symbols equal to d, then multiply by 2 if the same constraint holds for the reverse order.</example>\n</note4>\n<note4>\n  <description>When symbols are partitioned into groups, first choose which group occupies each distinct position, then arrange within each chosen group. This two-step process simplifies complex constraints.</description>\n  <example>Divide 5 slots into three groups of sizes 2, 1, and 2. First pick 2 slots for group A, 1 for group B, then 2 for group C, and finally arrange symbols within each group.</example>\n</note5>\n<note5>\n  <description>After counting placements, apply inclusion-exclusion to correct for overcounting when constraints overlap or when certain patterns are forbidden.</description>\n  <example>If two distinct symbols must each have a fixed spacing, count placements assuming both constraints, then subtract those where one fails, adding back overlaps as needed.</example>", "<note1>\n  <description>When elements of one type must create a fixed gap of size k between each occurrence of another element of a different type, model their positions as a geometric progression: the first occurrence at position i, the second at position i + k + 1, and the third at i + 2(k + 1). This enforces the required spacing.</description>\n  <example>Suppose you need to place 3 markers so that exactly k units separate each pair. If the first marker goes at position i, then the second must be at i + k + 1, and the third at i + 2(k + 1). This ensures the gap k is maintained between all consecutive markers.</example>\n</note1>\n<note2>\n  <description>For each element A, select its first occurrence position i from the range [1, n − 2(k + 1)], where n is the total length of the sequence. The choice of i fixes the positions of all 3 of A’s occurrences via the gap formula.</description>\n  <example>If n = 20 and k = 2, then i can be any integer from 1 to 14. Choosing i = 3 places A at positions 3, 8, and 13, with exactly 2 units between each.</example>\n</note2>\n<note3>\n  <description>Once all positions for one element are determined, the remaining positions are filled by the other elements in any order. The number of ways to arrange the remaining m elements in the m slots is m!.</description>\n  <example>After placing 3 A’s in a sequence of length 15, there are 12 slots left. If there are 12 other distinct elements, they can be arranged in 12! ways in those slots.</example>\n</note4>\n<note4>\n  <description>When the same pattern applies to each of m distinct elements, use the product rule: for each element, count its valid placements and multiply these counts together, then multiply by m! for the arrangement of the elements themselves.</description>\n  <example>With m = 5 distinct types and each type requiring 3 occurrences with fixed gaps, if each type has p valid first-position choices, there are p^5 ways to choose their initial positions. After that, the 5 types can be permuted in 5! ways, giving p^5 × 5! total arrangements.</example>\n</note5>\n<note5>\n  <description>Be cautious of boundary constraints: ensure that the chosen starting index i does not exceed the total length n and that the last element placement stays within the sequence. If any index falls out of bounds, that choice is invalid.</description>\n  <example>If n = 10 and k = 3, then for type A, i must be ≤ 10 − 2(k + 1) = 4. Choosing i = 5 would place the third A at position 5 + 2·4 = 13, which is beyond 10, so that choice is disallowed.</example>\n</note6>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 17, "abstractions": ["<note1>\n  <description>When a process at each step replaces a value by the maximum of its neighbors, the new value is always at least as large as its neighbors. Thus any value that is a local minimum never increases and remains fixed thereafter.</description>\n  <example>On a circle of three values, if the middle is the smallest, after one step it stays the middle, and all other values become the maximum of their two neighbors (which is at least the original minimum).</example>\n</note1>\n<note2>\n  <description>Local minima are “stuck” in the process: once a value becomes a local minimum, it never increases. Therefore, any value that remains strictly above its neighbors at some point will eventually become a local minimum.</description>\n  <example>In a circle of four values, if at some step one value is smaller than both neighbors, it stays that value forever, and all other values become the maximum of their two neighbors.</example>\n</note3>\n<note3>\n  <description>After a finite number of steps, every value either becomes a local minimum or is replaced by the maximum of its neighbors. Since the maximum of three random numbers in [0,1] has a known distribution, one can compute the probability a value is replaced by a larger neighbor.</description>\n  <example>If a value is replaced by the maximum of its two neighbors, and each neighbor is independent U[0,1], then the probability the replacement exceeds the original value is the integral of the upper-triangle region in the unit square.</example>\n</note4>\n<note4>\n  <description>Over many iterations, the probability that a given value is not replaced by a larger neighbor tends to zero. Hence, almost all values become local minima and the process stabilizes with only local minima remaining.</description>\n  <example>After 100 seconds, each original value has a small chance to remain larger than its neighbors, so the expected number of distinct values approaches the number of local minima.</example>\n</note5>\n<note5>\n  <description>The expected number of distinct values equals the expected number of local minima. One can compute this by summing the probability that each position is a local minimum, since the events are independent.</description>\n  <example>On a circle of N values, each value is a local minimum with probability 2/3, so the expected number of distinct values is N × 2/3.</example>\n</note6>", "<note1>\n  <description>When a set of random variables is updated via a max (or min) operation in a cyclic or chain structure, at each step the number of distinct values cannot increase. Thus, the process is monotonic in the sense that the number of distinct elements never rises after the first update.</description>\n  <example>Suppose three variables X₁, X₂, X₃ are chosen independently in [0,1]. After one update to Xᵢ ← max(Xᵢ₋₁, Xᵢ, Xᵢ₊₁), the possible values are at most three, and if there were k distinct values initially, the number remains k or fewer.</example>\n</note1>\n<note2>\n  <description>After the first update, the set of distinct values is fixed and no new values appear. The process then merely preserves and reorders this fixed set, so analyzing it reduces to understanding how the max-filtered values evolve.</description>\n  <example>With four distinct initial values {v₁, v₂, v₃, v₄}, the first update yields a set of size 4. In subsequent steps, each value remains in that set, and the permutation of values around the cycle changes, but no new values enter.</example>\n</note2>\n<note3>\n  <description>Conditioned on the initial distinct set S, the probability that a particular value v survives after one update equals the probability that v is strictly greater than its two neighbors, since in a max filter it becomes the new value only if it exceeds both neighbors.</description>\n  <example>Given four independent uniform values v₁, v₂, v₃, v₄ in a cycle, P(v₂ survives one step) = P(v₂ &gt; v₁ ∧ v₂ &gt; v₃) = (1/2)·(1/2) = 1/4.</example>\n</note3>\n<note4>\n  <description>Since the survival of each initial value vᵢ in step t+1 is independent of other values, the expected number of survivors at time t is the sum of their individual survival probabilities.</description>\n  <example>If there are k distinct values initially and each has survival probability p, then after one step E[survivors] = k·p. For instance, with k=5 and p=0.2, the expected survivors = 5·0.2 = 1.</example>\n</note4>\n<note5>\n  <description>Because the process is monotonic, the expected number of distinct values never increases. Thus, for t &gt; 1, the expected number of survivors is the same as at t=1.</description>\n  <example>After the first update, say there are 3 distinct values. Even after 100 more updates, the expected number of distinct values remains 3, since no new values can appear.</example>\n</note5>", "<note1>\n  <description>On a circle of n values, each update step replaces every entry with the max of its three neighbors. This “max-contract” operation reduces the number of distinct values by at most 2 per step, because the two largest of the three neighbors cannot both be eliminated unless they coincide with other distinct values.</description>\n  <example>Consider 4 values {0.1, 0.5, 0.3, 0.7}. After one max step: new values = max(0.1,0.5,0.3)=0.5, max(0.5,0.3,0.7)=0.7, max(0.3,0.7,0.1)=0.7, max(0.7,0.1,0.5)=0.7, so 2 distinct values remain (0.5,0.7). Thus at most 2 distinct values can be removed in one step.</example>\n</note1>\n<note2>\n  <description>After t update steps on n initial values, the expected number of distinct values is at most n − 2·t, since each step can remove at most 2 distinct entries. This bound holds even if values are not uniformly sampled, as long as the update rule is deterministic.</description>\n  <example>Start with n=7 values. After 3 steps, distinct values ≤7−2·3=1. If you see only one distinct value left after 3 steps, you know the bound is tight.</example>\n</note2>\n<note3>\n  <description>For random initial values in [0,1], the probability that a particular value survives for t steps is at most (2/3)^t, since each time it must be the largest among its neighbors. Thus the expected number of survivors is at most n·(2/3)^t.</description>\n  <example>With n=5 and t=2, n·(2/3)^2≈5·(4/9)=2.22. So you expect at most 2 distinct survivors on average.</example>\n</note3>\n<note4>\n  <description>When the update rule involves maxima of neighbors, the process can be viewed as a directed graph on the n positions, where edges point from each position to its two neighbors. Convergence to a single cycle or fixed point depends on the connectivity of this graph under the max rule.</description>\n  <example>On 5 positions, if the max rule collapses all entries to the maximum at one node, that node becomes a self-loop and all others point to it. After t steps, all values move toward this loop, reducing distinctness.</example>\n</note4>\n<note5>\n  <description>To analyze the expected distinctness after t steps, partition the initial distinct values into those that survive and those that collapse into existing values. Use linearity of expectation: sum the probabilities that each initial value remains distinct.</description>\n  <example>Suppose you start with 6 distinct values. For each, compute P(survives) and sum them. If each has P≈0.4 after t steps, total expected survivors ≈6·0.4=2.4.</example>\n</note5>", "<note1>\n  <description>When repeatedly taking the maximum of a random set, the expected new value equals the maximum of the original values scaled by (1–(1–p)ⁿ). For n independent draws from [0,1] with probability p of being the current max, the expected max is p·max + (1–p)·(max–ε), where ε→0 as n→∞, yielding max·(1–(1–p)ⁿ).</description>\n  <example>With two independent draws from [0,1], the chance the first is the max is ½, so the expected max is ½·max + ½·(max–ε) → max·(1–½²) = ¾·max.</example>\n</note1>\n<note2>\n  <description>Because the maximum of n independent uniform values on [0,1] is order-statistic U₍n₎ = (n/n+1), the expected value of U₍n₎ is (n+1)/(n+2). This follows from the Beta distribution of order statistics.</description>\n  <example>For n=3, U₍3₎ = 3/4 and its expectation is (3+1)/(3+2) = 4/5, so the expected maximum of three uniform draws is 4/5.</example>\n</note3>\n<note3>\n  <description>When taking the maximum repeatedly, the set of distinct values converges to a single “peak” value almost surely. In the limit, the expected number of distinct values is 1 + the probability that the peak is not the global maximum.</description>\n  <example>With three values, the chance the global max is the peak is 1/3, so the expected distinct values are 1 + (2/3) ≈ 1.666.</example>\n</note4>\n<note4>\n  <description>For large n, the maximum of n uniform values is well-approximated by max ≈ 1 – 1/(n+1). This approximation simplifies expectation and probability calculations when n is large.</description>\n  <example>For n=1000, the expected maximum is ≈1 – 1/1001 ≈ 0.999.</example>\n</note5>\n<note5>\n  <description>To count the expected number of distinct values after k max-operations, model each original value as surviving with probability (1–(1–p)ᵏ), where p is its chance of being the current max. Summing these probabilities over all values gives the expected distinct count.</description>\n  <example>With 5 initial values and k=3 operations, each value survives with probability (1–(1–p)³), so the expected survivors is 5·(1–(1–p)³), where p is its individual max-survival chance.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 18, "abstractions": ["<note1>\n  <description>Use the uniformity of random points to model their joint distribution as a 2D area measure. For any region, the probability that two random points lie in a subregion is the ratio of the subregion’s area to the total area squared.</description>\n  <example>In a square of side L, if you pick two points uniformly, the probability they both land in a smaller sub-square of side a is (a²)/(L²).</example>\n</note2>\n<note3>\n  <description>Characterize lines by their slope–intercept form y = m x + b or by a single parameter (e.g. angle θ). Randomly chosen points impose a distribution on these parameters, allowing you to integrate over allowed slopes or angles.</description>\n  <example>For two random points in a unit square, the slope m of the line through them is a random variable. You can compute the probability that m lies in an interval [m₁, m₂] by integrating the joint density of the two points over that region.</example>\n</note3>\n<note4>\n  <description>Identify when a line intersects a specific pair of opposite edges by expressing the intersection condition in terms of the line’s parameter. Solve the resulting linear inequalities to find the range of parameters for which intersection occurs.</description>\n  <example>Given a line with slope m and y-intercept b, it intersects the left vertical edge x = 0 when y = b ≥ 0 and the right edge x = 1 when y = m + b ≤ 1. Solving these gives a region in (m,b)-space where intersection happens.</example>\n</note3>\n<note5>\n  <description>Use symmetry to reduce the number of distinct cases. In a regular polygon, opposite edges are symmetric under rotation, so you can compute the probability for one pair and multiply by the number of such pairs.</description>\n  <example>In a regular hexagon, there are three pairs of opposite edges. Finding the probability that a random line intersects one pair and then multiplying by three gives the total probability for all opposite edges.</example>\n</note2>", "<note1>\n  <description>For a regular polygon with an even number of sides, opposite edges are symmetric under the 180° rotation. A line drawn through two random interior points will intersect two opposite edges exactly when the angle between those two points lies in the range where their projection onto the polygon’s circumcircle falls between the antipodal arcs of those edges.</description>\n  <example>In a regular hexagon, label its edges E₁…E₆ in order. Opposite edges are E₁–E₄, E₂–E₅, E₃–E₆. If two random points P and Q lie on the circumcircle, the chord PQ intersects E₁ and E₄ precisely when the arc from P to Q spans the 60° sector between E₁ and E₄.</example>\n</note2>\n  <description>The probability that a random chord intersects a given pair of opposite edges equals the ratio of the measure of the favorable arc (where the chord can lie) to the total circumference. This reduces a geometric probability to a simple angular fraction.</description>\n  <example>In a circle, opposite edges correspond to a 180° arc. To find the probability that a chord intersects those edges, compute the probability that two uniformly random points on the circle lie within a 60° sector; that probability is 60°/360°.</example>\n</note3>\n  <description>Exploit rotational symmetry: by rotating the polygon or its circumcircle so that one opposite edge is aligned with a reference direction, the probability for that edge pair becomes the same as for any other. Thus one can compute for one pair and multiply by the number of pairs if needed.</description>\n  <example>For a regular hexagon, there are 3 pairs of opposite edges. After computing the probability for a specific pair, multiply by 3 to get the total probability of intersecting any opposite-edge pair.</example>\n</note4>\n  <description>Use the fact that the angle between two random points on a circle is uniformly distributed over [0,π]. The likelihood that this angle falls within a particular interval (e.g. between 60° and 120°) is the length of that interval divided by π.</description>\n  <example>If two random points on a circle are chosen, the angle between them is uniformly distributed from 0 to π. The probability that this angle lies between 60° and 120° is (120°–60°)/180° = 60°/180°.</example>\n</note5>\n  <description>Partition the event into disjoint cases based on which edges are intersected. Compute the probability for each case separately and sum them, ensuring no overlap. This approach is useful when multiple edge-pairs share the same intersection criterion.</description>\n  <example>In a regular hexagon, there are three disjoint cases where the chord intersects E₁–E₄, E₂–E₅, or E₃–E₆. Compute the probability for each case (they are identical by symmetry) and sum to get the total probability.</example>", "<note1>\n  <description>When two points are chosen uniformly in a convex polygon, the probability that the line through them crosses a specific side pair equals the proportion of all unordered pairs of points whose connecting segment intersects that side pair.</description>\n  <example>In a convex quadrilateral, to find the chance the chord crosses one pair of opposite sides, count all possible unordered point-pairs and count those whose segment meets that side pair; their ratio is the desired probability.</example>\n</note2>\n<note3>\n  <description>Use the fact that the set of all possible directions for a line through two random points is uniformly distributed on the circle. Thus, the probability a line meets a given side pair is the average over all directions of the probability that a random line in that direction crosses the pair.</description>\n  <example>For a regular pentagon, since every direction is equally likely, compute for one direction the probability a random line in that direction crosses the designated side pair, then take that value as the overall probability.</example>\n</note3>\n<note4>\n  <description>Exploit symmetry: in a regular n-gon, opposite sides are congruent and symmetrically placed. Thus, the probability that a line crosses any one chosen side pair is the same for all such pairs, reducing the problem to computing it for one pair.</description>\n  <example>In a regular hexagon, all six opposite-side pairs are equivalent by symmetry, so one computes the probability for one pair and multiplies by six if needed to cover all cases.</example>\n</note4>\n<note5>\n  <description>Parametrize the random points by two independent uniform angles (or barycentric coordinates) on the circle. Then express the condition “line crosses a side pair” as an inequality in those angles, and integrate over the unit square to find the probability.</description>\n  <example>For a convex polygon, let θ₁,θ₂ be two independent uniform angles. The event “line crosses a given side pair” corresponds to |θ₁–θ₂| &gt; θ₀ for some θ₀; one integrates 1 over the region |θ₁–θ₂| &gt; θ₀ in the unit square.</example>\n</note5>", "<note1>\n  <description>For two randomly chosen points in a convex region, the probability that the line through them intersects a specified pair of opposite edges equals the ratio of the area of the union of two “intersection zones” (one on each edge) to the total area. This follows because only those point pairs whose midpoint lies in the union of these zones yield a line crossing the edges.</description>\n  <example>In a square, the zone on one side is the set of midpoints of segments from that side to the opposite side. The union of these two zones is a rectangle whose width equals the distance between the two parallel sides and whose height is half the side length. Thus the probability is (rectangle area)/(square area).</example>\n</note1>\n<note2>\n  <description>Parametrize each point by its distance to a reference edge, with the midpoint’s position given by the average of these distances. Then the condition “midpoint lies in a given zone” becomes an inequality on the original distances, reducing the problem to checking a simple inequality.</description>\n  <example>For a triangle, let the distances from a point to the three sides be d₁,d₂,d₃. The midpoint’s distance to the first side is (d₁+d₂)/2. If the zone on that side runs from 0 to h/2, require (d₁+d₂)/2 ≤ h/2 and similarly for the other sides.</example>\n</note2>\n<note3>\n  <description>Exploit symmetry by computing the probability for one edge and multiplying by the number of symmetric edges. Since the regions for opposite edges are congruent, the total intersection probability is k times the single-edge probability, where k is the number of such pairs.</description>\n  <example>In a regular hexagon, there are three pairs of opposite edges. Compute the probability that a line crosses a single edge and multiply by 3 to get the overall probability.</example>\n</note3>\n<note4>\n  <description>Use the fact that the midpoint of two random points in a convex polygon is uniformly distributed over its interior. Hence the event “midpoint lies in a given region” is equivalent to “random midpoint falls in that region,” simplifying the region-of-interest to a known shape.</description>\n  <example>In a regular n-gon, the midpoint of two random points is uniformly distributed inside the polygon. Thus the probability that the line through them crosses an edge equals the probability that the midpoint lies in the union of the corresponding edge-zones.</example>\n</note4>\n<note5>\n  <description>Compute the area of the union of two congruent regions by adding their areas and subtracting the area of their overlap if they intersect. This principle applies whenever you need the total area covered by two shapes.</description>\n  <example>For two identical rectangles of width w and height h that overlap by a strip of width Δ, the union area is 2wh − Δh. This formula extends to any two congruent regions.</example>\n</note5>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 19, "abstractions": ["<note1>\n  <description>Use the expectation operator on a sum of independent indicators to compute expected counts. For each event of interest, form an indicator I that equals 1 if the event occurs and 0 otherwise; then the expected total number of events is ∑ E[I_i] = ∑ P(I_i=1).</description>\n  <example>Suppose you have 10 coins and want the expected number of heads. Define I_j=1 if coin j lands heads. Then E[#heads]=∑_{j=1}^{10}E[I_j]=10·(1/2)=5.</example>\n</note1>\n<note2>\n  <description>Apply linearity of expectation to combine expectations of different processes or objects without requiring independence among them. This allows you to add expected values for separate events or objects even if they interact.</description>\n  <example>In a random walk of 5 steps, let X=number of steps above the origin. You can write X=∑_{i=1}^5 I_i where I_i=1 if step i is +1 and previous cumulative sum was negative. Then E[X]=∑E[I_i], even though the I_i are not independent.</example>\n</note2>\n<note3>\n  <description>Use the law of total expectation (iterated expectation) to break a complex expectation into conditional parts. For any random times T and events A, E[T]=E[E[T|A]]+E[E[T|¬A]]. This is especially useful when the process splits into different regimes.</description>\n  <example>Consider a process that continues until either event A occurs or an external event B occurs. Let T be the total time. Then E[T]=E[E[T|A]]+E[E[T|B]], where E[T|A] is the expected time given A happens first, and E[T|B] is the expected time given B happens first.</example>\n</note3>\n<note4>\n  <description>When two merging entities combine, their expected times to absorption can be combined via the convolution of their distributions. If one entity has expected time a and the other has expected time b, the merged entity’s expected time is the convolution of their distributions, which often simplifies to (a+b)/2.</description>\n  <example>Two independent processes each have expected times a and b to reach a final state. If they merge and share resources, the expected time for the merged process is often (a+b)/2, reflecting the combined effort.</example>\n</note4>\n<note5>\n  <description>Model the merging process as a discrete Markov chain by tracking the number of active groups. Compute the expected time to absorption by solving the system of first-step equations for each state.</description>\n  <example>Let X_n be the number of groups at time n. Write E[T|X_n=k] = 1 + ∑_{m}P(X_{n+1}=m|X_n=k)·E[T|X_{n+1}=m]. Solve these equations to find E[T|X_0=K].</example>\n</note5>", "<note1>\n  <description>In a Markov chain with a finite state space, the expected time to reach an absorbing state starting from any state is given by solving the linear system E_i = 1 + Σ_{j≠absorbing} P_{i→j}·E_j for all non-absorbing states i.</description>\n  <example>Consider a 4-state chain with states A, B, C, D where D is absorbing. If from A one moves to B with probability 1/2 and to C with probability 1/2, then E_A = 1 + (1/2)E_B + (1/2)E_C. Similarly, derive E_B and E_C by their outgoing probabilities, then solve the 3×3 system.</example>\n</note2>\n<note3>\n  <description>For a process on a cycle of length N, the probability of returning to a given starting vertex after k steps is P_k = (1/N)·(1 + 2·Σ_{d|k} cos(2πd/N)). This uses the cycle’s eigenstructure.</description>\n  <example>On a cycle of length 5, the probability of returning to the start after 4 steps is P_4 = (1/5)(1 + 2(cos(2π/5) + cos(4π/5))). One computes each cosine term and sums them to get the final probability.</example>\n</note3>\n<note4>\n  <description>When two or more discrete random variables are independent, the probability that none occurs in a given trial is the product of their complementary probabilities. Summing this over trials yields the probability that at least one event occurs in at least one trial.</description>\n  <example>Suppose one variable has success probability p and another has success probability q, and they are independent. The probability that neither happens in a single trial is (1–p)(1–q). If trials are repeated n times, the probability that at least one event occurs in any trial is 1 – [(1–p)(1–q)]^n.</example>\n</note4>\n<note5>\n  <description>When a system’s state changes by a fixed increment each time, the expected time to reach a threshold from an initial state k with increment d is E = (threshold – k)/d, provided each step is equally likely to increase by d.</description>\n  <example>If a counter starts at 3 and increases by 2 each step with probability 1, the expected number of steps to reach 11 is (11–3)/2 = 4.</example>\n</note6>", "<note1>\n  <description>Use indicator variables to count events: for each potential collision or merge, define an indicator that is 1 if the event occurs and 0 otherwise. Then the expected total number of such events over a process equals the sum of the individual probabilities.</description>\n  <example>In a sequence of n trials, let I_i be 1 if a specific event happens on trial i and 0 otherwise. Then the expected number of times the event occurs is E[I] = Σ_i P(I_i), since each I_i is 1 only if that trial triggers the event.</example>\n</note1>\n<note2>\n  <description>Apply linearity of expectation: regardless of dependencies between events, the expected value of the sum of random variables equals the sum of their expectations. This lets you compute complex expected counts by summing simpler probabilities.</description>\n  <example>Suppose you flip a biased coin m times and want the expected number of heads. Define X_k as the indicator of heads on flip k. Then E[Σ_k X_k] = Σ_k P(heads)=m·p, even if flips are independent or not.</example>\n</note2>\n<note3>\n  <description>Model the process as a Markov chain by states defined by the number of snakes. Identify transition probabilities between states (e.g., moving from k snakes to k−1 or k+1) and use the law of total probability to find the expected time to reach a target state.</description>\n  <example>Consider a process where you have k tokens and each step either removes one token with probability p or adds one with probability q. Define T_k as the expected steps to absorb to 0. Then T_k = 1 + p·T_{k−1} + q·T_{k+1}, which you solve via boundary conditions.</example>\n</note3>\n<note4>\n  <description>Use the general formula for the expected number of steps to absorption in a birth–death chain with two absorbing states: if at state i the process transitions to i±1 with probabilities p_i and q_i, then the expected time to absorption is T_i = 1 + p_i·T_{i−1} + q_i·T_{i+1}, with T_0=T_N=0.</description>\n  <example>In a chain on states 0→1→…→N with p_i and q_i as given, solve the linear system T_0=0, T_N=0, and for i=1,…,N−1 compute T_i = 1 + p_i·T_{i−1} + q_i·T_{i+1} to find T_1, the expected absorption time from state 1.</example>\n</note4>\n<note5>\n  <description>For large or continuous processes, approximate the expected time using differential equations or continuous-time approximations. Replace discrete steps by infinitesimal rates to derive a differential equation for the expected time as a function of the current state.</description>\n  <example>In a continuous-time model where the rate of decrease of a quantity x is given by −r(x), the expected time to reach absorption at x=0 starting from x₀ satisfies dE/dx = r(x). Solve dE = (1/r(x))dx to get E(x₀) = ∫_{0}^{x₀} (1/r(u)) du.</example>\n</note5>", "<note1>\n  <description>In a Markov chain on a circle or line with symmetric transition probabilities, the distance between two nearest merged snakes remains a valid state variable. When two snakes merge, subtract the smaller of their distances to the merged snake, preserving the invariant that the minimum distance between any two snakes never exceeds the total number of arcs.</description>\n  <example>Suppose two snakes are 4 arcs apart and merge. The new distance to the nearest other snake is 4 minus the smaller of 4 and the new snake’s distance, ensuring the minimum distance stays ≤ total arcs.</example>\n</note1>\n<note2>\n  <description>When merging two snakes of lengths L₁ and L₂, the merged snake’s length is L₁+L₂ and its initial position is the midpoint (rounded) of the interval. This follows from the fact that each snake moves independently, so the merged object’s center is the average of the two centers.</description>\n  <example>Two snakes of lengths 3 and 2 merge into a length-5 snake at the center of the interval between their original positions, ensuring symmetry and consistency with independent random motion.</example>\n</note3>\n<note4>\n  <description>Define the absorption time T as the number of moves until only one snake remains. Compute E[T∣state S] by averaging over all possible moves: E[T∣S] = 1 + ∑_{S′→S} P(S→S′)·E[T∣S′], where S′→S means merging two snakes that touched in one move. This yields a linear system whose solution gives E[T] in the initial state.</description>\n  <example>From a state with two snakes of lengths 2 and 3, one merge takes probability 1/2, yielding a single snake of length 5 in the next state S′, while the other move leaves the same state S. Thus E[T∣S] = 1 + (1/2)·E[T∣S′] + (1/2)·E[T∣S].</example>\n</note5>\n<note6>\n  <description>When the state space is symmetric under relabeling of snakes (e.g., exchangeable lengths), absorption times for equivalent states coincide. Use this symmetry to reduce the size of the linear system by grouping states with the same multiset of lengths. This drastically cuts down on redundant variables.</description>\n  <example>Instead of tracking each state with lengths (1,2), (2,1), and (3), note that (1,2) and (2,1) yield identical expected absorption times, so one variable suffices for both, simplifying the system.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 20, "abstractions": ["<note1>\n  <description>When two triangles share a common side and both have all sides equal, they are congruent by the Side-Side-Side (SSS) criterion. Use this to assert that corresponding angles and segments are equal.</description>\n  <example>Given triangles PQR and P′QR with PQ = P′Q, PR = P′R, and QR = Q′R, conclude ∠P = ∠P′ and RP = R′P.</example>\n</note1>\n<note2>\n  <description>Reflecting a point across another point (half-turn) preserves distances. For any point X and center M, XM = MX′, where X′ is the image of X under reflection across M.</description>\n  <example>Reflect vertex X across point M to get X′. Then MX = MX′, and line segments through M parallel to XX′ remain parallel.</example>\n</note3>\n<note3>\n  <description>In a regular hexagon (or any equiangular polygon), parallel lines drawn through alternate vertices are parallel. This follows from equal interior angles, ensuring corresponding lines never meet.</description>\n  <example>In hexagon WXYZVU, side WX is parallel to side YZ, and side XY is parallel to side ZV, since each pair of alternate sides subtends equal angles.</example>\n</note4>\n<note4>\n  <description>The sum of interior angles of an n-gon is (n–2)·180°. In a regular n-gon, each interior angle is (n–2)·180°/n, and each exterior angle is 360°/n.</description>\n  <example>For a regular hexagon (n=6), each interior angle is (6–2)·180°/6 = 120°, and each exterior angle is 360°/6 = 60°.</example>\n</note5>\n<note5>\n  <description>In an equilateral triangle, the altitude from any vertex bisects the opposite side and is given by (side)/√3. This relation is useful for computing heights or distances in symmetric configurations.</description>\n  <example>For an equilateral triangle of side length s, the altitude h satisfies h = s/√3. Thus, if s = 10, then h = 10/√3 ≈ 5.77.</example>", "<note1>\n  <description>Use the Law of Cosines in any triangle to relate side lengths and the cosine of the included angle: for sides a, b, c opposite angles A, B, C, c² = a² + b² − 2ab·cos C. This connects known lengths to unknown angles or vice versa.</description>\n  <example>In a triangle with sides of length 5, 7, and 8, to find the angle opposite the side of length 8, compute cos C = (5² + 7² − 8²)/(2·5·7) = (25 + 49 − 64)/70 = 10/70 = 1/7, so C = arccos(1/7).</example>\n</note1>\n<note2>\n  <description>Apply Stewart’s theorem for a cevian in a triangle with sides a, b, c and cevian length d splitting side a into segments m and n (m + n = a): b²·m + c²·n = a(d² + m·n). Use it to find a cevian length when the base is divided.</description>\n  <example>In triangle with sides 10, 13, 15 and a cevian from the vertex opposite side 10 that divides it into segments 6 and 4, Stewart’s theorem gives 13²·6 + 15²·4 = 10(d² + 6·4). Compute 169·6 + 225·4 = 10(d² + 24) ⇒ 1014 + 900 = 10d² + 240 ⇒ 10d² = 1774 ⇒ d² = 177.4 ⇒ d = √177.4.</example>\n</note2>\n<note3>\n  <description>Exploit symmetry or rotation by 60° in equilateral triangles to create congruent triangles and equal angles. Rotating one triangle by 60° about a vertex can map points to new positions, yielding equal lengths after rotation.</description>\n  <example>Given an equilateral triangle with side length s, rotate it by +60° about one vertex. A point P on one side maps to P′ so that PP′ = s and the angle at the rotated vertex is 60°. This can help relate distances from the original vertex to P and P′.</example>\n</note4>\n<note5>\n  <description>Use the Law of Sines in triangles sharing an angle or side: a/sin A = b/sin B = c/sin C. It is especially useful when two angles and one side are known (AAS or ASA) or when two sides and a non-included angle are known (SSA).</description>\n  <example>In a triangle where angles A = 50°, B = 60° and side a = 8, compute side b = a·sin B/sin A = 8·sin 60°/sin 50° ≈ 8·(0.866/0.766) ≈ 8·1.131 ≈ 9.048.</example>\n</note5>\n<note6>\n  <description>Verify constructions and computed lengths by checking geometric invariants: equilateral triangles have equal sides and 60° angles, and cyclic points satisfy equal inscribed angles subtending the same arc.</description>\n  <example>After constructing an equilateral triangle, measure all three sides to confirm they are equal and all three angles to confirm they are 60°. If a point lies on a circle, check that inscribed angles subtending the same chord are equal.</example>", "<note1>\n  <description>When two triangles share an altitude to the same base, their areas are proportional to the lengths of the bases. Equivalently, the ratio of two triangles sharing the same height is the ratio of their bases. This holds for any segment on a common line.</description>\n  <example>Triangle PQR has base QR of length b₁ and altitude h. Triangle PRS shares the same altitude h to base RS of length b₂. Then Area(PQR)/Area(PRS) = b₁/b₂.</example>\n</note2>\n<note2>\n  <description>The area of a triangle can be expressed as ½·(base)·(height). Use this whenever you know or can determine a base and its corresponding altitude. It is fundamental for computing or comparing areas.</description>\n  <example>For triangle ABC, let BC be the base of length b and the altitude from A to BC be h. Then Area(ABC) = ½·b·h. If b and h are known, compute the area directly.</example>\n</note3>\n<note3>\n  <description>In an equilateral triangle of side length s, the altitude and the median coincide and have length (s·√3)/2. This follows from dropping a perpendicular from a vertex to the opposite side, creating two 30-60-90 right triangles.</description>\n  <example>Triangle XYZ is equilateral with side s. Dropping a perpendicular from X to side YZ yields a right triangle with hypotenuse s and shorter leg s/2. The altitude is √(s² – (s/2)²) = (s·√3)/2.</example>\n</note4>\n<note4>\n  <description>When a point lies inside a triangle, the areas of the three subtriangles formed by connecting that point to the triangle’s vertices sum to the area of the whole triangle. This provides a way to relate distances from the point to the sides.</description>\n  <example>In triangle ABC, let P be inside. Triangles PAB, PBC, and PCA have areas A₁, A₂, A₃ respectively. Then A₁ + A₂ + A₃ = Area(ABC). If A₁ and A₂ are known, A₃ = Area(ABC) – A₁ – A₂.</example>\n</note5>\n<note5>\n  <description>To find the distance from a point inside a triangle to a side, use the area formula: if a triangle has area A and base length b, then the corresponding altitude (distance from the opposite vertex to the base) is 2A/b. This lets you compute the perpendicular distance from a point to a line.</description>\n  <example>In triangle ABC, area A and base BC of length b. Let h be the altitude from A to BC, so h = 2A/b. If you know the area and base length, compute the altitude directly. This method generalizes to any side of the triangle.</example>", "<note1>\n  <description>When an equilateral triangle is constructed externally on a segment, its altitude equals (side × √3)/2, and its circumradius equals (side)/√3. This lets you locate the apex by rotating the base segment by ±60° about one endpoint by a distance equal to the side.</description>\n  <example>Given a segment of length s, construct an equilateral triangle on one end by rotating the segment by 60° and scaling by s. The apex is at a distance s from the original endpoint, perpendicular to the base.</example>\n</note1>\n  <note2>\n  <description>In a triangle with two equal sides, the altitude from the apex to the base bisects the base. Thus, if you drop an altitude into an isosceles triangle, the base is split into two equal segments of length half the base.</description>\n  <example>For an isosceles triangle with base length b and equal sides of length s, dropping the altitude from the apex splits the base into two segments of length b/2, and the altitude height is √(s²–(b/2)²).</example>\n</note2>\n  <note3>\n  <description>The Law of Cosines generalizes the Pythagorean theorem: in any triangle with sides a, b, and c opposite angles A, B, C, c² = a² + b² – 2ab·cos(C). Use it to compute a side when two sides and their included angle are known, or to find an angle when all three sides are known.</description>\n  <example>For a triangle with sides a=5, b=7, and included angle C=120°, the third side c satisfies c² = 5² + 7² – 2·5·7·cos(120°) = 25 + 49 + 35 = 109, so c = √109.</example>\n</note3>\n  <note4>\n  <description>When multiple triangles share a common vertex or side, summing their areas yields the total area. Alternatively, subtracting the areas of known triangles from a larger figure can isolate the area of the unknown one.</description>\n  <example>Suppose a large triangle has area T, and two subtriangles inside it have areas A₁ and A₂. The remaining triangle’s area is T – A₁ – A₂, which can help find unknown side lengths via area formulas.</example>\n</note4>\n  <note5>\n  <description>Coordinate geometry transforms geometric constructions into algebraic calculations. Place key points at convenient coordinates, compute side lengths using the distance formula, and solve for unknown coordinates or lengths using algebraic equations.</description>\n  <example>Place one endpoint of a segment at (0,0) and the other at (d,0). If an equilateral triangle is constructed on this segment, its apex has coordinates ((d)/2, (d·√3)/2). Use these to compute distances to other points.</example>\n</note5>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 21, "abstractions": ["<note1>\n  <description>When four points form a square, the squared distance between any two adjacent vertices equals the side squared, and the squared distance between two opposite vertices equals twice the side squared. This follows from the Pythagorean theorem applied to the side and diagonal.</description>\n  <example>Given four points A, B, C, D in order, compute AB² and AC². If AB² = s² and AC² = 2s², then A, B, C, D form a square of side s.</example>\n</note2>\n  <description>Translate each point into a vector from a common origin or coordinate system, then form dot products and magnitudes. The condition for square adjacency is that the dot product of adjacent vectors equals zero (orthogonality) and their magnitudes are equal.</description>\n  <example>Let P₁ = (x₁,y₁), P₂ = (x₂,y₂). Then vectors v = P₂–P₁ and w = P₃–P₂ satisfy v·w = 0 and |v| = |w| if P₁, P₂, P₃ form a right angle with equal legs.</example>\n</note3>\n  <description>Match the squared distances between points from different sets by equating expressions. For example, if one point set has squared lengths L₁² and L₂², and another has squared heights H₁² and H₂², set (L₁² + H₁²) = (L₂² + H₂²) to enforce equal distances under different orientations.</description>\n  <example>Suppose two stalactites of lengths L₁, L₂ and two stalagmites of heights H₁, H₂ form a square. Then (L₁² + H₁²) = (L₂² + H₂²) must hold, yielding an equation relating H₁ and H₂.</example>\n</note4>\n  <description>Use symmetry: in a square, opposite pairs of points are mirror images across the center. Thus, if one point’s height is h, the opposite point’s height is 2H–h, where H is the total height of the structure.</description>\n  <example>If the ceiling is at height H and a stalactite’s tip is at height H–L₁, its opposite stalagmite’s tip must be at height H–(2H–(H–L₁)) = H–L₁, enforcing consistency with symmetry.</example>\n</note5>\n  <description>Check for degenerate or invalid configurations by verifying that computed distances are positive and that no point lies inside the square’s boundary. Also ensure that the square’s side length is positive and finite.</description>\n  <example>A computed side length s = 0 would indicate collinear points, while negative s indicates an impossible arrangement. Discard any configuration that fails these checks.</example>", "<note1>\n  <description>When four points form a square in the plane, the sum of the squares of two opposite edge-lengths equals twice the square of the diagonal. Formally, if two opposite sides have lengths a and b, then a² + b² = d², where d is the diagonal.</description>\n  <example>Suppose two opposite edges of a quadrilateral have lengths 3 and 4. Then the diagonal connecting their opposite vertices must satisfy 3² + 4² = d², so d = 5.</example>\n</note1>\n<note2>\n  <description>In a square, each side is perpendicular to its adjacent sides, and the distance between two parallel sides equals the side length. This ensures that all four angles are right angles and all sides are equal.</description>\n  <example>If you have a quadrilateral with four right angles and four equal lengths of 6, then it must be a square, and the distance between any two parallel sides is 6.</example>\n</note2>\n<note3>\n  <description>When projecting perpendicular lengths onto a horizontal or vertical line, the squared difference of their endpoints equals the square of the vertical or horizontal separation. That is, if two vertical segments of heights h₁ and h₂ project to the same horizontal line, then (h₁ – h₂)² is the horizontal distance squared.</description>\n  <example>Two vertical posts of heights 10 and 4 lie in the plane. The horizontal distance between their bases satisfies (10 – 4)² = 36, so the distance is 6.</example>\n</note3>\n<note4>\n  <description>For two perpendicular segments of lengths a and b, the distance between their endpoints is √(a² + b²). This follows from the Pythagorean theorem in the plane.</description>\n  <example>A rope of length 5 is tied horizontally, and a vertical pole of length 12 is erected perpendicular to the rope at one end. The distance from the other end of the rope to the top of the pole is √(5² + 12²) = 13.</example>\n</note4>\n<note5>\n  <description>When the sum of two perpendicular lengths equals a given total, each length can be found by solving the system a + b = S and a² + b² = D². Substituting b = S – a into a² + b² = D² yields a quadratic in a.</description>\n  <example>Given a + b = 10 and a² + b² = 58, substitute b = 10 – a to get a² + (10 – a)² = 58, which simplifies to 2a² – 20a + 58 = 0. Solving this quadratic gives the two possible values for a.</example>\n</note5>", "<note1>\n  <description>When two segments of lengths a and b are endpoints of a square’s diagonal, the side length s satisfies s² = (a² + b²)/2 via the Pythagorean relation for the diagonal.</description>\n  <example>For diagonal lengths 1 and 2, compute s = √((1² + 2²)/2) = √(1 + 4)/2 = √(5/2).</example>\n</note1>\n<note2>\n  <description>A square’s area A can be expressed in two ways: A = side² and A = diagonal²/2. Equating these gives side² = diagonal²/2, useful when the diagonal is known.</description>\n  <example>If a square’s diagonal measures d, then its side is s = d/√2, and its area is A = (d/√2)² = d²/2.</example>\n</note3>\n<note4>\n  <description>When four lengths are arranged around a square, opposite pairs must satisfy the relation a² + c² = b² + d² so that the total area from each pair equals. This ensures the four segments can form a square.</description>\n  <example>Given segments of lengths 3, 4, 5, and 6, check 3² + 5² = 4² + 6² → 9 + 25 = 16 + 36 → 34 = 52 (not equal). Thus they cannot form a square.</example>\n</note5>\n<note6>\n  <description>For a square inscribed by perpendicular segments from two parallel planes, the total height H is the vertical separation between planes plus the vertical projection of the square’s diagonal. Use H = H₀ + s√2 to find H₀ when H and s are known.</description>\n  <example>If the square’s side is s = 5 and the total height H is 10, then the plane separation is H₀ = H – s√2 = 10 – 5√2.</example>\n</note6>", "<note1>\n  <description>Any square’s diagonal relates to its side s by d = s·√2, so if four points form a square, the distances between opposite pairs must both equal d = s·√2. This lets you set up equations linking side lengths and diagonals.</description>\n  <example>Suppose four points P, Q, R, S form a square. Then PQ = QR = RS = SP = s and PR = QS = s·√2. If PR = 10, then s = 10/√2 = 5√2.</example>\n</note1>\n<note2>\n  <description>In a right triangle, the Pythagorean theorem a² + b² = c² applies to any perpendicular segments. Use it to compute unknown heights or horizontal offsets when two perpendicular lengths meet at a right angle.</description>\n  <example>Given a vertical height h and horizontal offset d, the slanted distance L satisfies L² = h² + d². For instance, if h = 3 and d = 4, then L = 5.</example>\n</note3>\n<note3>\n  <description>When two segments of lengths a and b form a right angle, the distance between their endpoints is √(a² + b²). This is key for computing the distance between any two perpendicular structures.</description>\n  <example>A vertical stalactite of length a = 5 and a horizontal stalagmite of length b = 12 meet at right angles. The distance between their tips is √(5² + 12²) = 13.</example>\n</note4>\n<note4>\n  <description>To place a square in a plane, choose one side along a known direction and rotate it by 45° to align diagonals with the other direction. The side’s length is then the diagonal length divided by √2.</description>\n  <example>Given a diagonal of length D, the side of the square is s = D/√2. If D = 14, then s = 14/√2 = 7√2.</example>\n</note5>\n<note5>\n  <description>After constructing a square’s vertices, compute its height by finding the maximum y-coordinate of the vertices minus the minimum y-coordinate. This gives the vertical span of the square.</description>\n  <example>If the vertices have y-coordinates y₁ = 2, y₂ = 2, y₃ = 6, y₄ = 6, then the square’s height is 6 − 2 = 4.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 22, "abstractions": ["<note1>\n  <description>\nDecompose the square into four triangles sharing vertex P and use the fact that each triangle’s area is half its base times its height. Summing these areas yields a relation between the distances from P to the sides and the side length of the square.\n</description>\n  <example>\nIn a unit square, if the areas of triangles at P to three sides are a, b, and c, then the fourth must be 1–a–b–c. Summing gives the sum of distances to the four sides, which equals 2.\n</example>\n</note1>\n<note2>\n  <description>\nAssign coordinates to the square (e.g. (0,0) to (s,s)) and let P=(x,y). Write each triangle area in terms of x and y and set them equal to the given values. This yields four linear equations in x and y.\n</description>\n  <example>\nFor a unit square, triangles at P=(x,y) to sides x=0, y=0, x=s, y=s have areas xy, y(1–x), x(1–y), and (1–x)(1–y). Setting these equal to four given values gives four equations in x and y.\n</example>\n</note3>\n<note3>\n  <description>\nUse area ratios and similar triangles to relate the distances from P to opposite sides. In a square, triangles sharing an opposite side are similar, so their areas scale as the squares of their heights.\n</description>\n  <example>\nIf the area of triangle P to side AB is A₁ and to side CD is A₂, then the heights from P to AB and CD satisfy (height to AB)/(height to CD)=√(A₁/A₂), giving a direct relation between those distances.\n</example>\n</note4>\n<note4>\n  <description>\nCompute the product of distances PA·PB·PC·PD by expressing each distance as √[2·area of triangle with that base]. Multiply these square roots or use symmetry to simplify to a single radical.\n</description>\n  <example>\nIf triangle areas are A₁, A₂, A₃, A₄, then PA·PB·PC·PD = √[2A₁]·√[2A₂]·√[2A₃]·√[2A₄] = 2·√(A₁·A₂·A₃·A₄).\n</example>\n</note5>\n<note5>\n  <description>\nApply the British Flag Theorem: for any point inside a rectangle, the sum of the squares of distances to two opposite corners equals the sum for the other pair. This relates PA²+PC² and PB²+PD² without computing x,y.\n</description>\n  <example>\nIn a rectangle with side lengths a and b, if PA²+PC² = S, then PB²+PD² = S also. Combined with area-based sums of distances, one can compute S and hence distances PA, PB, PC, PD.\n</example>", "<note1>\n  <description>Compute the total area by summing the areas of the four triangles. In any convex quadrilateral partitioned by a point into four triangles, the sum of those triangle areas equals the area of the quadrilateral.</description>\n  <example>In a square of side length s, if the point P divides it into triangles of areas 1, 2, 3, and 4, then the square’s area is 1+2+3+4=10. If you know the side length is s, you can set s²=10.</example>\n</note1>\n<note2>\n  <description>Use the area formula for a triangle: area = ½·(side)·(distance to opposite side)·sin(θ). For a square of side s, each triangle area A gives a product relation dᵢ·s·sin(θᵢ)=2A, where dᵢ is the perpendicular distance from P to that side.</description>\n  <example>For a triangle with area A=1 and side s, the distance to that side satisfies d·s·sin(θ)=2, so if θ=90° then d=2/s. Summing similar relations for all four sides yields equations linking distances and side length.</example>\n</note3>\n<note3>\n  <description>Apply the Law of Cosines in each triangle to relate distances: for triangle with sides d₁, d₂ and included angle θ, d₁² + d₂² – 2d₁d₂ cos θ = (known side)². This yields equations among dᵢ and cos θᵢ.</description>\n  <example>In triangle PAB with P–A=d₁, P–B=d₂, and known AB=s, write d₁² + d₂² – 2d₁d₂ cos θ = s². Repeat for the other three triangles to get a system in dᵢ and cos θᵢ.</example>\n</note4>\n<note4>\n  <description>Exploit the fact that in a square, opposite sides are parallel and adjacent sides meet at right angles. This forces certain angles and distance relations, simplifying the system.</description>\n  <example>Since AB ∥ CD, the angle between AP and BP equals the angle between CP and DP. Thus cos θ₁ = cos θ₃ and sin θ₁ = sin θ₃, reducing the number of distinct variables in the system.</example>\n</note5>\n<note5>\n  <description>Use symmetry or angle-sum identities to eliminate variables. For example, if θ₁+θ₂=90°, then cos θ₁ = sin θ₂, allowing substitution of one trigonometric function for another.</description>\n  <example>When θ₁+θ₂=90°, replace cos θ₁ with sin θ₂ in the Law of Cosines equations. This reduces the problem to solving for d₁, d₂, d₃, d₄ in terms of s and known areas.</example>\n</note6>\n<note6>\n  <description>After reducing the system, solve for side length s in terms of known triangle areas. Then compute the product of all relevant distances via algebraic manipulation, often yielding s to a power or a constant multiple.</description>\n  <example>From the equations dᵢ·s = 2Aᵢ, express each dᵢ in terms of s. Multiply all dᵢ together to get (2A₁)(2A₂)(2A₃)(2A₄)/s², and substitute s²=total area to obtain the desired product as a constant like 4!.</example>", "<note1>\n  <description>For a point inside a convex quadrilateral, the sum of the areas of the four triangles formed by connecting that point to the vertices equals the quadrilateral’s total area. This lets you relate unknown distances to known area sums.</description>\n  <example>In a square of side length s, if a point P creates triangles with areas a, b, c, d, then s² = a + b + c + d. Thus if a, b, c, d are given, you can recover s without computing P’s coordinates.</example>\n</note1>\n<note2>\n  <description>When the areas of triangles sharing a common side are known, use area = ½·base·height to express heights in terms of the unknown distances. This converts area data into linear relations involving those distances.</description>\n  <example>Suppose triangle PAB has area A and AB = s. Then height from P to AB is h₁ = 2A/s. If another triangle PBC has area B and BC = s, its height h₂ = 2B/s. These h₁ and h₂ relate to P’s perpendicular distances to AB and BC.</example>\n</note3>\n<note3>\n  <description>Exploit symmetry or cyclic arrangements to minimize variables. In a regular polygon, rotating the configuration often produces equal-area or equal-distance relationships, reducing the number of independent unknowns.</description>\n  <example>In a square, rotating the figure by 90° maps one triangle to another. If triangles created by P to adjacent sides have areas in a certain order, symmetry implies that distances to those sides can be paired, halving the unknowns.</example>\n</note4>\n<note4>\n  <description>Use the law of cosines in each triangle to express the square of each side in terms of the known distances and the angle between them. This yields equations that can be combined for a product of distances.</description>\n  <example>In triangle PAB, PA² + PB² – 2·PA·PB·cos(∠APB) = AB². If AB is known and the sum of the remaining angles around P is fixed, you can form equations for PA·PB, PB·PC, etc., and multiply them to get PA·PB·PC·PD.</example>\n</note5>\n<note5>\n  <description>After setting up the equations, look for symmetry or cancellation when multiplying all distance expressions. Often factors such as s² or cos-term products simplify dramatically, leading to a clean final expression.</description>\n  <example>Multiplying PA·PB·PC·PD from each triangle yields a product of terms like (s² – h₁²)(s² – h₂²)… which simplifies to a constant multiple of s⁴, independent of P’s actual position.</example>", "<note1>\n  <description>Any point inside a convex quadrilateral can be split into four triangles by drawing segments to the vertices. The sum of their areas equals the total area of the quadrilateral.</description>\n  <example>For Quadrilateral WXYZ and interior point Q, draw QW, QX, QY, QZ to form triangles QWX, QXY, QYZ, QZW. Then area(QWX)+area(QXY)+area(QYZ)+area(QZW)=area(WXYZ).</example>\n</note2>\n<note2>\n  <description>When a point is inside a square, its distances to two adjacent vertices along the sides satisfy the relation d₁·d₂ = side² for those two distances. This follows from the fact that the square’s side length is the same in both directions.</description>\n  <example>In square UVWX with side length s, for any interior point R, if the distance from R to U is d₁ and to V is d₂, then d₁·d₂ = s².</example>\n</note3>\n<note3>\n  <description>Four triangles sharing the same vertex have areas proportional to the products of the two adjacent side lengths. If the included angle is right (as in a square), each area equals ½·side₁·side₂, so side₁·side₂ = 2·area.</description>\n  <example>In right triangle ABC at A, with sides AB = a and AC = b, area = ½·a·b. Hence a·b = 2·area.</example>\n</note4>\n<note4>\n  <description>In a square, the product of distances from any interior point to two opposite vertices equals the product of the distances to the other two opposite vertices: d₁·d₃ = d₂·d₄. This follows from symmetry and the fact that each pair of opposite sides is equal.</description>\n  <example>For square MNOP and interior point R, let RM·RN = d₁·d₂ and RP·RQ = d₃·d₄. Then d₁·d₃ = d₂·d₄.</example>\n</note5>\n<note5>\n  <description>Combine the relationships from notes 2, 3, and 4 to express the product of all four distances in terms of the given triangle areas. Summing the area-proportion equations and using the opposite-vertex product yields a direct formula for the total product.</description>\n  <example>Given areas of four triangles around a square are a, b, c, d, and knowing a·b = 2·A, b·c = 2·B, c·d = 2·C, d·a = 2·D, along with a·c = b·d, one finds (d₁·d₂·d₃·d₄)² = (2A·2B·2C·2D).</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 23, "abstractions": ["<note1>\n  <description>For two circles of radii R and r with centers at distance d, the length of the common external tangent segment is √(d² – (R – r)²). This follows from dropping a perpendicular from the larger center to the tangent line, forming a right triangle.\n  </description>\n  <example>Two circles have radii 5 and 2 and their centers are 7 apart. The external tangent length √(7² – (5 – 2)²) = √(49 – 9) = √40 ≈ 6.32.\n  </example>\n</note1>\n<note2>\n  <description>When a smaller circle is inscribed in a larger semicircle (or circle) so that its diameter lies along the larger’s diameter and is tangent to the larger’s arc, the distance from the smaller’s center to the larger’s center equals R – r, where R is the larger radius and r the smaller. This is a special case of the tangent–radius right triangle.\n  </description>\n  <example>For a semicircle of radius 8 and an inscribed semicircle of radius 2, the centers are 6 apart (8 – 2), ensuring the smaller’s diameter sits on the larger’s diameter and its arc is tangent to the larger.\n  </example>\n</note2>\n<note3>\n  <description>In similar triangles formed by radii and tangents, corresponding sides are proportional. If two triangles share an angle and have sides parallel, then the ratio of any pair of sides equals the ratio of corresponding radii (or distances).\n  </description>\n  <example>In a figure with two similar right triangles, one has legs 3 and 4, the other 6 and 8. The ratio of corresponding legs 3:6 = 4:8 = 1:2, matching the ratio of their hypotenuses (5:10) and other sides.\n  </example>\n</note3>\n<note4>\n  <description>The Pythagorean theorem relates the legs and hypotenuse of a right triangle via a² + b² = c². In circle–tangent problems, dropping perpendiculars often creates right triangles whose side lengths can be found by this formula.\n  </description>\n  <example>A right triangle has one leg of length 7 and hypotenuse 25. The other leg is √(25² – 7²) = √(625 – 49) = √576 = 24.\n  </example>\n</note4>\n<note5>\n  <description>When a line segment is divided by a point into two parts, the product of the part lengths equals the product of the external segments if the point lies on a tangent or secant from an external point. This is a special case of power of a point.\n  </description>\n  <example>A tangent from point P touches a circle at T, and a secant from P meets the circle at A and B. If PA = 3 and PB = 5, then PT² = PA·PB = 15, so PT = √15.\n  </example>\n</note5>", "<note1>\n  <description>For a chord of a circle, the perpendicular from the center to the chord bisects it. If the chord length is L and the distance from center to chord is d, then the radius R satisfies R² = d² + (L/2)². This lets you relate distances without computing angles.</description>\n  <example>In a circle of radius R, a chord of length L is drawn. Drop a perpendicular from the center to meet the chord at M. Then OM = d and AM = BM = L/2. Applying the Pythagorean theorem gives R² = d² + (L/2)².</example>\n</note1>\n<note2>\n  <description>When two circles are tangent internally, the distance between their centers equals the difference of their radii. If the larger circle has radius R and the smaller has radius r, then the centers are separated by |R–r|. This is key for locating tangency points along a line.</description>\n  <example>Circle C₁ has radius R and circle C₂ has radius r, with C₂ inside C₁ and tangent at one point. The line through their centers has length |R–r|. The point of tangency lies on this line at distance R–r from the center of C₁.</example>\n</note3>\n<note3>\n  <description>In a semicircle, a line from the center perpendicular to a chord meets the chord at its midpoint. Combined with the right-triangle relation from Note 1, this yields a simple formula for the chord length: L = 2·√(R² – d²), where d is the distance from center to chord.</description>\n  <example>Consider a semicircle of radius R and a chord at distance d from the center. Draw the perpendicular from the center to the chord, meeting it at M. Then AM = BM = √(R² – d²), so the full chord length is L = 2·√(R² – d²).</example>\n</note4>\n<note4>\n  <description>For three semicircles in nested tangency, the distances between their centers and the chord serve as a chain of relations. One can set up ratios or differences of radii along the diameter to solve for an unknown length without solving for each center position.</description>\n  <example>Let R₃, R₂, R₁ be the radii of the three semicircles in descending order, and let d₃₂, d₂₁ be the distances from the center of each to the chord. Then R₃ – R₂ = d₃₂ and R₂ – R₁ = d₂₁. Solving these gives R₂ = (R₃ + R₁)/2 and d₂₁ in terms of R₁ and R₃.</example>\n</note5>\n<note5>\n  <description>Mass point geometry can handle nested tangency problems by assigning “masses” to each circle’s center proportional to its radius. The balance condition at the chord gives the unknown segment lengths directly via mass ratios.</description>\n  <example>Assign masses m₁ and m₃ to the centers of the inner and outer semicircles, proportional to R₁ and R₃. The tangency point on the chord is then the weighted average of the centers, and the distances AC and CB follow from the mass ratios m₁:m₃.</example>", "<note1>\n  <description>When two circles are tangent internally, the distance between their centers equals the difference of their radii. This allows one to relate the center coordinates or distances to known radii.</description>\n  <example>Circle C₁ of radius r₁ is inscribed inside circle C₂ of radius r₂. If the centers are O₁ and O₂, then O₂O₁ = |r₂ − r₁|. For instance, if r₁=3 and r₂=7, then O₂O₁=4.</example>\n</note1>\n<note2>\n  <description>For a circle inscribed in a semicircle with its diameter as a chord, the midpoint of that diameter lies on the center of the inscribed circle. This follows from the circle’s symmetry about its diameter.</description>\n  <example>Suppose a circle of radius r is inscribed in a semicircle of radius R, and its diameter endpoints are D₁ and D₂. The center of the inscribed circle lies at the midpoint of D₁D₂. If D₁D₂ spans from x=0 to x=2r, then the center is at x=r.</example>\n</note2>\n<note3>\n  <description>Two diameters of nested semicircles are parallel if and only if the centers of the corresponding circles lie on a horizontal line. This alignment simplifies coordinate placement and distance calculations.</description>\n  <example>Let semicircles of radii r and R have diameters parallel. Place the larger’s center at (0,0) and the smaller’s at (h,0). Then their diameters lie on the same horizontal axis, making it easy to compute h in terms of r and R.</example>\n</note3>\n<note4>\n  <description>To find the point of tangency between a circle and a line, set the distance from the circle’s center to the line equal to the circle’s radius. Use the formula |Ax₀ + By₀ + C|/√(A²+B²) = r for line Ax+By+C=0 and center (x₀,y₀).</description>\n  <example>A circle centered at (d,0) with radius r is tangent to the x-axis (line y=0). The distance from (d,0) to y=0 is |0·d + 1·0 + 0|/√1 = 0, so the tangency point is (d,0) itself. For a slope m, the condition is |m·d + 0|/√(1+m²) = r.</example>\n</note4>\n<note5>\n  <description>The power of a point theorem states that for any point P and a circle, the product of the distances along any secant through P to the circle equals a constant (the power of P). In particular, if a secant meets the circle at points X and Y, then PX·PY is constant for all secants through P.</description>\n  <example>Let P be a point on the x-axis at distance d from the y-axis. A secant through P meets a circle centered at the origin with radius r at points A and B. Then PA·PB = d² − r² for all such secants.</example>\n</note5>", "<note1>\n  <description>When a smaller semicircle is inscribed in a larger semicircle with its diameter as a chord, the center of the smaller semicircle lies at the perpendicular bisector of that chord. This follows from the fact that the center of any circle lies on the perpendicular bisector of any chord.</description>\n  <example>Consider a large semicircle of radius R with diameter endpoints P and Q. A smaller semicircle is inscribed so that its diameter lies on PQ. The center of the small semicircle must lie on the line perpendicular to PQ at its midpoint M. Thus the small semicircle is centered at some point on that perpendicular bisector.</example>\n</note2>\n  <description>Using the Pythagorean theorem in the right triangle formed by the centers of the two semicircles and one endpoint of the chord yields a relation between their radii. Specifically, if O₁ and O₂ are the centers and r₁, r₂ are the radii, then (O₁O₂)² = (distance along the diameter)² + (r₁ + r₂)².</description>\n  <example>Let O₁ be the center of the small semicircle of radius r₁, and O₂ the center of the large of radius R. If the small diameter lies on the large diameter, then O₁O₂² = (distance from O₂ to the chord)² + (r₁ + r₂)². By plugging in the known distances, one can solve for r₂ in terms of r₁ and known chord length.</example>\n</note3>\n  <description>For a semicircle inscribed in another, the tangency point on the chord satisfies the condition that the distance from the chord to the center of the inscribed semicircle equals its radius. This ensures the arc of the smaller semicircle just touches the chord.</description>\n  <example>Given a large semicircle with diameter AB and a smaller semicircle of radius r₁ inscribed so that its diameter lies on AB, let the tangency point be C. Then the perpendicular distance from C to the center O₁ of the small semicircle is exactly r₁. This gives a linear equation involving the unknown coordinates of C.</example>\n</note4>\n  <description>The power of a point (PtoA) theorem states that for any point X on a line through the center of a circle, the product of the distances from X to the two intersection points with the circle is constant. In inscribed semicircles, this can relate the segments created by a chord or diameter.</description>\n  <example>For a chord AB of a circle and a point C on AB, if a line through C meets the circle again at D and E, then CA·CB = CD·CE. This can be used to relate the distances AC and CB when combined with the known radius and center positions.</example>\n</note5>\n  <description>Homothety (scaling) between two similar semicircles can be used to relate their radii and positions. The center of homothety lies on the line joining the centers of the two semicircles, and the ratio of distances from that center to each semicircle's center equals the ratio of their radii.</description>\n  <example>Let O₁ and O₂ be the centers of two semicircles with radii r₁ and r₂. A homothety centered at H with ratio r₂/r₁ maps O₁ to O₂. If the large semicircle is twice the radius of the small, then H divides O₁O₂ in the ratio 2:1. This helps locate the tangency point or relate segment lengths on the diameter.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 24, "abstractions": ["<note1>\n  <description>In an equilateral triangle, the circumradius R equals side length s divided by √3, and the distance from any vertex to the centroid is 2/3 of the altitude. Use these to relate side lengths to distances to key points.</description>\n  <example>In a triangle with side length s, the altitude is (√3/2)s, so the centroid-to-vertex distance is (2/3)(√3/2)s = s/√3, and the circumradius is s/√3.</example>\n</note1>\n<note2>\n  <description>For any triangle, the Law of Cosines states that for sides a, b, c and included angle γ opposite side c, c² = a² + b² − 2ab·cos γ. Use this to compute a side or angle when two sides and the included angle (or three sides) are known.</description>\n  <example>In triangle XYZ with sides XY = 4, XZ = 5, and ∠Y XZ = 60°, the opposite side YZ is √(4² + 5² − 2·4·5·cos 60°) = √(16 + 25 − 20) = √21.</example>\n</note3>\n<note3>\n  <description>The Power of a Point theorem with respect to a circle: for a point P and a secant through P meeting the circle at X and Y, PX·PY equals the power of P. Use this to relate segment products when a point lies outside or inside a circle.</description>\n  <example>Let P be outside a circle, and a line through P meets the circle at X and Y. If PX = 2 and PY = 7, then PX·PY = 14 is the power of P, which also equals the square of the tangent from P minus the square of the external segment.</example>\n</note4>\n<note4>\n  <description>Thales’ theorem: any angle inscribed in a semicircle is a right angle. If a triangle has one side as diameter of its circumcircle, then the angle opposite that diameter is 90°.</description>\n  <example>In a circle with diameter AB, any point C on the circle satisfies ∠ACB = 90°. Thus, if AC = 3 and BC = 4, then AB = 5 by the Pythagorean theorem.</example>\n</note5>\n<note5>\n  <description>Angle chasing in cyclic quadrilaterals: opposite angles sum to 180°, and equal inscribed angles subtend equal arcs. Use these to relate unknown angles in configurations involving circles.</description>\n  <example>In cyclic quadrilateral WXYZ, if ∠WXY = 70°, then ∠WZY = 110° (supplementary). If two inscribed angles at X and Y both subtend arc WZ, they are equal.</example>\n</note6>", "<note1>\n  <description>Thales’ theorem: In any circle, an angle subtended by a diameter is a right angle. Its converse states that if an angle in a triangle is 90°, the segment opposite that angle is a diameter of the circumscribed circle.</description>\n  <example>Given a circle with diameter AB, any point C on the circle satisfies ∠ACB=90°. Conversely, if in triangle DEF ∠DEF=90°, then EF is the diameter of the circle passing through D, E, F.</example>\n</note1>\n<note2>\n  <description>In an equilateral triangle, the distance from any vertex to the circumcenter is equal to the side length divided by √3, and the circumradius equals 2/3 of the altitude. Use these to relate side length to distances from the center.</description>\n  <example>In an equilateral triangle with side length s, the altitude is (s√3)/2, so the circumradius R = (s√3)/3. Thus, if s=10, then R=10√3/3.</example>\n</note3>\n<note3>\n  <description>Reflecting a point across the circumcenter of an equilateral triangle maps it to a point on the same circumcircle, preserving distances to the center. This can convert distance relations into known diameters or radii.</description>\n  <example>Let O be the circumcenter of an equilateral triangle and P any point. Reflect P across O to P′. Then OP′=OP and both P and P′ lie on the circumcircle, so ∠P′OP is a diameter angle.</example>\n</note4>\n<note4>\n  <description>When two circles intersect, the power of a point theorem relates the products of the lengths of the segments along each circle through that point. For two intersecting circles at X and Y, for any point P, PX·PY (for one circle) equals PX·PY (for the other).</description>\n  <example>Circle1 and Circle2 meet at X and Y. If P lies on Circle1 and PX·PY=12, then for any other point Q on Circle2, QX·QY also equals 12, enabling computation of unknown segments.</example>\n</note5>\n<note5>\n  <description>In any triangle, the Law of Cosines relates the lengths of the sides to the cosine of one angle: for sides a, b with included angle γ, the opposite side c satisfies c² = a² + b² – 2ab·cos γ. Use this to find unknown side lengths from known angles.</description>\n  <example>In ΔABC, if BC=7, CA=8, and ∠C=60°, then AB² = 7² + 8² – 2·7·8·cos 60° = 49 + 64 – 112·½ = 113, so AB = √113.</example>", "<note1>\n  <description>In an equilateral triangle, the circumcenter, centroid, and orthocenter coincide, and the circumradius R satisfies R = side / √3. This lets you switch between side lengths and distances to vertices without extra steps.</description>\n  <example>For an equilateral triangle with side length s, the distance from the center to any vertex is R = s/√3. Thus if s = 10, R = 10/√3.</example>\n</note1>\n<note2>\n  <description>The Inscribed Angle Theorem: An angle formed by two chords in a circle is half the measure of its intercepted arc. Use this to relate angles at the circumference to arc measures.</description>\n  <example>In a circle, if an inscribed angle intercepts an arc of 100°, then the angle at the circumference is 50°. Conversely, if an angle is 40°, its intercepted arc is 80°.</example>\n</note2>\n<note3>\n  <description>Power of a Point: For a point P inside a circle, if two chords through P meet the circle at U and V, and W and X, then PU·PV = PW·PX. This is useful to relate segment lengths when chords intersect inside the circle.</description>\n  <example>If chords through P meet the circle at U,V and W,X, and PU = 3, PV = 5, then PW·PX = 15. If PW = 2, then PX = 7.5.</example>\n</note3>\n<note4>\n  <description>Thales’ Theorem: A triangle inscribed in a circle with its hypotenuse as a diameter is a right triangle. This identifies right angles when a diameter is used as one side.</description>\n  <example>Given a circle with diameter AB, any point C on the circle forms the right triangle ABC with the right angle at C.</example>\n</note5>\n<note6>\n  <description>Reflection across a diameter: Reflecting a point across the diameter of a circle maps it to another point on the circle. This can simplify angle chasing or show congruent segments.</description>\n  <example>Reflect point P across the diameter AB of a circle to get P'. Then P' lies on the circle, and for any chord through P, the reflected chord through P' is symmetric, aiding in angle or length comparisons.</example>", "<note1>\n  <description>In an equilateral triangle, the circumcenter, centroid, and orthocenter coincide at the same point, and the distance from any vertex to that point is two-thirds of the altitude. This lets you locate the circumcenter by dropping the altitude and measuring two-thirds of its length to the base.</description>\n  <example>For an equilateral triangle of side length s, the altitude is (s·√3)/2, so the distance from a vertex to the circumcenter is (2/3)·(s·√3)/2 = (s·√3)/3.</example>\n</note1>\n<note2>\n  <description>When a point P satisfies ∠BPC=120° inside triangle ABC, reflect P across BC to P′. Then ∠BPC=120° implies BP′C=60°, so BP′C is equilateral. This construction turns an angle condition into an equilateral triangle, which often yields equal side lengths.</description>\n  <example>Given ∠BPC=120°, reflect P over BC to P′. In triangle BP′C, BP′=CP′=BC, and ∠BP′C=60°, so BP′C is equilateral.</example>\n</note3>\n<note3>\n  <description>The Power of a Point theorem states that for any point P inside a circle, if a line through P meets the circle at X and Y, then PX·PY equals the power of P. In particular, for a circle with diameter AB, the power of P is PA·PB. This relation lets you relate segments when a circle is defined by a diameter.</description>\n  <example>Let AB be a diameter of a circle and P any interior point. If a line through P meets the circle again at X, then PX·PY = PA·PB, where Y is the second intersection with the circle through P.</example>\n</note4>\n<note4>\n  <description>The circumcircle of an equilateral triangle has radius R = s/√3, where s is the side length. Any point on this circumcircle satisfies the chord-length formula: for two points U and V on the circle, UV = 2R·sin(∠UOV/2), where O is the center.</description>\n  <example>In an equilateral triangle of side s, the circumradius is R = s/√3. If U and V lie on the circumcircle and subtend a central angle of θ at O, then UV = 2·(s/√3)·sin(θ/2).</example>\n</note5>\n<note5>\n  <description>When two circles intersect, the radical axis (the line of points with equal power to both circles) is perpendicular to the line joining their centers. If the radical axis also passes through a known point, it can be used to locate intersection points by dropping perpendiculars from centers to that axis.</description>\n  <example>Circles centered at O₁ and O₂ intersect. Their radical axis is ℓ. If a known point P lies on ℓ, then the line through P perpendicular to O₁O₂ meets the circles at the intersection points X and Y.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 25, "abstractions": ["<note1>\n  <description>The circumcenter of a triangle is the intersection of its perpendicular bisectors, and it is equidistant from all three vertices. For any triangle with side lengths a, b, c opposite vertices A, B, C, the circumcenter’s position can be found by solving the bisector equations or by using coordinates for convenient computation.</description>\n  <example>Given triangle with vertices at (0,0), (a,0), and (0,b), its perpendicular bisectors of the sides between (0,0)-(a,0) and (0,0)-(0,b) intersect at the circumcenter, which lies at (a/2, b/2). This point is equidistant from all three vertices.</example>\n</note1>\n<note2>\n  <description>For a triangle with side lengths a, b, c, the circumradius R satisfies R = (a b c)/(4K), where K is the triangle’s area. This comes from the extended law of sines: c/sin(C)=2R, and K = ½ab sin(C). It’s useful for finding distances from the circumcenter to vertices without computing all bisectors.</description>\n  <example>In a triangle with sides 5, 6, 7, the area is √[s(s−5)(s−6)(s−7)] with s=9, giving K=10. Then R = (5·6·7)/(4·10) = 210/40 = 5.25, so the circumcenter is 5.25 units from each vertex.</example>\n</note2>\n<note3>\n  <description>The area of a convex quadrilateral with vertex coordinates (x₁,y₁), (x₂,y₂), (x₃,y₃), (x₄,y₄) can be computed by dividing it into two triangles (e.g. (1–2–3) and (1–3–4)) and summing their areas: ½|x₁y₂−x₂y₁ + x₂y₃−x₃y₂ + x₃y₄−x₄y₃ + x₄y₁−x₁y₄|. This avoids special formulas for cyclic or trapezoidal cases.</description>\n  <example>For quadrilateral with vertices (0,0),(2,0),(3,1),(1,2), compute two triangle areas: ½|0·0−2·0 + 2·1−3·0 + 3·2−1·1 + 1·0−0·2| = ½|0+2+6−1+0| = 7/2. The total is 7/2.</example>\n</note3>\n<note4>\n  <description>In a trapezoid with parallel sides of lengths L₁ and L₂ and height h, the midpoints of the non-parallel sides form a segment of length (L₁+L₂)/2, which is the average of the bases. This mid-segment is parallel to the bases and has length equal to the average of the lengths of the two bases.</description>\n  <example>For a trapezoid with top base 6 and bottom base 10 and height 4, the mid-segment between the midpoints of the legs is (6+10)/2 = 8, parallel to the bases, and its distance from each base is half the height, i.e. 2.</example>\n</note4>\n<note5>\n  <description>When two points are equidistant from the endpoints of a segment, they lie on the perpendicular bisector of that segment. If three such points each lie on a distinct perpendicular bisector of two sides of a triangle, their intersection is the circumcenter. This criterion helps locate the circumcenter via bisector intersections.</description>\n  <example>In triangle with vertices A, B, C, let P be equidistant from A and B, and Q equidistant from B and C. Then P and Q lie on the perpendicular bisectors of AB and BC, respectively. Their intersection O is the circumcenter of triangle ABC.</example>\n</note5>", "<note1>\n  <description>Four points lie on a common circle if and only if the perpendicular bisectors of any two connecting segments intersect at a single point. This “perpendicular bisector intersection” test is used to identify cyclic quadrilaterals and to locate their circumcenter.</description>\n  <example>Given points P, Q, R, and S, draw the perpendicular bisectors of PQ and QR. If they meet at O, then O is the circumcenter of ΔPQR. To confirm all four points lie on a circle, check the bisector of RS also passes through O.</example>\n</note2>\n<note2>\n  <description>The circumcenter of any triangle is equidistant from its three vertices, so the distance from the circumcenter to each vertex is the triangle’s circumradius. This radius can be computed via R = (abc)/(4Δ), where a, b, c are side lengths and Δ is the triangle’s area.</description>\n  <example>In ΔXYZ with sides x, y, z and area Δ, compute R = (x·y·z)/(4Δ). Then the circumcenter O satisfies OX = OY = OZ = R, ensuring O is equidistant from all three vertices.</example>\n</note3>\n<note3>\n  <description>A polygon formed by connecting the circumcenters of adjacent triangles around a common quadrilateral is homothetic to the original quadrilateral with homothety center at the intersection of its diagonals. This homothety maps each vertex of the quadrilateral to its adjacent circumcenter along the diagonal.</description>\n  <example>For quadrilateral WXYZ, the intersection of diagonals WY and XZ is H. Then O₁ = H + (O₂ – H)·k, where O₁, O₂ are circumcenters of triangles around WY and XZ. The factor k relates the distances from H to the original vertices and to the new circumcenters.</example>\n</note4>\n<note4>\n  <description>The area of a homothetic image is the square of the homothety ratio times the original area: Area_new = k²·Area_old. Use this when a new shape is obtained by scaling the original shape from a fixed point.</description>\n  <example>If a quadrilateral has area A and its circumcenter polygon is obtained by homothety with ratio k from the same quadrilateral, then the circumcenter polygon’s area is k²·A. For instance, if k = 3/2, the new area is (3/2)²·A = 9/4·A.</example>\n</note5>\n<note5>\n  <description>When multiple formulas involve the same repeated expression (e.g. the triangle area or side lengths), introduce a variable for it to simplify algebra. This reduces clutter and makes error-checking easier.</description>\n  <example>In ΔUVW, let Δ = area(UVW). Then circumradius R = (UV·VW·WU)/(4Δ). If Δ appears in several subsequent steps, replace Δ with a single symbol throughout to streamline the computation.</example>", "<note1>\n  <description>In any triangle, the circumcenter is the intersection of the perpendicular bisectors of its sides. It lies on the perpendicular bisector of each side and is equidistant from the triangle’s vertices.</description>\n  <example>Given a triangle with vertices P, Q, R, construct the perpendicular bisector of PQ and the perpendicular bisector of QR. Their intersection O is the circumcenter, satisfying OP=OQ=OR.</example>\n</note2>\n<note2>\n  <description>Opposite sides of a quadrilateral formed by connecting two opposite circumcenters of a cyclic quadrilateral are equal in length. This follows because each segment is the sum or difference of two equal circumradii.</description>\n  <example>In a cyclic quadrilateral with circumcenters O₁ and O₂ of triangles sharing one side, the segment O₁O₂ equals the sum of two circumradii minus a common projection, making it equal to the opposite side formed by O₃O₄ for the other pair.</example>\n</note3>\n<note3>\n  <description>The circumradii of triangles sharing an edge are equal since they all subtend the same chord. Thus, any quadrilateral formed by their circumcenters has equal adjacent sides.</description>\n  <example>For triangles sharing side XY, the circumradius R₁ of ΔX YZ and R₂ of ΔX YW are equal. Hence, the segments connecting circumcenters of ΔX YZ and ΔX YW to the next triangle’s circumcenter are equal in length.</example>\n</note4>\n<note4>\n  <description>In any cyclic quadrilateral, the perpendicular bisectors of its sides concur at the circumcenter. Connecting these bisectors’ intersections yields a parallelogram, since each pair of opposite sides are equal and parallel.</description>\n  <example>Given cyclic quadrilateral WXYZ, its perpendicular bisectors of WX and YZ meet at O. Connecting O to the bisectors of WY and XZ forms a parallelogram whose opposite sides are equal to the distances between circumcenters of adjacent triangles.</example>\n</note5>\n<note5>\n  <description>A quadrilateral with two pairs of equal adjacent sides is a parallelogram. Its area can be computed as the product of one pair of adjacent sides and the sine of the included angle.</description>\n  <example>For a parallelogram with side lengths a and b and included angle θ, the area is a·b·sin θ. If a=b, it becomes a²·sin θ, simplifying the computation of area using known trigonometric values.</example>", "<note1>\n  <description>In any triangle, the circumcenter is the intersection of the perpendicular bisectors of its sides. It lies at the center of the unique circle passing through all three vertices and is equidistant from them.</description>\n  <example>For triangle with vertices P, Q, R, draw lines through the midpoints of PQ and PR perpendicular to PQ and PR, respectively; their intersection O is the circumcenter satisfying OP = OQ = OR.</example>\n</note2>\n  <description>The circumcenter of a triangle with side lengths a, b, c and opposite angles A, B, C can be found by projecting one vertex onto the perpendicular bisector of another side. If a triangle has sides a, b, c, then the distance from one vertex to the circumcenter equals (a·b·c)/(4·Area).</description>\n  <example>Given triangle with side lengths 5, 6, 7, compute its area via Heron’s formula or ½·b·c·sin(A), then use (5·6·7)/(4·Area) to find the circumradius R. The circumcenter is then at distance R from each vertex along the perpendicular bisector of the opposite side.</example>\n</note3>\n  <description>The locus of points equidistant from two fixed points P and Q is the perpendicular bisector of segment PQ. In a quadrilateral formed by circumcenters of four triangles sharing common sides, each pair of adjacent circumcenters lies on a perpendicular bisector of a shared side.</description>\n  <example>Let O₁ and O₂ be circumcenters of triangles sharing side AB. Then O₁ and O₂ lie on the perpendicular bisector of AB. Similarly, their neighbors lie on the perpendicular bisectors of the other shared sides, forming a cyclic structure.</example>\n</note4>\n  <description>Four points are concyclic if and only if the sum of two pairs of opposite angles equals 180°. In a quadrilateral formed by circumcenters, checking that the sum of opposite angles at vertices is 180° confirms it lies on a common circle.</description>\n  <example>Given quadrilateral O₁O₂O₃O₄, compute ∠O₁O₂O₃ and ∠O₂O₃O₄. If ∠O₁O₂O₃ + ∠O₂O₃O₄ = 180°, then O₁, O₂, O₃, O₄ are concyclic, and one can apply circle theorems to relate them.</example>\n</note5>\n  <description>Once a quadrilateral is known to be cyclic, its area can be found by the extended Law of Sines: Area = (a·b·sin(C))/2, where a, b are two adjacent sides and C is the included angle. Alternatively, Brahmagupta’s formula gives Area = √[(s–a)(s–b)(s–c)(s–d)] for a cyclic quadrilateral with semiperimeter s = (a+b+c+d)/2.</description>\n  <example>For a cyclic quadrilateral with side lengths a, b, c, d and opposite angles A, C, one can compute its area as ½·a·b·sin(C) + ½·c·d·sin(A) or use Brahmagupta’s formula √[(s–a)(s–b)(s–c)(s–d)] with s = (a+b+c+d)/2.</example>\n</note6>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 26, "abstractions": ["<note1>\n  <description>Area of a triangle via two sides and the included angle is ½·(side₁)·(side₂)·sin(included angle). Use this when two sides and their included angle are known, avoiding Heron’s formula.</description>\n  <example>In △XYZ, sides XY=5, XZ=7, and ∠Y XZ=60°. Then [X Y Z]=½·5·7·sin60°=½·35·(√3/2)=87.5·√3/4≈11.9. This avoids computing the third side or the circumradius.</example>\n</note1>\n<note2>\n  <description>When a point P divides side BC in ratio m:n, the area of △P B C to △A B C is m/(m+n). This follows from the fact that triangles on the same altitude have areas proportional to their bases.</description>\n  <example>In △ABC, let P on BC satisfy BP:PC=2:3. Then [P B C]/[A B C]=2/(2+3)=2/5. Thus the smaller triangle occupies 40% of the whole.</example>\n</note2>\n<note3>\n  <description>The Angle Bisector Theorem states that an internal angle bisector divides the opposite side in the ratio of the adjacent sides. Use it when a ray from a vertex bisects the angle at that vertex.</description>\n  <example>In △XYZ, ray YW bisects ∠XYZ. If XY=4 and YZ=6, then WX:XZ=4:6=2:3. So WX is 2/5 of WZ and XZ is 3/5 of WZ.</example>\n</note4>\n<note5>\n  <description>The Law of Sines: In any triangle, a/sin(A)=b/sin(B)=c/sin(C). Use it to find unknown angles or sides when two angles and one side (or two sides and a non-included angle) are known.</description>\n  <example>In △ABC, ∠A=30°, ∠B=45°, and side a=10. Then b=10·sin45°/sin30°=10·(√2/2)/(1/2)=10√2. This yields side b without computing the third side or altitude.</example>\n</note5>\n<note6>\n  <description>Mass Points: Assign weights to vertices so that each cevian balances. The ratio in which a cevian divides a side equals the ratio of the opposite vertex’s mass to the sum of the other two masses.</description>\n  <example>In △ABC, point D on BC satisfies BD:DC=2:3. Assign mass 3 at B and mass 2 at C. Then the mass at A is 5. To find where the cevian from A meets BC, use those masses directly.</example>", "<note1>\n  <description>Angle Bisector Theorem: In any triangle, an internal angle bisector divides the opposite side into segments proportional to the adjacent sides, i.e. if a bisector from vertex V meets side W→X at point P, then WP:PX = VW:VX.</description>\n  <example>In triangle VWX with VW=4 and VX=6, an internal bisector from V meets WX at P. Then WP:PX = 4:6 = 2:3.</example>\n</note1>\n  <note2>\n  <description>Area Ratio by Side-Segment Ratio: If a point P divides side XY of triangle ABC, then the area ratio [APC]/[ABC] equals the ratio XP:XY. More generally, [APC]/[ABC] = XP/XY.</description>\n  <example>In triangle ABC, let P lie on BC with BP:PC = 1:2. Then [APC]/[ABC] = PC/BC = 2/3.</example>\n</note2>\n  <note3>\n  <description>Mass Point Geometry: Assign “masses” to vertices so that side-segment ratios become lever balances. A point P on XY satisfies XP:X Y = mass at Y:mass at X. This method computes multiple segment ratios simultaneously.</description>\n  <example>In triangle ABC, let D on AB satisfy AD:DB = 2:3, and E on AC satisfy AE:EC = 4:1. Assign masses 3 at A, 2 at B, and 1 at C. Then D and E balance, and you can find BE:ED.</example>\n</note4>\n  <note5>\n  <description>Trigonometric Area Formula: The area of triangle ABC can be written as ½·AB·AC·sin(∠BAC). This is useful when a given angle is involved and side lengths are known.</description>\n  <example>In triangle ABC with AB=5, AC=7, and ∠BAC=60°, the area is ½·5·7·sin60° = 17.5·(√3/2) = (35√3)/4.</example>\n</note5>\n  <note6>\n  <description>Area Ratios via Altitudes: If two triangles share the same altitude from a vertex, their area ratio equals the ratio of their bases. Conversely, if they share the same base, the ratio equals the ratio of their altitudes.</description>\n  <example>Triangles ABD and ACD share altitude from A on line BD. If BD is divided at P so that BP:PD = 3:2, then [ABP]/[APD] = BP:PD = 3:2.</example>\n</note6>", "<note1>\n  <description>Angle Bisector Theorem: In any triangle, an internal angle bisector divides the opposite side into segments proportional to the adjacent sides. Formally, if an angle at vertex A is bisected, then the two segments on BC satisfy BD/DC = AB/AC.</description>\n  <example>In triangle ABC, the bisector of ∠A meets BC at D. If AB = 5 and AC = 7, then BD/DC = 5/7, so if BC = 12, BD = 5 and DC = 7.</example>\n</note1>\n<note2>\n  <description>Stewart’s Theorem: For a triangle with sides of lengths a, b, c and a cevian of length d dividing side a into segments m and n, the relation holds: b²·m + c²·n = a(d² + m·n). It is used to find unknown lengths of cevians or to relate areas via side segments.</description>\n  <example>In triangle ABC with BC = a, AB = c, AC = b, and a cevian AD dividing BC into BD = m and DC = n, Stewart’s theorem gives c²·m + b²·n = a(d² + m·n), allowing d or one of m,n to be solved.</example>\n</note3>\n<note4>\n  <description>Area Ratio via Side Segment Ratio: In any triangle, if a point divides one side in the ratio m:n, then the areas of the two sub-triangles sharing the same altitude from the opposite vertex are in the ratio m:n. This follows from (1/2·base·height) proportionality.</description>\n  <example>Let D be on BC of triangle ABC with BD/DC = 3/2. Then area(ABD)/area(ADC) = 3/2, since both triangles share altitude from A.</example>\n</note5>\n<note6>\n  <description>Mass Point Geometry: Assign weights to vertices so that each cevian balances like a lever. The ratio in which a cevian divides a side equals the ratio of the opposite vertex’s weight to the sum of the other two weights. This technique streamlines ratio and area computations.</description>\n  <example>In triangle ABC, suppose AD divides BC in ratio BD/DC = 2/3. Assign weight 3 at B and weight 2 at C; then the mass at A can be chosen so that AD balances, and area ratios follow directly from these weights.</example>\n</note6>", "<note1>\n  <description>Angle Bisector Theorem: In any triangle, an internal angle bisector divides the opposite side into segments proportional to the adjacent sides. Formally, if a point D on BC satisfies ∠BAD = ∠DAC, then BD/DC = AB/AC.</description>\n  <example>In triangle ABC with AB = 5 and AC = 7, the bisector of ∠A meets BC at D. Then BD/DC = 5/7, so if BC = 12, BD = (5/12)·12 = 5 and DC = 7.</example>\n</note1>\n<note2>\n  <description>Internal Similarity: If two points on the sides of a triangle satisfy equal angles at the third vertex, the smaller triangle formed by these points is similar to the original. Corresponding sides are in the same ratio.</description>\n  <example>In triangle ABC, let E on AB and F on AC satisfy ∠BEC = ∠BFC. Then ∠EBC = ∠FCB and ∠BEC = ∠BFC, so ∆BEC ∼ ∆BFC with BE/BC = BF/BC = BE/BF.</example>\n</note3>\n<note3>\n  <description>Area Ratio via Side-Splitting: For any triangle, the ratio of areas of two subtriangles sharing the same altitude equals the ratio of their bases. Hence, if a point P on BC divides it into BP and PC, then [APB]/[APC] = BP/PC.</description>\n  <example>In triangle ABC, let P be on BC with BP/PC = 3/5. If A is above BC, then [APB]/[APC] = 3/5, since both share altitude from A to BC.</example>\n</note4>\n<note4>\n  <description>Mass Point Geometry: Assign masses at vertices so that the weighted sum of masses at endpoints of a side equals the mass at the dividing point. The ratio in which the point splits a side equals the inverse ratio of the masses at the endpoints.</description>\n  <example>In triangle ABC, if D on BC satisfies BD/DC = 2/3, assign mass 3 at B and 2 at C. Then D balances these masses, and any cevian from A to D can be handled by summing the masses at A, B, and C.</example>\n</note5>\n<note5>\n  <description>Stewart’s Theorem: In triangle ABC with a cevian AD meeting BC at D, the relation AB²·DC + AC²·BD = AD²·BC + BD·DC·BC holds. It allows computation of a cevian length or segment ratios without coordinates.</description>\n  <example>In triangle ABC with AB = 4, AC = 5, BC = 6, and D on BC with BD = 2, DC = 4, Stewart’s gives 4²·4 + 5²·2 = AD²·6 + 2·4·6, so AD² = (16·4 + 25·2 – 48)/6 = (64 + 50 – 48)/6 = 66/6 = 11, hence AD = √11.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 27, "abstractions": ["<note1>\n  <description>For any quadrilateral inscribed in a circle, the sum of each pair of opposite angles equals 180°. This lets you relate unknown interior angles when five or more points lie on a circle.</description>\n  <example>Suppose points P, Q, R, S lie on a circle. If ∠PQR = 70°, then ∠PSR = 110° because they are opposite angles.</example>\n</note1>\n<note2>\n  <description>The Law of Cosines relates the lengths of sides of a triangle to the cosine of one of its angles: for triangle XYZ, x² = y² + z² − 2yz·cos(∠Y). Use this to find an angle or side when three sides or two sides and the included angle are known.</description>\n  <example>In triangle XYZ, if XY = a, YZ = b, XZ = c, then cos(∠Y) = (a² + b² − c²)/(2ab). If a = 5, b = 7, c = 8, then ∠Y = arccos((25 + 49 − 64)/(70)) = arccos(10/70).</example>\n</note2>\n<note3>\n  <description>In a circle of radius R, the chord length opposite an inscribed angle θ is given by 2R·sin(θ). This converts a geometric chord problem into a trigonometric one.</description>\n  <example>For a circle of radius 10 and an inscribed angle of 30°, the chord length is 2·10·sin(30°) = 20·0.5 = 10.</example>\n</note4>\n<note5>\n  <description>When a point M is the midpoint of segment AE, the Law of Cosines applied to triangle AME yields AM² = AE²/4 + EM² + AE·EM·cos(θ), where θ is the angle between AE and EM. This helps relate distances involving the midpoint.</description>\n  <example>Let AE = d and EM = e, with angle ∠AEM = φ. Then AM = ½·√(d² + e² − 2de·cos(φ)).</example>\n</note6>\n<note7>\n  <description>The Power of a Point theorem states that for any point P and circle, the product of the lengths of segments from P to the two intersection points with the circle is constant. Use it to relate distances from P to two chords.</description>\n  <example>If a line through P meets the circle at U and V, and another line through P meets at W and X, then PU·PV = PW·PX. For instance, if PU = 3 and PV = 4, then any other chord through P has products matching 12.</example>", "<note1>\n  <description>\nIn an isosceles trapezoid, the nonparallel sides are equal in length and the base angles at each base are equal. This symmetry allows one to drop perpendiculars from the endpoints of one base to the other to create right triangles. \n</description>\n  <example>\nConsider a trapezoid with bases of lengths b₁ and b₂ and nonparallel sides of length s. Dropping perpendiculars from the endpoints of the shorter base to the longer base splits the longer base into three segments: two equal segments of length (b₂−b₁)/2 and one central segment of length b₁. The right triangles then have legs (b₂−b₁)/2 and the height h, with hypotenuse s.\n</example>\n</note1>\n<note2>\n  <description>\nThe Pythagorean theorem relates the legs and hypotenuse of a right triangle: if the legs have lengths a and b and the hypotenuse has length c, then a² + b² = c². Use this to find any one of the three lengths when the other two are known. \n</description>\n  <example>\nIn a right triangle with legs of lengths 3 and 4, the hypotenuse is c = √(3² + 4²) = 5. Conversely, if the hypotenuse is 10 and one leg is 6, the other leg is √(10² − 6²) = 8.\n</example>\n</note3>\n<note3>\n  <description>\nA point lies on a circle of radius R centered at O if and only if the distance from O to that point equals R. For any two points P and Q on the same circle, the length PQ can be found by the chord length formula: PQ = 2R·sin(∠POQ/2), where ∠POQ is the central angle subtended by PQ. \n</description>\n  <example>\nIn a circle of radius 5, two points P and Q subtend a central angle of 60°. Then the chord PQ = 2·5·sin(60°/2) = 10·sin(30°) = 5. \n</example>\n</note4>\n<note4>\n  <description>\nThe midpoint M of a segment AB has coordinates that are the averages of the corresponding coordinates of A and B. If A = (x₁,y₁) and B = (x₂,y₂), then M = ((x₁+x₂)/2, (y₁+y₂)/2). This is useful for simplifying coordinate geometry problems. \n</description>\n  <example>\nGiven points A = (1,2) and B = (5,6), the midpoint M is ((1+5)/2, (2+6)/2) = (3,4). \n</example>\n</note5>\n<note5>\n  <description>\nThe Law of Cosines generalizes the Pythagorean theorem to any triangle: for sides a, b, c with opposite angles A, B, C, one has c² = a² + b² − 2ab·cos(C). Use it to find an unknown side or angle when two sides and their included angle or all three sides are known. \n</description>\n  <example>\nIn a triangle with sides of lengths 7 and 9 and included angle 60°, the third side is c = √(7² + 9² − 2·7·9·cos(60°)) = √(49 + 81 − 126·0.5) = √(130 − 63) = √67.\n</example>\n</note6>", "<note1>\n  <description>Midpoint Lemma: In any triangle, the segment joining the midpoints of two sides is parallel to the third side and half its length. Use this to relate lengths and parallelism in trapezoid and cyclic configurations.</description>\n  <example>In triangle PQR, let M and N be midpoints of PQ and PR. Then MN ∥ QR and MN = ½·QR. This can be used to show that certain quadrilaterals are parallelograms or to derive parallel lines in cyclic figures.</example>\n</note2>\n  <description>Parallelism and Angle Chasing: In an isosceles trapezoid, the legs are equal and the base angles are equal. Use parallel lines (bases) to transfer angles and establish cyclic quadrilaterals or equal angles for further deductions.</description>\n  <example>Given trapezoid WXYZ with WX ∥ YZ and WX = YZ, one has ∠WXY = ∠YZX. If a point K lies on YZ extended, then ∠WXY = ∠KYZ, showing that W, Y, Z, K are concyclic or that certain angles are supplementary.</example>\n</note3>\n  <description>Ptolemy’s Theorem: For any cyclic quadrilateral with sides a, b, c, d and diagonals p, q, one has a·c + b·d = p·q. Use this to relate side lengths and diagonals when five points lie on a circle.</description>\n  <example>In cyclic quadrilateral ABCD, if AB = 6, BC = 8, CD = 10, DA = 12, and diagonal AC = 13, then by Ptolemy, 6·10 + 8·12 = 13·BD, so BD = (60 + 96)/13 = 12.</example>\n</note4>\n  <description>Power of a Point: For a point E outside a circle, if a secant through E meets the circle at A and B (with A closer to E), then EA·EB equals the square of the tangent length from E. This relates distances from E to intersecting chords.</description>\n  <example>Let E be outside a circle with tangent ET = 3. A secant from E meets the circle at A and B, with EA = 2. Then EB = (ET)²/EA = 9/2. This can be used to find unknown segment lengths on secants.</example>\n</note5>\n  <description>Law of Cosines in Cyclic Contexts: In any triangle, a² = b² + c² − 2bc·cos(A). When points lie on a circle, use this to find angles or side lengths, especially when two sides and the included angle are known.</description>\n  <example>In triangle DEF inscribed in a circle of radius R, if DE = p, EF = q, and ∠DEF = θ, then DF² = p² + q² − 2pq·cos(θ). For θ = 60°, DF² = p² + q² − pq, which can be used to compute DF given p and q.</example>", "<note1>\n  <description>Four points lie on a circle if and only if the perpendicular bisectors of any two chords between them intersect. Equivalently, the power of a point formula or the cyclic quadrilateral angle property can be used to check collinearity.</description>\n  <example>Given points P, Q, R, S, construct the perpendicular bisectors of PR and QS; if they meet at a single point O, then P, Q, R, S are concyclic. Alternatively, verify ∠PQR + ∠PSR = 180°.</example>\n</note1>\n<note2>\n  <description>In an isosceles trapezoid, the nonparallel sides (legs) are congruent, and the base angles adjacent to each base are equal. These properties yield symmetry and equal-length relations useful in coordinate or synthetic proofs.</description>\n  <example>Label the trapezoid with bases BC and AD and legs AB, CD. Then AB = CD and ∠ABC = ∠BCD, ∠BAD = ∠ADC. Use these equalities to place coordinates symmetrically or to relate angles in angle-chasing.</example>\n</note3>\n<note3>\n  <description>The Power of a Point theorem states that for any point P and a circle, if a line through P meets the circle at X and Y, then PX·PY is constant. This can relate segments from P to points on the circle or to tangents.</description>\n  <example>Let P be a point outside a circle, and let the secant through P meet the circle at U and V. Then PU·PV equals the square of the tangent length from P. Use this to find unknown segment lengths when one segment is known.</example>\n</note4>\n<note4>\n  <description>The Midpoint-Radius Relation in a circle: for any chord AB and its midpoint M, the perpendicular from the circle’s center O to the chord passes through M, and OM² + (AB/2)² = R², where R is the radius.</description>\n  <example>Given a circle of radius R, a chord AB, and its midpoint M, drop the perpendicular from O to meet AB at M. Then OM² + (AB/2)² = R². Use this to compute OM when AB is known or vice versa.</example>\n</note5>\n<note5>\n  <description>In a circle of radius R, any central angle θ (in radians) subtends an arc length s = Rθ and a chord length c = 2R·sin(θ/2). These formulas link angles, arc lengths, and chord lengths.</description>\n  <example>A chord subtends a central angle of 60° in a circle of radius R. Then its chord length is c = 2R·sin(30°) = R. Use these to convert between angles at the center and chord lengths.</example>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 28, "abstractions": ["<note1>\n  <description>The circumradius of a right triangle equals half the hypotenuse. In a right triangle with legs a and b and hypotenuse c, the circumcenter lies at the midpoint of the hypotenuse, so R = c/2. This lets you convert given circumradii directly into the lengths of corresponding hypotenuses.</description>\n  <example>Given a right triangle with legs 6 and 8, the hypotenuse is 10, so its circumradius is 10/2 = 5. Conversely, if a right triangle has circumradius 7, its hypotenuse must be 14.</example>\n</note1>\n<note2>\n  <description>In any triangle, the circumradius formula R = a/(2 sin A) relates a side a to its opposite angle A. This is useful when you know a circumradius and an angle but need the corresponding side length.</description>\n  <example>For a triangle with circumradius 10 and an angle of 30° opposite side a, we get a = 2 R sin 30° = 2×10×½ = 10.</example>\n</note3>\n<note3>\n  <description>For an acute triangle, the circumradius satisfies R &gt; a/2 for each side a, since sin A &gt; a/(2 R) when A is acute. This inequality can detect invalid constructions or help bound unknown sides.</description>\n  <example>If a triangle’s circumradius is 8 but one side is claimed to be 17, then R &gt; a/2 gives 8 &gt; 17/2 = 8.5, which is false, so that side cannot be 17 in an acute triangle.</example>\n</note4>\n<note4>\n  <description>The Law of Cosines, c² = a² + b² − 2ab cos C, connects side lengths and the cosine of the included angle. Use it to express one side in terms of others and the angle, especially when angles are known or can be related.</description>\n  <example>In a triangle with sides a = 5, b = 7, and included angle C = 60°, the third side c satisfies c² = 25 + 49 − 2×5×7×½ = 74 − 35 = 39, so c = √39.</example>\n</note5>\n<note5>\n  <description>When a point satisfies multiple geometric constraints (e.g. perpendicularity and equal circumradii), combine these using distance formulas and angle relations to form a system of equations. Solving that system yields the desired lengths.</description>\n  <example>Suppose point P is at distances 5 and 13 from two fixed points A and B, and ∠APB = 90°. Using AP² + BP² = AB² gives 25 + 169 = AB², so AB = √194. If this also matches a given acute circumradius condition, consistency confirms the solution.</example>\n</note6>", "<note1>\n  <description>  \nThe circumradius of any triangle with sides a, b, c and area Δ is given by R = (a·b·c)/(4Δ). This formula follows from the extended Law of Sines and applies to all triangles.  \n</description>\n  <example>  \nFor a triangle with side lengths 5, 6, and 7, first compute its area via Heron’s formula: s=(5+6+7)/2=9, Δ=√[9·4·3·2]=√216=6√6. Then R=(5·6·7)/(4·6√6)=210/(24√6)=35/(4√6).  \n</example>\n</note1>\n<note2>\n  <description>  \nIn a right triangle with legs of lengths x and y and hypotenuse c, the circumradius is R = c/2. This follows because the hypotenuse is the diameter of the circumcircle.  \n</description>\n  <example>  \nA right triangle has legs of lengths 8 and 15, so its hypotenuse is c=√(8²+15²)=17. Thus its circumradius is R=17/2=8.5.  \n</example>\n</note2>\n<note3>\n  <description>  \nIf two triangles share the same circumcircle, then their orthocenters are symmetric with respect to the circle’s center. This symmetry can relate the altitudes and distances from the center to the sides.  \n</description>\n  <example>  \nConsider two triangles inscribed in the same circle. If one triangle’s altitude from one vertex is 6 units, then the other triangle’s corresponding altitude is also 6 units, because their orthocenters are reflections across the circumcenter.  \n</example>\n</note3>\n<note4>\n  <description>  \nIn any cyclic quadrilateral, Ptolemy’s theorem states that the product of the diagonals equals the sum of the products of opposite sides: d₁·d₂ = a·c + b·d. This is useful for relating side lengths when a cyclic quadrilateral is formed.  \n</description>\n  <example>  \nA cyclic quadrilateral has sides of lengths 3, 4, 5, and 6 in order. If its diagonals are d₁ and d₂, then d₁·d₂ = 3·5 + 4·6 = 15 + 24 = 39.  \n</example>\n</note4>\n<note5>\n  <description>  \nWhen a point X inside a rectangle subtends a right angle at A and B, X lies on the circle with diameter AB. This circle’s center is the midpoint of AB, and its radius is half of AB.  \n</description>\n  <example>  \nIn a rectangle with side lengths a and b, if X satisfies ∠AXB=90°, then X is on the circle centered at the midpoint of AB with radius a/2. Thus any point X on that circle will form a right angle at A and B.  \n</example>\n</note5>", "<note1>\n  <description>In any triangle with circumradius R and side length a, the formula a = 2R sin A relates its side to its opposite angle and the circumradius. Use this to express unknown side lengths in terms of known angles and R.</description>\n  <example>For a triangle with circumradius R and an angle of 30° opposite side a, compute a = 2·R·sin 30° = R.</example>\n</note2>\n  <description>The Law of Sines states that for any triangle, a/sin A = b/sin B = c/sin C = 2R. This lets you convert between side ratios and angle measures or between angles and circumradii.</description>\n  <example>In a triangle where one side is b and the angle opposite is B, and the circumradius is R, then b = 2R sin B. If B = 45° and R = 10, then b = 2·10·sin 45° = 10√2.</example>\n</note3>\n  <description>The circumradius of a right triangle can be found by R = (hypotenuse)/2. When two triangles share an angle and one is right-angled, their circumradii can be compared to that shared angle.</description>\n  <example>For a right triangle with hypotenuse h, its circumradius is R = h/2. If h = 14, then R = 7.</example>\n</note4>\n  <description>When triangles share an interior or exterior angle, the Law of Sines yields ratios of their sides that equal the ratio of their circumradii. This allows solving for unknown sides or angles.</description>\n  <example>Triangles 1 and 2 share angle θ. If triangle 1 has circumradius R₁ and triangle 2 has R₂, then side₁/sin θ = side₂/sin θ = 2R₁ for triangle 1 and similarly for 2. Hence side₁/side₂ = R₁/R₂.</example>\n</note5>\n  <description>After establishing side-angle relationships, solve the resulting algebraic equations (often quadratic) for the unknown lengths or angles. Always check that solutions are positive and satisfy the triangle’s angle-sum condition.</description>\n  <example>From side₁/s = k and side₂ = m, solve s = side₁/k and verify 0 < s < m and the total of all sides is positive before accepting the solution.</example>", "<note1>\n  <description>\nIn any triangle, the circumradius R is given by R = (a b c) / (4 · area). This links side lengths and area to the circle’s radius.\n</description>\n  <example>\nConsider a triangle with sides 3, 4, and 5. Its area is ½·3·4 = 6, so the circumradius is R = (3·4·5)/(4·6) = 60/24 = 2.5.\n</example>\n</note1>\n<note2>\n  <description>\nWhen two triangles share a common side or angle, their circumradii relate via that shared element. In particular, if two triangles share a side s, then R₁/R₂ = (a₁·b₁·c₁)/(a₂·b₂·c₂) simplifies by s² in both numerators and denominators, yielding R₁/R₂ = (other sides of first)/(other sides of second).\n</description>\n  <example>\nTwo triangles with shared side s = 4 have circumradii R₁ = 5 and R₂ = 3. If the triangles differ in side lengths a and b, then 5/3 = a·b/ (4·c), which can be solved for the unknown sides.\n</example>\n</note1>\n<note3>\n  <description>\nIn a rectangle, the diagonals are congruent and bisect each other. Thus, if X is a point inside, the distances from X to the four corners satisfy XA² + XC² = XB² + XD², and XC = XD.\n</description>\n  <example>\nIn a rectangle with sides 6 and 8, the diagonal length is √(6²+8²)=10. If X is inside and XA = 3, then XC = 10²−3² = 91, so X to the opposite corner is √91.\n</example>\n</note1>\n<note4>\n  <description>\nA right angle at X implies X lies on the circle with AB as diameter (Thales’ theorem). For any point Y on that circle, ∠AYB = 90°. Thus, if ∠AXB = 90°, then X is on the circle whose diameter is AB.\n</description>\n  <example>\nIf AB is a segment of length 10, then any point X that makes ∠AXB = 90° must lie on the circle with AB as diameter, whose radius is 5.\n</example>\n</note1>\n<note5>\n  <description>\nTo find the unknown side of a rectangle when you know distances from an interior point to three corners, set up the diagonal relations XA² + XC² = XB² + XD² and use the fact that XA + XC = XB + XD. Solve the resulting system for the missing side.\n</description>\n  <example>\nSuppose in a rectangle with sides x and y, XA = 5, XC = 7, XB = 6, XD = 8. Then 5²+7² = 6²+8² gives 25+49 = 36+64, which holds. Using XA + XC = XB + XD (5+7=6+8) also checks out, confirming consistency.\n</example>\n</note1>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
{"row_idx": 29, "abstractions": ["<note1>\n  <description>When a plane intersects a right rectangular prism, the intersection is an n-gon whose side lengths are chords of the prism’s edges. The longest side corresponds to the prism’s longest edge, and other sides are projections of the midpoints of edges onto the plane.</description>\n  <example>Suppose a prism has edges of lengths a, b, c. A plane cutting through its midpoints yields an intersection whose sides are chords of lengths a, b, c, arranged in the order they appear along the edges. The longest chord is the prism’s longest edge, and the others follow from orthogonal projections.</example>\n</note1>\n<note2>\n  <description>Project each edge of the prism onto the plane by dropping perpendiculars from the endpoints. Each side of the intersection polygon is the projection of an edge segment, given by the formula projected_length = |original_length|·cos θ, where θ is the dihedral angle between the prism face and the cutting plane.</description>\n  <example>If an edge of length L is at angle θ to the cutting plane, then its projection onto the plane is L·cos θ. For instance, if the prism’s face angle is 60° and the cutting plane is at a 30° tilt, the projection is L·cos 30°.</example>\n</note3>\n<note3>\n  <description>Identify the longest chord in the intersection as the prism’s longest edge. Use this to set up the equation for the dihedral angle θ between the prism’s face and the cutting plane: longest_edge_length = face_edge_length·cos θ.</description>\n  <example>Given that the prism has edges a, b, c (with c the longest) and the intersection chord is c, one writes c = a·cos θ. Solving gives cos θ = c/a, which yields θ = arccos(c/a).</example>\n</note4>\n<note4>\n  <description>Relate the distance d from the prism’s center to the cutting plane via the right triangle formed by d and the prism’s half-edge. Specifically, d = half_edge_length·sin θ, where θ is the dihedral angle from note 3.</description>\n  <example>If the prism’s half-edge is H and the plane makes angle θ with the prism face, then d = H·sin θ. For instance, if H = 5 and θ = 30°, then d = 5·sin 30° = 2.5.</example>\n</note5>\n<note5>\n  <description>Validate the computed distance by checking that all projected edge lengths satisfy the original intersection side lengths. Ensure consistency with the prism’s geometry and the sum of squares of projected lengths matches the sum of squares of the actual edges.</description>\n  <example>After finding d and θ, compute each projected length L_i = L_i·cos θ and verify they match the given intersection sides. Also confirm that d = H·sin θ and that projected lengths sum correctly to the total edge lengths.</example>", "<note1>\n  <description>When a plane cuts a rectangular prism, the intersection is a polygon whose side lengths relate to the prism’s edge lengths via orthogonal projections. Each side of the polygon is the projection of a prism edge onto the plane, so its length equals the prism edge length times the cosine of the angle between that edge and the plane.</description>\n  <example>Suppose a prism has edges of lengths a, b, c, and a plane makes angle θ with the prism’s c-axis. The side of the intersection corresponding to edge b has length b·cosθ.</example>\n</note1>\n<note2>\n  <description>To find the angle between a line and a plane, use the relation sinθ = |line→·normal|/|line→||normal|, where line→ is a direction vector of the line and normal is the plane’s normal. This gives the sine of the dihedral angle between the line and the plane.</description>\n  <example>Given a line direction vector v and plane normal n, compute sinθ = |v·n|/(|v||n|). For instance, if v·n = 3, |v| = 5, |n| = 4, then sinθ = 3/20.</example>\n</note3>\n<note4>\n  <description>If the prism is centered at the origin, the distance d from the center to the plane can be expressed as d = (a·cosθ₁ + b·cosθ₂ + c·cosθ₃)/√(sin²θ₁ + sin²θ₂ + sin²θ₃), where θᵢ are the angles between each axis and the plane. This follows from summing the projections of the prism’s edges onto the plane’s normal.</description>\n  <example>For a centered prism with edge projections p₁, p₂, p₃ onto the plane’s normal, and sinθ₁ = 0.2, sinθ₂ = 0.3, sinθ₃ = 0.4, then d = (p₁+ p₂+ p₃)/√(0.2²+0.3²+0.4²).</example>\n</note5>\n<note6>\n  <description>The sum of the squares of the sine of the dihedral angles between the three coordinate planes and the cutting plane equals one: sin²θ₁ + sin²θ₂ + sin²θ₃ = 1. This orthogonality condition ensures the plane is well-defined in space.</description>\n  <example>If sinθ₁ = 0.6, sinθ₂ = 0.8, then sinθ₃ must satisfy sin²θ₃ = 1 − (0.6²+0.8²) = 0, so θ₃ = 0 (i.e., the plane coincides with the third coordinate plane).</example>\n</note6>", "<note1>\n  <description>When a plane cuts a rectangular prism, the intersection is a polygon whose side lengths equal the distances between the prism’s edges parallel to those sides, multiplied by the plane’s normal’s components. This follows from projecting edges onto the plane’s normal.</description>\n  <example>Suppose a prism has edge lengths a, b, c, and the cutting plane has normal vector (n₁,n₂,n₃). Then the intersection has sides of lengths |n₁·a|, |n₂·b|, |n₃·c|, etc., in the order corresponding to which face each side projects from.</example>\n</note2>\n  <description>For a rectangular prism of side lengths a, b, c, any plane intersects its edges at points whose distances from a chosen vertex satisfy linear relations. Specifically, if the plane’s normal components are (n₁,n₂,n₃), then the distances along the edges are proportional to (|n₁|,|n₂|,|n₃|).</description>\n  <example>Consider a prism with edges of lengths a, b, c. A plane with normal (n₁,n₂,n₃) intersects the edges from the origin at points (d₁,0,0), (0,d₂,0), (0,0,d₃) where d₁ = |n₁|·a, d₂ = |n₂|·b, d₃ = |n₃|·c.</example>\n</note3>\n  <description>To find the plane’s normal components from its intersection side lengths, set up equations dᵢ = |nᵢ|·Lᵢ for each side length dᵢ and corresponding prism edge Lᵢ. Solve the resulting system for |nᵢ|, then determine the sign of each nᵢ by the order of the intersection polygon.</description>\n  <example>Given intersection sides d₁,d₂,d₃ and prism edges a,b,c, solve |n₁|·a = d₁, |n₂|·b = d₂, |n₃|·c = d₃ for |nᵢ|. Then assign n₁,n₂,n₃ their correct signs so that the polygon’s vertices appear in the expected cyclic order.</example>\n</note4>\n  <description>The distance D from the prism’s center to the plane can be computed as the dot product of the center’s edge-coordinates with the normalized normal vector: D = (|n₁|·a/2 + |n₂|·b/2 + |n₃|·c/2) / √(n₁² + n₂² + n₃²).</description>\n  <example>With prism center at (a/2,b/2,c/2) and normal (n₁,n₂,n₃), compute D = [(a|n₁|+b|n₂|+c|n₃|)/2] / √(n₁²+n₂²+n₃²), giving the perpendicular distance from the center to the cutting plane.</example>\n</note5>\n  <description>A quick consistency check is to verify that the sum of the squares of the intersection side lengths equals the sum of the squares of the prism’s edge lengths times the square of the plane’s unit normal’s components: ∑dᵢ² = (a²+b²+c²)(n₁²+n₂²+n₃²).</description>\n  <example>If prism edges a,b,c give a²+b²+c² = S and intersection sides d₁,d₂,d₃ give ∑dᵢ² = T, then ensure T = S·(n₁²+n₂²+n₃²). If this holds, the computed normal components and distance are consistent.</example>", "<note1>\n  <description>When a plane cuts a right prism, the intersection is a polygon whose side lengths equal the distances between the parallel faces of the prism along the direction of the cut. This holds because the plane slices through each lateral face at a constant offset.</description>\n  <example>Consider a right prism with a rectangular base and side lengths a and b, and height h. A plane parallel to the base at distance d from one base cuts the prism. The resulting hexagon has three side lengths a, three side lengths b, and the remaining sides equal to the distances between the two bases along the direction of the cut, which are both h.</example>\n</note1>\n<note2>\n  <description>Label the prism’s face-edge distances as a, b, c (for the three distinct face pairs). If the cutting plane intersects the prism at distances x and y from two opposite faces, then the side lengths of the intersection polygon alternate as a, b, c, a, b, c, and the sum of opposite sides equals a+b+c.</description>\n  <example>For a prism with face-edge distances a=3, b=4, c=5, a plane at distance x=1 from one base and y=2 from the opposite base gives an intersection with side lengths 3,4,5,3,4,5, since each face-edge distance appears twice.</example>\n</note1>\n<note3>\n  <description>Use the property that in any alternating sequence of side lengths a, b, c, a, b, c, the sum of the first and fourth sides equals the sum of the second and fifth sides, and similarly for the third and sixth. This yields equations like a+c = b+d and b+c = a+e.</description>\n  <example>Given sides [45,66,63,55,54,77], note that 45+55 = 100 and 66+54 = 120, so the third side 63 plus the sixth side 77 must also sum to 120 (63+77=140), which is inconsistent. This inconsistency signals a mislabeling or error in the problem statement.</example>\n</note1>\n<note4>\n  <description>Translate the alternating-sum constraints into a system of linear equations in x and y (the distances from the two opposite faces). Solve for x and y to find the plane’s offset from one base.</description>\n  <example>For face-edge distances a=2, b=3, c=4, and observed sides [2,3,4,2,3,4], set up x+y = 2+3 = 5 and 3x+4y = 2+4 = 6. Solving gives x=2, y=3, so the plane is at distance 2 from one base and 3 from the other.</example>\n</note1>\n<note5>\n  <description>Compute the distance from the prism’s center to the cutting plane by averaging the distances to the two opposite faces: distance = (x + y)/2. This is valid because the center lies midway between those faces.</description>\n  <example>If x=1 and y=3, then the center-to-plane distance is (1+3)/2 = 2. This yields the final answer without computing any angles or normals.</example>\n</note1>"], "abstractions_meta": [[true, false], [true, false], [true, false], [true, false]], "gpu_before": null, "gpu_after": null}
